//ирМобильный Перем ирМобильный Экспорт;
//ирМобильный Перем ирОбщий Экспорт;
//ирМобильный Перем ирСервер Экспорт;
//ирМобильный Перем ирКэш Экспорт;
//ирМобильный Перем ирПривилегированный Экспорт;

Процедура КнопкаОКНажатие(Кнопка)
	
	ирКэш.Получить().СинтаксическийКонтрольПередЗаписью = СинтаксическийКонтрольПередЗаписью;
	ирКэш.Получить().ВыполнятьАлгоритмыЧерезВнешниеОбработки = ВыполнятьАлгоритмыЧерезВнешниеОбработки;
	ирКэш.Получить().ПоказыватьВнешниеИсключенияПриВыполненииАлгоритмов = ПоказыватьВнешниеИсключенияПриВыполненииАлгоритмов;
	ирКэш.Получить().ФиксироватьВнешниеИсключенияАлгоритмов = ФиксироватьВнешниеИсключенияАлгоритмов;
	ирКэш.Получить().ФайловыйКэшАлгоритмовДопускаетРедактирование = ФайловыйКэшАлгоритмовДопускаетРедактирование;
	ирКэш.Получить().ПроверитьСтруктуруФайловогоКэша();
	ирКэш.Получить().СохранитьНастройкиАлгоритмов();
	Закрыть();
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	КаталогДинамическихВнешнихОбработок = ирКэш.Получить().ПапкаКешаВнешнихОбработокАлгоритмов.ПолноеИмя;
	ФайловыйКэшАлгоритмовДопускаетРедактирование = ирКэш.Получить().ФайловыйКэшАлгоритмовДопускаетРедактирование;
	СинтаксическийКонтрольПередЗаписью = ирКэш.Получить().СинтаксическийКонтрольПередЗаписью;
	ВыполнятьАлгоритмыЧерезВнешниеОбработки = ирКэш.Получить().ВыполнятьАлгоритмыЧерезВнешниеОбработки;
	ПоказыватьВнешниеИсключенияПриВыполненииАлгоритмов = ирКэш.Получить().ПоказыватьВнешниеИсключенияПриВыполненииАлгоритмов;
	ФиксироватьВнешниеИсключенияАлгоритмов = ирКэш.Получить().ФиксироватьВнешниеИсключенияАлгоритмов;
	ФиксироватьВнешниеИсключенияАлгоритмовПриИзменении(ЭлементыФормы.ФиксироватьВнешниеИсключенияАлгоритмов);
	
	Если ирКэш.Получить().Это2iS Тогда
		ЭлементыФормы.ВыполнятьАлгоритмыЧерезВнешниеОбработки.Доступность = Ложь;
		ЭлементыФормы.ФиксироватьВнешниеИсключенияАлгоритмов.Доступность = Ложь;
		ЭлементыФормы.СинтаксическийКонтрольПередЗаписью.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура КаталогДинамическихВнешнихОбработокОткрытие(Элемент, СтандартнаяОбработка)
	
	ЗапуститьПриложение(Элемент.Значение);
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

Процедура ОчиститьНажатие(Элемент)
	
	ирКэш.Получить().ОчиститьКешАлгоритмов(Истина);
	
КонецПроцедуры

Процедура ФиксироватьВнешниеИсключенияАлгоритмовПриИзменении(Элемент)
	
	ЭлементыФормы.ПоказыватьВнешниеИсключенияПриВыполненииАлгоритмов.Доступность = Элемент.Значение;
	
КонецПроцедуры

Процедура ВыполнятьАлгоритмыЧерезВнешниеОбработкиПриИзменении(Элемент)

	ЭлементыФормы.ФайловыйКэшАлгоритмовДопускаетРедактирование.Доступность = Элемент.Значение;
	
КонецПроцедуры

//ирМобильный #Если Клиент Тогда
//ирМобильный Контейнер = Новый Структура();
//ирМобильный Оповестить("ирПолучитьБазовуюФорму", Контейнер);
//ирМобильный Если Не Контейнер.Свойство("ирМобильный", ирМобильный) Тогда
//ирМобильный 	ПолноеИмяФайлаБазовогоМодуля = ВосстановитьЗначение("ирПолноеИмяФайлаОсновногоМодуля");
//ирМобильный 	ирМобильный = ВнешниеОбработки.ПолучитьФорму(ПолноеИмяФайлаБазовогоМодуля);
//ирМобильный КонецЕсли; 
//ирМобильный ирОбщий = ирМобильный.ПолучитьОбщийМодульЛкс("ирОбщий");
//ирМобильный ирКэш = ирМобильный.ПолучитьОбщийМодульЛкс("ирКэш");
//ирМобильный ирСервер = ирМобильный.ПолучитьОбщийМодульЛкс("ирСервер");
//ирМобильный ирПривилегированный = ирМобильный.ПолучитьОбщийМодульЛкс("ирПривилегированный");
//ирМобильный #КонецЕсли

ирОбщий.ИнициализироватьФормуЛкс(ЭтаФорма, "Обработка.ирПлатформа.Форма.НастройкиАлгоритмов");
