
Процедура ЗаполнитьПользователиОС()
	ДеревоПользователиОС.Строки.Очистить();
	ДеревоПользователиСырые = ПользователиОС();
	Если ирКэш.ЛиПлатформаWindowsЛкс() Тогда
		ГруппаСлужебные = ДеревоПользователиСырые.Добавить();
		ГруппаСлужебные.ИмяДомена = "NT AUTHORITY";
		ГруппаСлужебные.ИмяСервера = "localhost";
		ГруппаСлужебные.Локальный = Ложь;
		ГруппаСлужебные.Пользователи.Добавить("NetworkService");
		ГруппаСлужебные.Пользователи.Добавить("LocalService");
		ГруппаСлужебные.Пользователи.Добавить("LocalSystem");
	КонецЕсли;
	Для Каждого СтрокаСервера Из ДеревоПользователиСырые Цикл
		СервераWindowsДерево = ДеревоПользователиОС.Строки.Добавить();
		СервераWindowsДерево.Представление = "" + СтрокаСервера.ИмяДомена + "(" + СтрокаСервера.ИмяСервера + ")";
		СервераWindowsДерево.Значение = СтрокаСервера.ИмяДомена;
		Для Каждого СтрокаПользователя Из СтрокаСервера.Пользователи Цикл
			ТекущиеДанные = СервераWindowsДерево.Строки.Добавить();
			ТекущиеДанные.Значение = СтрокаПользователя;
			ТекущиеДанные.Представление = СтрокаПользователя;
			Если "\\"+СервераWindowsДерево.Значение+"\"+ТекущиеДанные.Значение  = ВыбранныйПользователь Тогда
				ЭлементыФормы.ДеревоПользователиОС.ТекущаяСтрока = ТекущиеДанные;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

// Процедура - обаботчик события "ПриОткрытии" Формы
//
Процедура ПриОткрытии()
	ирКлиент.Форма_ПриОткрытииЛкс(ЭтаФорма);
	ЗаполнитьПользователиОС()
КонецПроцедуры
	
	// Процедура - обаботчик события "ПриВыводеСтроки"  табличного поля "ДеревоПользователиОС"
	//
Процедура ПользователиWindowsПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки) Экспорт
	Если ДанныеСтроки.Уровень() = 1 Тогда
		ОформлениеСтроки.Ячейки.Представление.Картинка = БиблиотекаКартинок.Пользователь;
		ОформлениеСтроки.Ячейки.Представление.ОтображатьКартинку = Истина;
	КонецЕсли;
КонецПроцедуры

// Процедура - обаботчик события, при нажатии на кнопку "ОК" Командной панели "ОсновныеДействияФормы"
//
Процедура ОсновныеДействияФормыОК(Кнопка)
	ТекущиеДанные = ЭлементыФормы.ДеревоПользователиОС.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено или Не ТекущиеДанные.Уровень() = 1 Тогда
		Предупреждение("Выберите пользователя Windows");
	Иначе
		Закрыть("\\"+ТекущиеДанные.Родитель.Значение+"\"+ТекущиеДанные.Значение);
	КонецЕсли;
КонецПроцедуры

// Процедура - обаботчик события "Выбор"  табличного поля "ДеревоПользователиОС"
//
Процедура ПользователиWindowsВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	ТекущиеДанные = ЭлементыФормы.ДеревоПользователиОС.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено и ТекущиеДанные.Уровень() = 1 Тогда
		Закрыть("\\"+ТекущиеДанные.Родитель.Значение+"\"+ТекущиеДанные.Значение);
	КонецЕсли;
КонецПроцедуры

// Процедура - обаботчик события, при нажатии на кнопку "Обновить" Командной панели "КоманднаяПанельПользователиWindows"
//
Процедура КоманднаяПанельПользователиWindowsОбновить(Кнопка)
	ЗаполнитьПользователиОС();
КонецПроцедуры

Процедура ПриЗакрытии()
	ирКлиент.Форма_ПриЗакрытииЛкс(ЭтаФорма);
КонецПроцедуры

Процедура ВнешнееСобытие(Источник, Событие, Данные) Экспорт
	ирКлиент.Форма_ВнешнееСобытиеЛкс(ЭтаФорма, Источник, Событие, Данные);
КонецПроцедуры

Процедура ТабличноеПолеПриПолученииДанных(Элемент, ОформленияСтрок) Экспорт
	ирКлиент.ТабличноеПолеПриПолученииДанныхЛкс(ЭтаФорма, Элемент, ОформленияСтрок);
КонецПроцедуры

ирКлиент.ИнициироватьФормуЛкс(ЭтаФорма, "Обработка.ирПлатформа.Форма.ВыборПользователяОС");
ДеревоПользователиОС.Колонки.Добавить("Значение");
