Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	Отказ = Истина;
	КопияСтрокиДляОбработки = СтрокиДляОбработки.Скопировать(Новый Структура(мИмяКолонкиПометки, Истина));
	Объекты = КопияСтрокиДляОбработки.ВыгрузитьКолонку("Ссылка");
	ирОбщий.ОткрытьФормуСпискаЛкс(ТипЗнч(Объекты[0]),,,,,,,, Новый Структура("Ссылка", Объекты));

КонецПроцедуры // ПередОткрытием()

Процедура ТабличноеПолеПриПолученииДанных(Элемент, ОформленияСтрок) Экспорт 
	
	ирОбщий.ТабличноеПолеПриПолученииДанныхЛкс(ЭтаФорма, Элемент, ОформленияСтрок);

КонецПроцедуры

ирОбщий.ИнициализироватьФормуЛкс(ЭтаФорма, "Обработка.ирПодборИОбработкаОбъектов.Форма.ОткрытьВДинамическомСписке");


