
Процедура КнопкаВыполнитьНажатие(Кнопка)

	Если ЗначениеЗаполнено(КаталогЖурналаСервера) Тогда
		Если Не ирОбщий.ЛиКаталогДоступенЛкс(КаталогЖурналаСервера) Тогда
			Возврат;
		КонецЕсли; 
	КонецЕсли; 
	СохранитьЗначение("ирАнализТехножурнала.АвтоочисткаТехножурнала", АвтоочисткаТехножурнала);
	СохранитьЗначение("ирАнализТехножурнала.ВыраниватьДатуПоСерверу", ВыраниватьДатуПоСерверу);
	СохранитьЗначение("ирАнализТехножурнала.КаталогЖурналаСервера", КаталогЖурналаСервера);
	Закрыть(Истина);
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	ЭтаФорма.АвтоочисткаТехножурнала = ВосстановитьЗначение("ирАнализТехножурнала.АвтоочисткаТехножурнала");
	ЭтаФорма.ВыраниватьДатуПоСерверу = ВосстановитьЗначение("ирАнализТехножурнала.ВыраниватьДатуПоСерверу");
	ЭтаФорма.КаталогЖурналаСервера = ВосстановитьЗначение("ирАнализТехножурнала.КаталогЖурналаСервера");
	ЭлементыФормы.КаталогЖурналаСервера.ТолькоПросмотр = ирКэш.Получить().ЭтоФайловаяБаза;
	Если Не ЭлементыФормы.КаталогЖурналаСервера.Доступность Тогда
		ЭтаФорма.КаталогЖурналаСервера = "";
	КонецЕсли; 
	
КонецПроцедуры

Процедура КаталогЖурналаТрассыПриИзменении(Элемент)
	
	ирОбщий.ПолеВводаСИсториейВыбора_ПриИзмененииЛкс(Элемент, Метаданные().Имя);

КонецПроцедуры

Процедура КаталогЖурналаТрассыНачалоВыбора(Элемент, СтандартнаяОбработка)
	
	ирОбщий.ПолеФайловогоКаталога_НачалоВыбораЛкс(Элемент, СтандартнаяОбработка);

КонецПроцедуры

Процедура КаталогЖурналаТрассыНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	ирОбщий.ПолеВводаСИсториейВыбора_НачалоВыбораИзСпискаЛкс(Элемент, Метаданные().Имя);

КонецПроцедуры

Процедура КаталогЖурналаТрассыОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗапуститьПриложение(Элемент.Значение);

КонецПроцедуры

ирОбщий.ИнициализироватьФормуЛкс(ЭтаФорма, "Обработка.ирАнализТехножурнала.Форма.НастройкаЧтения");
