
Процедура КнопкаВыполнитьНажатие(Кнопка)

	Если ЗначениеЗаполнено(КаталогЖурналаСервера) Тогда
		Если Не ирОбщий.ЛиКаталогДоступенЛкс(КаталогЖурналаСервера) Тогда
			Возврат;
		КонецЕсли; 
	КонецЕсли; 
	ирОбщий.СохранитьЗначениеЛкс("ирАнализТехножурнала.АвтоочисткаТехножурнала", АвтоочисткаТехножурнала);
	ирОбщий.СохранитьЗначениеЛкс("ирАнализТехножурнала.ВыраниватьДатуПоСерверу", ВыраниватьДатуПоСерверу);
	ирОбщий.СохранитьЗначениеЛкс("ирАнализТехножурнала.КаталогЖурналаСервера", КаталогЖурналаСервера);
	ирОбщий.СохранитьЗначениеЛкс("ирАнализТехножурнала.КаталогТрассировкиЗапросов", КаталогТрассировкиЗапросов);
	Закрыть(Истина);
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	ирОбщий.Форма_ПриОткрытииЛкс(ЭтаФорма);
	ЭтаФорма.АвтоочисткаТехножурнала = ирОбщий.ВосстановитьЗначениеЛкс("ирАнализТехножурнала.АвтоочисткаТехножурнала");
	ЭтаФорма.ВыраниватьДатуПоСерверу = ирОбщий.ВосстановитьЗначениеЛкс("ирАнализТехножурнала.ВыраниватьДатуПоСерверу");
	ЭтаФорма.КаталогЖурналаСервера = ирОбщий.ВосстановитьЗначениеЛкс("ирАнализТехножурнала.КаталогЖурналаСервера");
	ЭтаФорма.КаталогТрассировкиЗапросов = ирОбщий.ВосстановитьЗначениеЛкс("ирАнализТехножурнала.КаталогТрассировкиЗапросов");
	ЭлементыФормы.КаталогЖурналаСервера.ТолькоПросмотр = ирКэш.Получить().ЭтоФайловаяБаза;
	Если Не ЭлементыФормы.КаталогЖурналаСервера.Доступность Тогда
		ЭтаФорма.КаталогЖурналаСервера = "";
	КонецЕсли; 
	
КонецПроцедуры

Процедура КаталогЖурналаТрассыПриИзменении(Элемент)
	
	ирОбщий.ПолеВводаСИсториейВыбора_ПриИзмененииЛкс(Элемент, ЭтаФорма);

КонецПроцедуры

Процедура КаталогЖурналаТрассыНачалоВыбора(Элемент, СтандартнаяОбработка)
	
	ирОбщий.ПолеФайловогоКаталога_НачалоВыбораЛкс(Элемент, СтандартнаяОбработка);

КонецПроцедуры

Процедура КаталогЖурналаТрассыНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	ирОбщий.ПолеВводаСИсториейВыбора_НачалоВыбораИзСпискаЛкс(Элемент, ЭтаФорма);

КонецПроцедуры

Процедура КаталогЖурналаТрассыОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗапуститьПриложение(Элемент.Значение);

КонецПроцедуры

Процедура ВнешнееСобытие(Источник, Событие, Данные) Экспорт
	
	ирОбщий.Форма_ВнешнееСобытиеЛкс(ЭтаФорма, Источник, Событие, Данные);

КонецПроцедуры

Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	ирОбщий.Форма_ПриЗакрытииЛкс(ЭтаФорма);
	
КонецПроцедуры

Процедура ТабличноеПолеПриПолученииДанных(Элемент, ОформленияСтрок) Экспорт 
	
	ирОбщий.ТабличноеПолеПриПолученииДанныхЛкс(ЭтаФорма, Элемент, ОформленияСтрок);

КонецПроцедуры

ирОбщий.ИнициироватьФормуЛкс(ЭтаФорма, "Обработка.ирАнализТехножурнала.Форма.НастройкаЧтения");
