
Процедура ПриОткрытии()
	
	ОбъектJSON = ирОбщий.ВосстановитьОбъектИзСтрокиJsonЛкс(ПараметрJSON);
	ЭтаФорма.Дерево = ирОбщий.ДеревоЗначенийИзМассиваСтруктурЛкс(ОбъектJSON);
	
КонецПроцедуры

Процедура ДеревоПриАктивизацииСтроки(Элемент)
	
	ирОбщий.ТабличноеПолеПриАктивизацииСтрокиЛкс(ЭтаФорма, Элемент);

КонецПроцедуры

Процедура ДеревоПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	
	ирОбщий.ТабличноеПолеПриВыводеСтрокиЛкс(ЭтаФорма, Элемент, ОформлениеСтроки, ДанныеСтроки);

КонецПроцедуры

ирОбщий.ИнициализироватьФормуЛкс(ЭтаФорма, "Обработка.ирПлатформа.Форма.ДеревоJSON");
