// Версия модуля X.XX
// Встройте этот модуль с именем "ирИнтерфейс" в состав целевой конфигурации, чтобы обеспечить слабую интеграцию с расширением конфигурации.

#Если Клиент Тогда
	
Функция ПредложитьЗагрузитьРасширениеЛкс() Экспорт 
	
	Ответ = Вопрос("Расширение конфигурации ""Инструменты разработчика"" зависимое не установлено. Хотите открыть страницу скачивания?", РежимДиалогаВопрос.ОКОтмена);
	Если Ответ = КодВозвратаДиалога.ОК Тогда
		ЗапуститьПриложение("http://devtool1c.ucoz.ru/load/osnovnye/instrumenty_razrabotchika_rasshirenie_zavisimoe/1-1-0-18");
	КонецЕсли;

КонецФункции
	
#КонецЕсли 

#Если Не ТонкийКлиент И Не ВебКлиент Тогда
	
Функция ЛиРасширениеУстановлено() Экспорт 
	
	Результат = РасширенияКонфигурации.Получить(Новый Структура("Имя", "ИнструментыРазработчикаTormozit")).Количество() > 0;
	Если Результат Тогда
		Результат = Прав(Метаданные.Подсистемы.ИнструментыРазработчикаTormozit.Комментарий, 1) = "a";
	КонецЕсли; 
	Возврат Результат;

КонецФункции

// Конструктор таблицы параметров алгоритма
// Результат - ТаблицаЗначений - колонки "Имя, Значение, Вход, Выход, ТипЗначения, Комментарий"
Функция НоваяТаблицаПараметровАлгоритмаЛкс() Экспорт
	
КонецФункции

// Конструктор таблицы методов контекстной подсказки
// Результат - ТаблицаЗначений - колонки "Имя, ТипЗначения"
Функция НоваяТаблицаМетодовПодсказкиЛкс() Экспорт
	
КонецФункции

// Открыть редактирование текста алгоритма с параметрами в консоли кода
// Парамерты:
//   СтруктураАлгоритма - Структура - возвращаемый
//      "ТекстАлгоритма" - Строка - текст алгоритма,
//      "ВнутренниеПараметры" - ТаблицаЗначений - таблица с конструктором НоваяТаблицаПараметровАлгоритмаЛкс с внутренними (значения определяются при редактировании) параметрами алгоритма;
//   ВнешниеПараметры* - ТаблицаЗначений - таблица с конструктором НоваяТаблицаПараметровАлгоритмаЛкс с внешними (значения определяются при каждом выполнении) параметрами алгоритма;
//   Методы* - ТаблицаЗначений - таблица с конструктором НоваяТаблицаМетодовПодсказкиЛкс с дополнительными методами доступными в алгоритме;
// Результат - Булево - принял ли изменения пользователь
Функция РедактироватьАлгоритмЧерезСтруктуруЛкс(СтруктураАлгоритма, ВнешниеПараметры = Неопределено, Методы = Неопределено) Экспорт 
КонецФункции

#КонецЕсли
