
Процедура КоманднаяПанель1КонсольЗапросов(Кнопка)
	
	ОбновитьЗапрос();
	Запрос = Новый Запрос;
	Запрос.Текст = ЭлементыФормы.ТекстСМетаданными.ПолучитьТекст();
	Для Каждого СтрокаПараметра Из Параметры Цикл
		Запрос.Параметры.Вставить(СтрокаПараметра.Имя, СтрокаПараметра.Значение);
	КонецЦикла;
	Отладить(Запрос);
	
КонецПроцедуры

Процедура КоманднаяПанель1ОбновитьЗапрос(Кнопка)
	
	ОбновитьЗапрос();
	
КонецПроцедуры

Процедура ОбновитьЗапрос()
	
	СтруктураЗапроса = ПолучитьСтруктуруЗапросаИзТекстаSDBL(ЭлементыФормы.ТекстБД.ПолучитьТекст());
	ЭлементыФормы.ТекстСМетаданными.УстановитьТекст(СтруктураЗапроса.Текст);
	ЭтаФорма.Параметры = СтруктураЗапроса.Параметры;
	ЭтаФорма.Таблицы = СтруктураЗапроса.Таблицы;

КонецПроцедуры

Процедура ПриОткрытии()
	
	ОбновитьЗапрос();
	
КонецПроцедуры

Процедура ПанельОсновнаяПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ЭлементыФормы.ПанельОсновная.Страницы[ТекущаяСтраница] = ЭлементыФормы.ПанельОсновная.Страницы.ТекстСМетаданными Тогда
		ОбновитьЗапрос();
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПараметрыВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	
	Если Колонка = Элемент.Колонки.ЗначениеSDBL Тогда
		ирНеглобальный.НайтиПоказатьСтрокуВПолеТекстовогоДокументаЛкс(ЭтаФорма, ЭлементыФормы.ТекстСМетаданными, ВыбраннаяСтрока.ЗначениеSDBL);
	Иначе
		ОткрытьЗначение(ВыбраннаяСтрока.Значение);
	КонецЕсли; 
	
КонецПроцедуры

Процедура ОбновлениеОтображения()
	
	ЛксОбновитьЗаголовкиСтраницПанелей(ЭтаФорма);
	
КонецПроцедуры

Процедура ТаблицыВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	
	ИмяСтраницы = ЭлементыФормы.ПанельОсновная.ТекущаяСтраница.Имя;
	Если ирНеглобальный.СтрокиРавныЛкс(ИмяСтраницы, "ТекстБД") Тогда
		Подстрока = ВыбраннаяСтрока.ИмяБД;
	Иначе
		Подстрока = ВыбраннаяСтрока.ИмяМета;
	КонецЕсли; 
	ирНеглобальный.НайтиПоказатьСтрокуВПолеТекстовогоДокументаЛкс(ЭтаФорма, ЭлементыФормы[ИмяСтраницы], Подстрока);
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры
