
Процедура ДействияФормыМенеджерТабличногоПоля(Кнопка)
	
	ирОбщий.ПолучитьФормуЛкс("Обработка.ирМенеджерТабличногоПоля.Форма",, ЭтаФорма, ).УстановитьСвязь(ЭтаФорма.ЭлементыФормы.СправочникСписок
	);
	
КонецПроцедуры

Процедура ДействияФормыОПодсистеме(Кнопка)
	
	ирОбщий.ПанельИнструментовОПодсистемеЛкс();
	
КонецПроцедуры

Процедура СправочникСписокПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущаяСтрока <> Неопределено Тогда
		Текст = Элемент.ТекущаяСтрока.XML;
	Иначе
		Текст = "";
	КонецЕсли; 
	ЭлементыФормы.ПолеТекстовогоДокумента.УстановитьТекст(Текст);
	
КонецПроцедуры

Процедура ДействияФормыОтладить(Кнопка)
	
	Ссылка = ЭлементыФормы.СправочникСписок.ТекущаяСтрока;
	Если Ссылка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ирОбщий.ОтладитьОтложенныйОбъектЛкс(Ссылка);
	
КонецПроцедуры

Порядок.Установить("ДатаИзменения Убыв");