#Если Клиент Тогда
//ирПортативный Перем ирПортативный Экспорт;
//ирПортативный Перем ирОбщий Экспорт;
//ирПортативный Перем ирСервер Экспорт;
//ирПортативный Перем ирКэш Экспорт;
//ирПортативный Перем ирКлиент Экспорт;
Перем мБраузер Экспорт; /// Кэш
Перем мЛиПроверочный; // Булево
Перем мОписаниеЗадания; // см. ирКлиент.ОписаниеФоновогоЗаданияФормыЛкс
Перем мЛиПотоковый;
Перем мЛиВключитьИнструменты;
Перем мНакопленныйОтвет;
Перем мНакопленныйДозапрос;
Перем мПоследнийУИДСообщения;

Перем мПлатформа;
Перем мКонтекстВызоваИнструментов;
Перем мДозапросы Экспорт; // Массив из см. НовоеОписаниеДозапроса - накопленные дозапросы, может очишаться вызывателем
Перем мПолеТекстаПрограммы Экспорт;

Функция Браузер() Экспорт
	Возврат мБраузер._1CAPI; /// Добавка нужна для поддержки 8.3.25-
КонецФункции

// Ответ нужно ловить в обработчике onclick браузера.
// Отменяет текущий активный запрос.
// Параметры:
//   Адрес - Строка -
//   ТелоЗапросаСтрока - Строка -
//   Заголовки - Соответствие -
Процедура ОтправитьЗапрос(Знач Адрес, Знач ТелоЗапросаСтрока = "", Знач Заголовки = Неопределено, Знач ЛиПотоковый = Ложь, Знач ЛиПроверочный = Ложь, знач МинИнтервалОтветов = 500, Знач ЛиДозапрос = Ложь,
		Знач МетодОтправки = "POST", Знач Форма = Неопределено ) Экспорт
	мЛиПроверочный = ЛиПроверочный;
	ЗаголовкиМассив = Новый Массив;
	Если Заголовки <> Неопределено Тогда
		Для Каждого ЗаголовкиЭлемент Из Заголовки Цикл
			ЗаголовкиМассив.Добавить(Новый Структура("name,value", ЗаголовкиЭлемент.Ключ, ЗаголовкиЭлемент.Значение));
		КонецЦикла;
	КонецЕсли;
	Если Не ЛиДозапрос Тогда
		мНакопленныйОтвет = "";
	ИначеЕсли ЗначениеЗаполнено(мНакопленныйОтвет) Тогда
		мНакопленныйОтвет = мНакопленныйОтвет + Символы.ПС;
	КонецЕсли;
	мНакопленныйДозапрос = Неопределено;
	мЛиПотоковый = ЛиПотоковый;
	Если мБраузер = Неопределено Тогда
		Если мЛиПотоковый Тогда
			ВызватьИсключение "Требуется платформа 8.3.14+";
		КонецЕсли;
		СтруктураАдреса = ирОбщий.СтруктураURIЛкс(Адрес);
		Соединение = ирОбщий.СоединениеHTTPЛкс(СтруктураАдреса.ИмяСервера, СтруктураАдреса.Порт,,,, 5, СтруктураАдреса.ИспользоватьHTTPS);
		#Если Сервер И Не Сервер Тогда
		    Соединение = Новый HTTPСоединение;
		#КонецЕсли
		Запрос = Новый ("HTTPЗапрос");
		Запрос.АдресРесурса = СтруктураАдреса.ПутьНаСервере;
		Попытка
			ОтветHttp = Соединение.Получить(Запрос);
		Исключение
			ОтветHttp = Неопределено;
			мНакопленныйОтвет = "Ошибка: " + ОписаниеОшибки(); //
		КонецПопытки; 
		Если ОтветHttp <> Неопределено Тогда
			Если ирОбщий.ЛиУспешныйОтветHTTPЛкс(ОтветHttp) Тогда
				мНакопленныйОтвет = ОтветHttp.ПолучитьТелоКакСтроку();
			Иначе
				мНакопленныйОтвет = "Ошибка: " + ОтветHttp.КодСостояния;
			КонецЕсли; 
		КонецЕсли;
		Если ЗначениеЗаполнено(мНакопленныйОтвет) Тогда 
			ирОбщий.СообщитьЛкс(мНакопленныйОтвет);
		КонецЕсли;
		Форма.СлужебноеПолеХТМЛonclick(Неопределено, Неопределено);
		Возврат;
	КонецЕсли;
	ЗаголовкиТекст = ирОбщий.ОбъектВТекстЖСОНЛкс(ЗаголовкиМассив);
	Если мЛиПотоковый Тогда
		Браузер().sendStreamRequest(Адрес, ТелоЗапросаСтрока, ЗаголовкиТекст, МинИнтервалОтветов);
	Иначе
		Браузер().sendHttpRequest(Адрес, ТелоЗапросаСтрока, ЗаголовкиТекст, МетодОтправки);
	КонецЕсли;
КонецПроцедуры

Функция ЛиПотокЗавершен() Экспорт
	Возврат Браузер().isStreamCompleted();
КонецФункции

// Не поддерживает поток
Функция ЛиЗапросВыполняется() Экспорт
	Возврат Браузер().isActiveHttpRequest();
КонецФункции

Функция СтатусЗапроса() Экспорт
	Возврат Браузер().getRequestStatus();
КонецФункции

// Читает и удаляет полученную часть ответа
Функция ПрочитатьЧастьОтвета() Экспорт
	Если мБраузер = Неопределено Тогда
		Возврат мНакопленныйОтвет;
	Иначе
		Возврат Браузер().getAndClearAllData();
	КонецЕсли;
КонецФункции

Процедура ОтменитьЗапрос() Экспорт
	Если мБраузер = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Браузер().cancelCurrentRequest();
КонецПроцедуры

// ИИ

// Отправляет запрос к ИИ через OpenAPI. Ответ приходит событием onclick
// Параметры:
//   ПараметрыЗапроса - Структура, Массив - Содержимое сообщения, Массив для дозапросов
//    *Текст - Строка - текст запроса
//   Форма - Форма - 
//   ОбработчикОтвета -  - 
//   БлокируемыеЭлементы -  - 
//   Кнопка - Кнопка - 
//   ЛиПотоковый -  - 
//   ЛиПроверочный - Булево - 
//   РежимНапарника - Строка - docstring, explain, review, modify, custom, system, raw
//   КлючСервиса - Строка - Ключ API для аутентификации
//   Сервер - Строка - URL-адрес API
//   Модель - Строка - Имя модели
//   ПараметрыМоделиИИ -  - 
//   ВключитьИнструменты -  - 
//   ПредСообщение -  - 
//   ПолеТекстаПрограммы - ОбработкаОбъект.ирКлсПолеТекстаПрограммы - пока не используем
// Возвращаемое значение:
//   Булево - успешность запуска
Функция ОтправитьЗапросИИ(Знач ПараметрыЗапроса, Знач Форма = Неопределено, Знач ОбработчикОтвета = "", Знач БлокируемыеЭлементы = Неопределено, Знач Кнопка = Неопределено,
		Знач ЛиПотоковый = Ложь, Знач ЛиПроверочный = Ложь, Знач РежимНапарника = "custom", Знач КлючСервиса = Неопределено, Знач Сервер = Неопределено, Знач Модель = Неопределено,
		Знач ПараметрыМоделиИИ = Неопределено, Знач ВключитьИнструменты = Ложь, Знач ПредСообщение = Неопределено, Знач ПолеТекстаПрограммы = Неопределено, Знач ИмяФайла = "", Знач ТекстДляПатчей = "") Экспорт
	Если мБраузер = Неопределено Тогда
		ирОбщий.СообщитьЛкс("Для отправки запроса к ИИ требуется платформа 8.3.14+");
		Возврат Ложь;
	КонецЕсли;
	Сервер = мПлатформа.СерверИИ(, Сервер); 
	Модель = мПлатформа.МодельИИ(, Модель, Сервер);
	Если Ложь
		Или КлючСервиса = Неопределено
		Или КлючСервиса = "" И мПлатформа.ЛиНапарникВРолиОбщегоИИ(Сервер)
	Тогда
		КлючСервиса = мПлатформа.КлючСервисаИИ(Сервер);
	КонецЕсли;
	Если ПустаяСтрока(КлючСервиса) Тогда
		Если Не ЛиПроверочный Тогда
			#Если Клиент Тогда
				Форма = ирКлиент.ОткрытьНастройкиПоляПрограммыЛкс("", Истина, "КлючСервисаИИ");
			#КонецЕсли
		КонецЕсли;
		ВызватьИсключение "Не указан ключ сервиса ИИ";
	КонецЕсли;
	Если мПолеТекстаПрограммы = Неопределено Тогда
		мПолеТекстаПрограммы = ирОбщий.СоздатьОбъектПоИмениМетаданныхЛкс("Обработка.ирКлсПолеТекстаПрограммы");
		мПолеТекстаПрограммы.ИнициироватьНеинтерактивно();
		мПолеТекстаПрограммы.УстановитьТекст("",,,,, мПлатформа.ИмяДинамическогоМодуля());
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекстДляПатчей) Тогда
		мПолеТекстаПрограммы.УстановитьТекст(ТекстДляПатчей);
	КонецЕсли;
	Если ПолеТекстаПрограммы <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(мПолеТекстаПрограммы.мМодульМетаданных.ФлагиКомпиляции, ПолеТекстаПрограммы.мФлагиКомпиляции);
	КонецЕсли;
	ЛиДозапрос = ПредСообщение <> Неопределено;
	Если мОписаниеЗадания <> Неопределено Тогда
		ОтменитьЗапрос(); // Текущий отменяем. Один запрос одновременно.
		Если Не ЛиДозапрос Тогда
			ирКлиент.ОтменитьЗаданиеФормыЛкс(Форма, мОписаниеЗадания);
			мОписаниеЗадания = Неопределено;
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	Если ЛиДозапрос Тогда
		Роль = "tool";
	Иначе
		мДозапросы = Новый Массив;
		Роль = "user";
		мОписаниеЗадания = ирКлиент.ОписаниеФоновогоЗаданияФормыЛкс("ЗапросИИ",, ПараметрыЗапроса,, Кнопка, ОбработчикОтвета,,, БлокируемыеЭлементы,,,,, Ложь);
		ирКлиент.ЗапуститьИлиОтменитьФоновоеЗаданиеФормыЛкс(Форма, мОписаниеЗадания);
	КонецЕсли;
	мЛиВключитьИнструменты = ВключитьИнструменты;
	мПоследнийУИДСообщения = "";
	Если Сервер = "https://code.1c.ai" Тогда
		// Для анализа трафика EDT Импорт сертификата Fiddler: 
		// keytool.exe -import -alias fiddler -file "%USERPROFILE%\Desktop\FiddlerRoot.cer" -keystore "C:\Program Files\1C\1CE\components\<jdk>\lib\security\cacerts" -storepass changeit -noprompt
		ПолеТекстаПрограммы = ирКэш.ПолеТекстаПрограммы();
		Соединение = ПолеТекстаПрограммы.СоединениеНапарника();
		Если ТипЗнч(Соединение) = Тип("Строка") Тогда
			ирОбщий.СообщитьЛкс(ирОбщий.СтрШаблонЛкс("Ошибка соединения с Напарником: %1", Соединение));
			ирКлиент.ОтменитьЗаданиеФормыЛкс(Форма, мОписаниеЗадания);
			мОписаниеЗадания = Неопределено;
			Возврат Ложь;
		КонецЕсли;
		АдресРесурсаНапарника = "/chat_api/v1/conversations/";
		Заголовки = ПолеТекстаПрограммы.ЗаголовкиЗапросаНапарника(КлючСервиса);
		Если ЛиДозапрос Тогда
			Содержание = ПараметрыЗапроса;
		Иначе
			ПараметрыЧатаНапарника = Новый Структура;
			ПараметрыЧатаНапарника.Вставить("instruction", ПараметрыЗапроса.Текст);
			ПараметрыЧатаНапарника.Вставить("tools");
			Если мЛиВключитьИнструменты Тогда
				// Похоже он использует только фиксированные имена инструментов, т.к. не замечено вызовов моих имен 
				ПараметрыЧатаНапарника.Вставить("tools", СписокИнструментов());
			КонецЕсли;
			Запрос = ирОбщий.ЗапросHTTPЛкс(АдресРесурсаНапарника);
			Запрос.Заголовки = Заголовки;
			СтруктураЗапроса = Новый Структура;
			СтруктураЗапроса.Вставить("tool_name", РежимНапарника);
			СтруктураЗапроса.Вставить("skill_name", РежимНапарника);
			СтруктураЗапроса.Вставить("is_chat", Истина);
			СтруктураЗапроса.Вставить("programming_language", "1с");
			СтруктураЗапроса.Вставить("ui_language", "russian");
			СтруктураЗапроса.Вставить("script_language", ПолеТекстаПрограммы.ИмяЯзыкаЧеловека());
			Запрос.УстановитьТелоИзСтроки(ирОбщий.ОбъектВТекстЖСОНЛкс(СтруктураЗапроса));
			Ответ = Соединение.ОтправитьДляОбработки(Запрос);
			Если Не ирОбщий.ЛиУспешныйОтветHTTPЛкс(Ответ) Тогда
				ирОбщий.СообщитьЛкс(ирОбщий.СтрШаблонЛкс("Ошибка %1: %2", Ответ.КодСостояния, Ответ.ПолучитьТелоКакСтроку()));
				ирКлиент.ОтменитьЗаданиеФормыЛкс(Форма, мОписаниеЗадания);
				мОписаниеЗадания = Неопределено;
				Возврат Ложь;
			КонецЕсли;
			СтруктураОтвета = ирОбщий.ОбъектИзТекстаЖСОНЛкс(Ответ.ПолучитьТелоКакСтроку()); // см. ПрочитатьJSON(ОбразецОтветаСозданияЧатаНапарника())
			Адрес = Сервер + АдресРесурсаНапарника + СтруктураОтвета.uuid + "/messages";
			Содержание = Новый Структура("content", ПараметрыЧатаНапарника);
		КонецЕсли;
		СтруктураСообщения = Новый Структура;
		СтруктураСообщения.Вставить("role", Роль);
		СтруктураСообщения.Вставить("parent_uuid", ПредСообщение);
		СтруктураСообщения.Вставить("content", Содержание); 
		СтруктураЗапроса = СтруктураСообщения;
	Иначе
		Заголовки = Новый Соответствие;
		Заголовки.Вставить("Content-Type", "application/json");
		БазовыйАдрес = Сервер;
		Если Сервер = "https://chat.qwen.ai/api" Тогда
			Если ПустаяСтрока(Модель) Тогда
				Модель = "qwen3-coder-plus";
			КонецЕсли;
			ТокенКвен = ПолучитьТокенКвен();
			Если ТокенКвен = Неопределено Тогда
				АвторизоватьсяВКвен();
				ТокенКвен = ПолучитьТокенКвен();
				Если ТокенКвен = Неопределено Тогда
					ВызватьИсключение "Не удалось получить токен Qwen";
				КонецЕсли;
			КонецЕсли;
			Если ЗначениеЗаполнено(ирОбщий.СвойствоСтруктурыЛкс(ТокенКвен, "resource_url")) Тогда
				БазовыйАдрес = ТокенКвен.resource_url;
			КонецЕсли;
			КлючСервиса = ТокенКвен.access_token;
			Заголовки.Вставить("X-DashScope-AuthType", "qwen-oauth");
		КонецЕсли;
		Если ЗначениеЗаполнено(КлючСервиса) Тогда
			Заголовки.Вставить("Authorization", "Bearer " + КлючСервиса);
		КонецЕсли;
		СтруктураЗапроса = Новый Структура;
		СтруктураЗапроса.Вставить("model", Модель);
		Если ЛиДозапрос Тогда
			СтруктураЗапроса.Вставить("messages", ПараметрыЗапроса);
			СтруктураЗапроса.messages.Вставить(0, ПредСообщение);
		Иначе
			СтруктураЗапроса.Вставить("messages", Новый Массив);
			Если мЛиВключитьИнструменты Тогда
				СтруктураЗапроса.Вставить("tools", СписокИнструментов());
				СтруктураЗапроса.Вставить("tool_choice", "auto");
			КонецЕсли;
			СтруктураСообщения = Новый Структура;
			СтруктураСообщения.Вставить("role", Роль);
			СтруктураСообщения.Вставить("content", ПараметрыЗапроса.Текст);
			СтруктураЗапроса.messages.Добавить(СтруктураСообщения);
		КонецЕсли;
		СтруктураЗапроса.Вставить("stream", ЛиПотоковый);
		Если ПараметрыМоделиИИ = Неопределено Тогда
			ПараметрыМоделиИИ = мПлатформа.ПараметрыМоделиИИ();
		КонецЕсли;
		Для Каждого ЭлементСписка Из ПараметрыМоделиИИ Цикл
			Если Не ЭлементСписка.Пометка Тогда
				Продолжить;
			КонецЕсли;
			Если Не ирОбщий.ЛиИмяПеременнойЛкс(ЭлементСписка.Представление) Тогда
				ирКлиент.ОткрытьНастройкиПоляПрограммыЛкс("", Истина, "ПараметрыМоделиИИ");
				ВызватьИсключение ирОбщий.СтрШаблонЛкс("Неверное имя параметра модели ИИ: %1", ЭлементСписка.Представление);
			КонецЕсли;
			ЗначениеПараметра = ЭлементСписка.Значение;
			Если ЭлементСписка.Представление = "reasoning" Тогда
				ЗначениеПараметра = Новый Структура("enable", ЗначениеПараметра);
			КонецЕсли;
			СтруктураЗапроса.Вставить(ЭлементСписка.Представление, ЗначениеПараметра);
		КонецЦикла;
		Адрес = БазовыйАдрес;
		Если ирОбщий.НайтиРегВыражениеЛкс(Адрес, "/v\d+").Количество() = 0 Тогда
			Адрес = Адрес + "/v1";
		КонецЕсли;
		Адрес = Адрес + "/chat/completions";
	КонецЕсли;
	Если Не ирОбщий.СтрНачинаетсяСЛкс(Адрес, "http") Тогда
		Адрес = "https://" + Адрес;
	КонецЕсли;
	Если ЛиДозапрос Тогда
		Адрес = мКонтекстВызоваИнструментов.Адрес;
	Иначе
		мКонтекстВызоваИнструментов = НовыйКонтекстВызоваИнструментов(Адрес);
	КонецЕсли;
	ОтправитьЗапрос(Адрес, ирОбщий.ОбъектВТекстЖСОНЛкс(СтруктураЗапроса), Заголовки, ЛиПотоковый, ЛиПроверочный,, ЛиДозапрос);
	Возврат Истина;
КонецФункции

Функция НовыйКонтекстВызоваИнструментов(Знач Адрес) Экспорт
	КонтекстВызоваИнструментов = Новый Структура;
	КонтекстВызоваИнструментов.Вставить("Итерация", 0);
	КонтекстВызоваИнструментов.Вставить("Адрес", Адрес);
	Возврат КонтекстВызоваИнструментов;
КонецФункции

Функция ОбразецОтветаСозданияЧатаНапарника() Экспорт
	Возврат "{""uuid"":""028c6d0f-864f-4b2d-846b-6c8b161c4171""}";
КонецФункции

Функция ОбразецЧатЗапросНапарника() Экспорт
	Возврат "{
		|  ""parent_uuid"": null,
		|  ""tool_content"": {
		|    ""instruction"": ""напиши код расчета суммы по документу Документ1"",
		|    ""code"": [
		|      {
		|        ""content"": ""\r\n\r\nФункция СуммаМоя(Скидка) Экспорт\r\n\t\r\nКонецФункци"",
		|        ""path"": ""Тест_83_серверная/src/Documents/Документ1/ObjectModule.bsl"",
		|        ""path_formatted"": ""Документы→Документ1→Модуль объекта"",
		|        ""start_line"": 4,
		|        ""end_line"": 8
		|      }
		|    ]
		|  }
		|}"
КонецФункции
	
Функция ОбразецЧатОтветНапарника() Экспорт
	Возврат 
		"data: {""uuid"":""c197b124-e46e-4692-84b4-c4cd574c2f45:c6b3de57"",""role"":""user"",""create_time"":""2025-10-11T08:08:32.452288"",""finished"":false}
		|
		|data: {""uuid"":""c197b124-e46e-4692-84b4-c4cd574c2f45:c6b3de57"",""role"":""user"",""create_time"":""2025-10-11T08:08:32.452288"",""finished"":true}
		|
		|data: {""uuid"":""c197b124-e46e-4692-84b4-c4cd574c2f45:8ad69bf4"",""role"":""assistant"",""content"":{""text"":""""},""parent_uuid"":""c197b124-e46e-4692-84b4-c4cd574c2f45:c6b3de57"",""create_time"":""2025-10-11T08:08:32.477925"",""finished"":false}
		|
		|data: {""uuid"":""c197b124-e46e-4692-84b4-c4cd574c2f45:8ad69bf4"",""role"":""assistant"",""content"":{""text"":"" Для расчета суммы по документу \""Документ1\"" нам необходимо знать структуру этого документа. Предпо""},""parent_uuid"":""c197b124-e46e-4692-84b4-c4cd574c2f45:c6b3de57"",""create_time"":""2025-10-11T08:08:32.477925"",""finished"":false}
		|
		|data: {""uuid"":""c197b124-e46e-4692-84b4-c4cd574c2f45:8ad69bf4"",""role"":""assistant"",""content"":{""text"":"" Для расчета суммы по документу \""Документ1\"" нам необходимо знать структуру этого документа. Предположим, что документ имеет табличную часть \""Товары\"" с колонками \""Количество\"" и \""Цена\"".""},""parent_uuid"":""c197b124-e46e-4692-84b4-c4cd574c2f45:c6b3de57"",""create_time"":""2025-10-11T08:08:32.477925"",""finished"":false}
		|
		|data: {""uuid"":""c197b124-e46e-4692-84b4-c4cd574c2f45:8ad69bf4"",""role"":""assistant"",""content"":{""text"":"" Для расчета суммы по документу \""Документ1\"" нам необходимо знать структуру этого документа. Предположим, что документ имеет табличную часть \""Товары\"" с колонками \""Количество\"" и \""Цена\"". Тогда функция расчета суммы с учетом скидки может выглядеть следующим образом:\n\n```1с\nФункция Су""},""parent_uuid"":""c197b124-e46e-4692-84b4-c4cd574c2f45:c6b3de57"",""create_time"":""2025-10-11T08:08:32.477925"",""finished"":false}
		|
		|"
КонецФункции
	
Функция ОбработатьОтвет(Форма) Экспорт
	Если Ложь
		Или мОписаниеЗадания = Неопределено
		Или мОписаниеЗадания.Состояние = СостояниеФоновогоЗадания.Отменено
	Тогда
		мОписаниеЗадания = Неопределено;
		Возврат "";
	КонецЕсли; 
	ТелоОтвета = СокрЛ(ПрочитатьЧастьОтвета());
	ЛиПотокЗавершен = Не мЛиПотоковый Или ЛиПотокЗавершен();
	ПрефиксЧастиОтвета = "data: ";
	Если Ложь
		Или ирОбщий.СтрНачинаетсяСЛкс(ТелоОтвета, "Ошибка:") // парсер
		Или ирОбщий.СтрНачинаетсяСЛкс(ТелоОтвета, "data: {""error""") // openAI
	Тогда
		мОписаниеЗадания.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно;
		ЛиПотокЗавершен = Истина;
	Иначе
		Если ирОбщий.СтрНачинаетсяСЛкс(ТелоОтвета, "Отмена:") Тогда
			// Только для потокового режима
		ИначеЕсли ирОбщий.СтрНачинаетсяСЛкс(ТелоОтвета, "Конец:") Тогда
			// Только для потокового режима
			ТелоОтвета = "";
		ИначеЕсли Ложь
			Или ирОбщий.СтрНачинаетсяСЛкс(ТелоОтвета, ПрефиксЧастиОтвета)
			Или Найти(ТелоОтвета, Символы.ПС + ПрефиксЧастиОтвета)
		Тогда
			ТекстовыйДокумент = Новый ТекстовыйДокумент;
			ТекстовыйДокумент.УстановитьТекст(ТелоОтвета);
			Результат = Новый Массив;
			Для НомерСтроки = 1 По ТекстовыйДокумент.КоличествоСтрок() Цикл
				СтрокаТекста = ТекстовыйДокумент.ПолучитьСтроку(НомерСтроки);
				Если ирОбщий.СтрНачинаетсяСЛкс(СтрокаТекста, ПрефиксЧастиОтвета) Тогда
					ТекстБезПервогоФрагмента = ирОбщий.ТекстБезПервогоФрагментаЛкс(СтрокаТекста, ПрефиксЧастиОтвета);
					Если ТекстБезПервогоФрагмента = "[DONE]" Тогда
						// openAI
						//ЛиПотокЗавершен = Истина;
						Прервать;
					КонецЕсли;
					ЭлементСообщения = ирОбщий.ОбъектИзТекстаЖСОНЛкс(ТекстБезПервогоФрагмента);
					УИДСообщения = УИДСообщения(ЭлементСообщения);
					Если ирОбщий.СвойствоСтруктурыЛкс(ЭлементСообщения, "content_delta") <> Неопределено Тогда
						// Напарник потоковый
						ВложеннаяЧасть = ЭлементСообщения.content_delta;
						Если ВложеннаяЧасть.Свойство("content") Тогда
							//ЧастьРазмышлений = ВложеннаяЧасть.reasoning;
							Результат.Добавить(ВложеннаяЧасть.content);
						КонецЕсли;
						Если ирОбщий.СвойствоСтруктурыЛкс(ВложеннаяЧасть, "tool_calls") <> Неопределено Тогда
							ПрочитатьЧастьДопзапросов(ВложеннаяЧасть);
						КонецЕсли;
						Если ирОбщий.СвойствоСтруктурыЛкс(ЭлементСообщения, "finished") = Истина Тогда
							Если мНакопленныйДозапрос <> Неопределено Тогда
								// вызов инструментов — если ИИ вернул вызов инструмента, выполняем и продолжаем диалог
								Если ОбработатьВызовыИнструментов(мНакопленныйДозапрос, УИДСообщения) Тогда
									ЛиПотокЗавершен = Ложь;
									Результат.Очистить();
								КонецЕсли;
								мНакопленныйДозапрос = Неопределено;
							КонецЕсли;
						КонецЕсли;
					ИначеЕсли ирОбщий.СвойствоСтруктурыЛкс(ЭлементСообщения, "content") <> Неопределено Тогда
						Если ирОбщий.СвойствоСтруктурыЛкс(ЭлементСообщения, "finished") = Истина Тогда
							//ЛиПотокЗавершен = Истина;
						КонецЕсли;
					ИначеЕсли Истина
						И ЭлементСообщения.Свойство("choices") 
						И ЭлементСообщения.choices.Количество() > 0
					Тогда
						// openAI
						ВложеннаяЧасть = ЭлементСообщения.choices[0].delta;
						Если ВложеннаяЧасть.Свойство("content") Тогда
							//ЧастьРазмышлений = ВложеннаяЧасть.reasoning;
							Результат.Добавить(ВложеннаяЧасть.content);
						КонецЕсли;
						Если ВложеннаяЧасть.Свойство("tool_calls") Тогда
							ПрочитатьЧастьДопзапросов(ВложеннаяЧасть);
						КонецЕсли;
						Если Истина
							И мНакопленныйДозапрос <> Неопределено
							И ирОбщий.СвойствоСтруктурыЛкс(ЭлементСообщения.choices[0], "finish_reason") = "tool_calls" 
						Тогда
							// вызов инструментов — если ИИ вернул вызов инструмента, выполняем и продолжаем диалог
							Если ОбработатьВызовыИнструментов(мНакопленныйДозапрос, УИДСообщения) Тогда
								ЛиПотокЗавершен = Ложь;
								Результат.Очистить();
							КонецЕсли;
							мНакопленныйДозапрос = Неопределено;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			ТелоОтвета = ирОбщий.СтрСоединитьЛкс(Результат, "");
			мНакопленныйОтвет = мНакопленныйОтвет + ТелоОтвета;
		Иначе
			Если ирОбщий.ЛиТекстJSONЛкс(ТелоОтвета) Тогда
				ОтветЖСОН = ирОбщий.ОбъектИзТекстаЖСОНЛкс(ТелоОтвета);
				Если Истина
					И ОтветЖСОН.Свойство("choices")
					И ОтветЖСОН.choices.Количество() > 0
				Тогда
					// openAI
					// вызов инструментов — если ИИ вернул вызов инструмента, выполняем и продолжаем диалог
					Если ОтветЖСОН.choices[0].message.Свойство("tool_calls") Тогда
						Если ОбработатьВызовыИнструментов(ОтветЖСОН.choices[0].message) Тогда
							ЛиПотокЗавершен = Ложь;
						КонецЕсли;
					КонецЕсли;
					мНакопленныйОтвет = ОтветЖСОН.choices[0].message.content; // Строка
				Иначе
					мНакопленныйОтвет = "";
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если ЛиПотокЗавершен Тогда
			мОписаниеЗадания.Состояние = СостояниеФоновогоЗадания.Завершено;
		КонецЕсли;
	КонецЕсли; 
	мОписаниеЗадания.Параметры.Вставить("Ответ", мНакопленныйОтвет);
	Если ЛиПотокЗавершен Тогда
		Если мОписаниеЗадания.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
			Если мЛиПроверочный Тогда
				ирОбщий.СообщитьЛкс(ТелоОтвета,,,, Ложь);
			Иначе
				мОписаниеЗадания.Параметры.Ответ = мОписаниеЗадания.Параметры.Ответ + Символы.ПС + ТелоОтвета;
			КонецЕсли;
		КонецЕсли;
		ирКлиент.ОбработатьЗавершениеЗаданияФормыЛкс(мОписаниеЗадания, Форма,,,, мОписаниеЗадания.Параметры);
		Длительность = ТекущаяДата() - мОписаниеЗадания.НачалоВыполнения;
		Если Истина
			И Не мЛиПотоковый
			И (Ложь
				Или мЛиПроверочный И мОписаниеЗадания.Состояние = СостояниеФоновогоЗадания.Завершено
				Или мЛиПроверочный И Длительность > 1
				Или Длительность > 5)
		Тогда
			ирОбщий.СообщитьЛкс("ИИ ответил за " + Длительность + " секунд",,, Истина, Ложь);
		КонецЕсли;
		мОписаниеЗадания = Неопределено;
	ИначеЕсли мЛиПотоковый Тогда
		Если мОписаниеЗадания.ОбработчикЗавершения <> "" Тогда
			Состояние = мОписаниеЗадания.Состояние;
			Параметры = мОписаниеЗадания.Параметры;
			Выполнить("Форма." + мОписаниеЗадания.ОбработчикЗавершения + "(Состояние, Параметры)");
		КонецЕсли;
	КонецЕсли;
	Возврат мНакопленныйОтвет;
КонецФункции

//.
// Параметры:
//   ЭлементСообщения - Массив, Соответствие, Структура - 
// Возвращаемое значение:
//   Произвольный, Неопределено - 
Функция УИДСообщения(Знач ЭлементСообщения) Экспорт
	УИДСообщения = ирОбщий.СвойствоСтруктурыЛкс(ЭлементСообщения, "uuid");
	Если ПустаяСтрока(УИДСообщения) Тогда
		УИДСообщения = ирОбщий.СвойствоСтруктурыЛкс(ЭлементСообщения, "id");
	КонецЕсли;
	Возврат УИДСообщения;
КонецФункции

Процедура ПрочитатьЧастьДопзапросов(Знач ЧастьСообщения) Экспорт
	Если мНакопленныйДозапрос = Неопределено Тогда
		мНакопленныйДозапрос = ЧастьСообщения;
	Иначе
		Для Каждого ЧастьДозапроса Из ЧастьСообщения.tool_calls Цикл
			Если мНакопленныйДозапрос.tool_calls.ВГраница() < ЧастьДозапроса.index Тогда
				мНакопленныйДозапрос.tool_calls.Добавить(ЧастьДозапроса);
			КонецЕсли;
			мНакопленныйДозапрос.tool_calls[ЧастьДозапроса.index].function.arguments = мНакопленныйДозапрос.tool_calls[ЧастьДозапроса.index].function.arguments + ЧастьДозапроса.function.arguments;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

//.
// Параметры:
//   СообщениеИИ -  - 
//   ИсходноеСообщение - Строка, Массив - 
// Возвращаемое значение:
//    - 
Функция ОбработатьВызовыИнструментов(Знач СообщениеИИ, Знач УИДСообщения = "") Экспорт
	МаксВызовов = 20;
	Если мКонтекстВызоваИнструментов.Итерация > МаксВызовов Тогда
		ирОбщий.СообщитьЛкс("Превышен лимит ("+МаксВызовов+") итераций вызова инструментов");
		Возврат Ложь;
	КонецЕсли;
	ОтветыИнструментов = Новый Массив;
	ЛиНапарник = Не СообщениеИИ.Свойство("role");
	Если ЛиНапарник Тогда
		ПредСообщение = УИДСообщения;
	Иначе
		ПредСообщение = СообщениеИИ;
		ПредСообщение.role = "assistant";
	КонецЕсли;
	Для Каждого ВызовИнструмента Из СообщениеИИ.tool_calls Цикл // Структура
		МоментНачала = ТекущаяДата();
		ИмяИнструмента = ВызовИнструмента.function.name;
		Аргументы = ВызовИнструмента.function.arguments;
		ПредставлениеРезультата = "";
		Если Не мЛиВключитьИнструменты Тогда
			ТекстРезультата = "";
		Иначе
			Попытка
				РезультатИнструмента = ВызватьИнструмент(ИмяИнструмента, Аргументы, ПредставлениеРезультата);
				Если РезультатИнструмента = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				Если ТипЗнч(РезультатИнструмента) = Тип("Строка") Тогда
					ТекстРезультата = РезультатИнструмента;
				Иначе
					ТекстРезультата = ирОбщий.ОбъектВТекстЖСОНЛкс(РезультатИнструмента);
				КонецЕсли;
			Исключение
				ТекстРезультата = ирОбщий.СтрШаблонЛкс("Ошибка выполнения %1: %2", ИмяИнструмента, ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;
		ОтветИнструмента = Неопределено;
		Если ТипЗнч(СообщениеИИ) = Тип("Структура") Тогда
			ЛиОбработанКлиентом = ЗначениеЗаполнено(ТекстРезультата) Или ЗначениеЗаполнено(ПредставлениеРезультата);
			ОтветИнструмента = Новый Структура;
			ОтветИнструмента.Вставить("role", "tool");
			ОтветИнструмента.Вставить("content", ТекстРезультата);
			ОтветИнструмента.Вставить("name", ИмяИнструмента);
			ОтветИнструмента.Вставить("tool_call_id", ирОбщий.СвойствоСтруктурыЛкс(ВызовИнструмента, "id", ""));
			Если ЛиНапарник Тогда
				Если ЗначениеЗаполнено(ТекстРезультата) Тогда
					ОтветИнструмента.Вставить("status", "rejected"); // Для серверного инструмента Напарника указываем что мы выполнили на клиенте
				Иначе
					ОтветИнструмента.content = Неопределено;
					ОтветИнструмента.Вставить("status", "accepted"); // Для серверного инструмента Напарника указываем что мы НЕ выполнили на клиенте
				КонецЕсли;
			Иначе
				Если ПустаяСтрока(ОтветИнструмента.content) Тогда
					ОтветИнструмента.content = ПредставлениеРезультата; // Иначе может переключиться на другой человечий язык
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли ТипЗнч(СообщениеИИ) = Тип("Массив") И ЗначениеЗаполнено(ТекстРезультата) Тогда
			ОтветИнструмента = Новый Структура;
			ОтветИнструмента.Вставить("Текст", "Я проверил твой ответ инструментом " + ИмяИнструмента + " с результатом: 
			|" + ТекстРезультата);
			ЛиОбработанКлиентом = Истина;
		КонецЕсли;
		Длительность = ТекущаяДата() - МоментНачала;
		ОписаниеДозапроса = НовоеОписаниеДозапроса(Аргументы, ИмяИнструмента, ТекстРезультата, ЛиОбработанКлиентом, ПредставлениеРезультата, Длительность);
		мДозапросы.Добавить(ОписаниеДозапроса);
		Если ОтветИнструмента <> Неопределено Тогда
			ОтветыИнструментов.Добавить(ОтветИнструмента);
		КонецЕсли;
	КонецЦикла;
	Если ОтветыИнструментов.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	//мНакопленныйОтвет = "";
	ОтправитьЗапросИИ(ОтветыИнструментов,,,,, мЛиПотоковый,,,,,,, мЛиВключитьИнструменты, ПредСообщение);
	мКонтекстВызоваИнструментов.Итерация = мКонтекстВызоваИнструментов.Итерация + 1;
	Возврат Истина;
КонецФункции 

Функция ПроверитьБлокКода(Знач ПроверяемыйКод) Экспорт
	Возврат Ложь; // Пока не придумал хорошего способа перезапускать запрос с сохранением контекста
	СтруктураСообщения = Новый Структура;
	ВызовыИнструментов = Новый Массив;
	СтруктураСообщения.Вставить("tool_calls", ВызовыИнструментов);
	Агрументы = Новый Структура("code", ПроверяемыйКод);
	Агрументы = ирОбщий.ОбъектВТекстЖСОНЛкс(Агрументы); // для наглядности отображения в таблице
	ВызовИнструмента = Новый Структура("function", Новый Структура("name, arguments", "mcp__syntax-checker__validate", Агрументы));
	ВызовыИнструментов.Добавить(ВызовИнструмента);
	Возврат ОбработатьВызовыИнструментов(СтруктураСообщения);
КонецФункции

Функция НовоеОписаниеДозапроса(Знач Аргументы, Знач ИмяИнструмента, Знач ТекстРезультата, Знач ЛиОбработанКлиентом, Знач ПредставлениеРезультата, Знач Длительность) Экспорт
	Результат = Новый Структура();
	Результат.Вставить("Функция", ИмяИнструмента);
	Результат.Вставить("Аргументы", Аргументы);
	Результат.Вставить("Результат", ТекстРезультата);
	Результат.Вставить("ОтправленоСимволов", СтрДлина(ТекстРезультата));
	Результат.Вставить("ЛиОбработанКлиентом", ЛиОбработанКлиентом);
	Результат.Вставить("ПредставлениеРезультата", ПредставлениеРезультата);
	Результат.Вставить("Длительность", Длительность);
	Возврат Результат;
КонецФункции

Функция СписокИнструментов() Экспорт
	Инструменты = Новый Массив;
	Инструменты.Добавить(НовоеОписаниеИнструмента(
				"check_patches",
				"Проверяет маркеры (границы) патчей. Вернет не найденые и не уникальные маркеры.",
				Новый Структура("type,properties,required",
					"object",
					Новый Структура("text",
						Новый Структура("type,description", "string", "текст JSON массива патчей (свойства элементов: start,end)")
						),
					Новый Массив
					)
				));
	Инструменты.Добавить(НовоеОписаниеИнструмента(
				"platform_list_objects",
				"Список объектов (типов) платформы по имени",
				));
	Инструменты.Добавить(НовоеОписаниеИнструмента(
				"platform_object",
				"Описание объекта (типа) платформы: методы, свойства, события",
				Новый Структура("type,properties,required",
					"object",
					Новый Структура("name",
						Новый Структура("type,description", "string", "имя объекта (типа) платформы (например 'Глобальный' или 'ТаблицаЗначений')")
						),
					Новый Массив
					)
				));
	Инструменты.Добавить(НовоеОписаниеИнструмента(
				"platform_object_member",
				"Описание метода/свойства объекта (типа) платформы по имени.",
				Новый Структура("type,properties,required",
					"object",
					Новый Структура("full_name, isMethod",
						Новый Структура("type,description", "string", "имя метода/свойства (например, 'СтрЗаменить' или 'ТаблицаЗначений.Колонки')"),
						Новый Структура("type,description", "boolean", "Является методом")
						),
					Новый Массив
					)
				));
	Инструменты.Добавить(НовоеОписаниеИнструмента(
				"metadata_list_objects",
				"Список объектов метаданных с фильтром по имени коллекции.",
				Новый Структура("type,properties", 
					"object",
					Новый Структура("types",
						Новый Структура("type,description,items", "array", "Список множественных имен коллекций метаданных (например, 'Справочники','Документы'). Пусто = основные типы.", Новый Структура("type", "string"))
						)
					)
				));
	Инструменты.Добавить(НовоеОписаниеИнструмента(
				"metadata_list_common_modules",
				"Список общих модулей.",
				));
	Инструменты.Добавить(НовоеОписаниеИнструмента(
				"metadata_object",
				"Описание объекта метаданных: формы, реквизиты, табличные части, модули.",
				Новый Структура("type,properties,required",
					"object",
					Новый Структура("full_name",
						Новый Структура("type,description", "string", "Полное имя метаданных")
						),
					Новый Массив
					)
				));
	Инструменты.Добавить(НовоеОписаниеИнструмента(
				"metadata_form",
				"Описание формы: элементы управления, реквизиты.",
				Новый Структура("type,properties,required",
					"object",
					Новый Структура("full_name",
						Новый Структура("type,description", "string", "Полное имя формы, например 'ОбщаяФорма.ФормаНастроек' или 'Справочник.Номенклатура.ФормаЭлемента'")
						),
					Новый Массив
					)
				));
	Инструменты.Добавить(НовоеОписаниеИнструмента(
				"module_list_methods",
				"Список методов модуля",
				Новый Структура("type,properties,required",
					"object",
					Новый Структура("module_name, exportedOnly",
						Новый Структура("type,description", "string", "Полное имя модуля (например 'Справочник.Номенклатура.МодульОбъекта' или 'ОбщийМодуль.ирОбщий')"),
						Новый Структура("type,description", "boolean", "Только экспортные"),
						),
					Новый Массив
					)
				));
	Инструменты.Добавить(НовоеОписаниеИнструмента(
				"module_method",
				"Описание метода модуля",
				Новый Структура("type,properties,required",
					"object",
					Новый Структура("module_name,method_name",
						Новый Структура("type,description", "string", "Полное имя модуля"),
						Новый Структура("type,description", "string", "Имя метода")
						),
					Новый Массив
					)
				));
				
	// Напарник
	Инструменты.Добавить(НовоеОписаниеИнструмента(
				"GetProjects", // Прошито в Напарнике. Он не хочет другие имена использовать.
				"Список проектов",
				));
	Инструменты.Добавить(НовоеОписаниеИнструмента(
				"mcp__syntax-checker__validate", // Прошито в Напарнике. Он не хочет другие имена использовать.
				"Проверка кода",
				Новый Структура("type,properties,required",
					"object",
					Новый Структура("code, use_context",
						Новый Структура("type,description", "string", "текст программы"),
						Новый Структура("type,description", "boolean", "использовать текущий контекст модуля")
						),
					Новый Массив
					)
				));
	Инструменты.Добавить(НовоеОписаниеИнструмента(
				"SearchText",
				"Поиск выражения в модулях",
				Новый Структура("type,properties,required",
					"object",
					Новый Структура("query, refs",
						Новый Структура("type,description", "string", "искомое выражение"),
						Новый Структура("type,description", "boolean", "выполнить поиск выражения целиком (whole word)")
						),
					Новый Массив
					)
				));
	
	Возврат Инструменты;
КонецФункции

Функция НовоеОписаниеИнструмента(Знач Имя, Знач Описание, Знач ПараметрыЖСОН)
	Возврат Новый Структура("type,function",
			"function",
			Новый Структура("name,description,parameters", Имя, Описание, ПараметрыЖСОН)
			);
КонецФункции

Функция ВызватьИнструмент(Знач ИмяИнструмента, Знач Аргументы, ПредставлениеРезультата = "")
	Если мПолеТекстаПрограммы.мПлатформа = Неопределено Тогда
		мПолеТекстаПрограммы.ИнициироватьНеинтерактивно();
	КонецЕсли;
	// Аргументы приходит как Структура (если распарсили) либо как строка JSON
	Если ТипЗнч(Аргументы) = Тип("Строка") И ирОбщий.ЛиТекстJSONЛкс(Аргументы) Тогда
		Аргументы = ирОбщий.ОбъектИзТекстаЖСОНЛкс(Аргументы);
	КонецЕсли;
	Если Аргументы = Неопределено Тогда
		Аргументы = Новый Структура;
	КонецЕсли;
	Если ИмяИнструмента = "platform_list_objects" Тогда
		Возврат Инструмент_ПлатформаСписокОбъектов(Аргументы);
	ИначеЕсли ИмяИнструмента = "platform_object" Тогда
		Возврат Инструмент_ПлатформаОписаниеОбъекта(Аргументы);
	ИначеЕсли ИмяИнструмента = "platform_object_member" Тогда
		Возврат Инструмент_ПлатформаОписаниеСлова(Аргументы);
	ИначеЕсли ИмяИнструмента = "metadata_list_objects" Тогда
		Возврат Инструмент_МетаданныеСписокОбъектов(Аргументы);
	ИначеЕсли ИмяИнструмента = "metadata_list_common_modules" Тогда
		Возврат Инструмент_МетаданныеСписокОбщихМодулей();
	ИначеЕсли ИмяИнструмента = "metadata_object" Тогда
		Возврат Инструмент_МетаданныеОписаниеОбъекта(Аргументы.full_name);
	ИначеЕсли ИмяИнструмента = "metadata_form" Тогда
		Возврат Инструмент_ОписаниеФормы(Аргументы.full_name);
	ИначеЕсли ИмяИнструмента = "module_list_methods" Тогда
		Возврат Инструмент_СписокМетодов(Аргументы);
	ИначеЕсли ИмяИнструмента = "module_method" Тогда
		Возврат Инструмент_ОписаниеМетода(Аргументы);
	// EDT - похоже просто дублирует запущенные на сервере сессии инструментов, чтобы клиент мог показать индикаторы
	ИначеЕсли ирОбщий.СтрКончаетсяНаЛкс(ИмяИнструмента, "GetProjects", Истина) Тогда
		Возврат ирОбщий.ЗначенияВМассивЛкс(Метаданные.Имя);
	ИначеЕсли ирОбщий.СтрКончаетсяНаЛкс(ИмяИнструмента, "SearchText", Истина) Тогда
		// {"search_query": "СвернутьМассивЛкс", "file_patterns": "*.bsl"}
		// {"searchText": "СвернутьМассивЛкс", "filePatterns": "**/*.bsl"}
		// {"query": "СвернутьМассивЛкс", "fileMasks": "*.bsl"}
		Если Аргументы.Свойство("searchText") Тогда    
			ПараметрЧтоИскать = Аргументы.searchText;
		ИначеЕсли Аргументы.Свойство("query") Тогда    
			ПараметрЧтоИскать = Аргументы.query;
		Иначе
			ПараметрЧтоИскать = Аргументы.search_query;
		КонецЕсли;
		ПоискВызововМетода = мПолеТекстаПрограммы.ПолучитьФорму("ПоискВМодулях"); // Всегда новая, т.к. при открытии будет подмена основного объекта
		ПоискВызововМетода.ПараметрЧтоИскать = ПараметрЧтоИскать;
		Если ирОбщий.СвойствоСтруктурыЛкс(Аргументы, "refs") = Истина Тогда
			ПоискВызововМетода.ПараметрРежимПоиска = "Ссылки";
		Иначе
			ПоискВызововМетода.ПараметрРежимПоиска = "Точный";
		КонецЕсли;
		//ПоискВызововМетода.ПараметрСтруктураТипаРодителя = СтруктураТипаРодителя;
		//ПоискВызововМетода.ПараметрСтруктураТипаКонтекста = СтруктураТипаКонтекста;
		ПоискВызововМетода.Открыть();
		ПоискВызововМетода.ОбновитьДанные();
		ПоискВызововМетода.Закрыть();
		Результат = ПоискВызововМетода.ВызовыСлова.Выгрузить(, "Модуль, ВызывающийМетод, НомерСтрокиМодуля");
		Если Результат.Количество() > 100 Тогда
			Возврат "Слишком много результатов";
		КонецЕсли;
		Возврат ирОбщий.ТаблицаЗначенийВМассивЛкс(Результат);
	ИначеЕсли ирОбщий.СтрКончаетсяНаЛкс(ИмяИнструмента, "SearchFiles", Истина) Тогда
		// {"path": ".", "pattern": "*ирОбщий*"}
		Возврат "";
	ИначеЕсли ирОбщий.СтрКончаетсяНаЛкс(ИмяИнструмента, "FindSimilar_in_Project", Истина) Тогда
		// Аргументы.synthetic_call_key = "Справочник Скидки";
		// Аргументы.synthetic_call_key = "CommonModules.*.СортироватьМассив";
		Возврат "";
	ИначеЕсли ирОбщий.СтрКончаетсяНаЛкс(ИмяИнструмента, "Task", Истина) Тогда
		Возврат "";
	ИначеЕсли ИмяИнструмента = "mcp__syntax-checker__validate" Тогда
		АнализаторКода = мПолеТекстаПрограммы.КопияКомпоненты();
		АнализаторКода.УстановитьТекст(Аргументы.code,,,,, мПлатформа.ИмяДинамическогоМодуля());
		АнализаторКода.ПроверитьВыраженияТекста(,,,,, Ложь);
		ТаблицаОшибок = АнализаторКода.ОшибкиМодуля.Выгрузить(, "ВыражениеРодитель, Позиция, Слово, ТипОшибки, ТипРодителя");
		Если ТаблицаОшибок.Количество() = 0 Тогда
			ПредставлениеРезультата = "Ошибок не найдено";
			Возврат "";
		ИначеЕсли ТаблицаОшибок.Количество() > 100 Тогда
			Возврат "Слишком много ошибок";
		Иначе
			мНакопленныйОтвет = "";
			ПредставлениеРезультата = ирОбщий.СтрШаблонЛкс("Найдено %1 ошибок, текст очищен", ТаблицаОшибок.Количество());
			Возврат ирОбщий.ТаблицаЗначенийВМассивЛкс(ТаблицаОшибок);
		КонецЕсли;
	ИначеЕсли ИмяИнструмента = "check_patches" Тогда
		Возврат Инструмент_ПроверитьПатчи(Аргументы.text);
	ИначеЕсли ирОбщий.СтрКончаетсяНаЛкс(ИмяИнструмента, "Search_ITS", Истина) Тогда
		// Аргументы.query = "Методы сортировки массива Сортировать";
		Возврат "";
	ИначеЕсли ирОбщий.СтрКончаетсяНаЛкс(ИмяИнструмента, "Search_Documentation", Истина) Тогда
		// Аргументы.query = "Методы сортировки массива Сортировать";
		Возврат "";
	Иначе
		//ВызватьИсключение "ИИ запросил неизвестный инструмент: " + ИмяИнструмента;
		Возврат "";
	КонецЕсли;
КонецФункции   

Функция Инструмент_ПроверитьПатчи(ТекстПатчей) Экспорт
	Патчи = ирОбщий.ОбъектИзТекстаЖСОНЛкс(ТекстПатчей);
	Патчи = ирОбщий.ТаблицаЗначенийИзКоллекцииЛкс(Патчи,,,,, Ложь, Ложь,,,);
	//! Патчи.Колонки.Добавить("start");
	//! Патчи.Колонки.Добавить("end");
	//! Патчи.Колонки.Добавить("isInsert");
	Ошибки = Новый Массив;
	Текст = мПолеТекстаПрограммы.мОригинальныйТекст;
	Для Каждого ПатчиЭлемент Из Патчи Цикл
		Если ПатчиЭлемент.start <> Неопределено И ПатчиЭлемент.start <> "" Тогда
			НайтиМаркерБлока(Текст, ПатчиЭлемент.start,, Не ПатчиЭлемент.isInsert, Истина, Ошибки);
		КонецЕсли;
	КонецЦикла;
	Возврат ирОбщий.СтрСоединитьЛкс(Ошибки, Символы.ПС);
КонецФункции

Функция НайтиМаркерБлока(Знач Текст , Знач Маркер, Знач НачальнаяПозиция = 0, Знач ЛиСтрогийКонец = Истина, Знач ТребоватьУникальность = Ложь, Знач Ошибки = Неопределено) Экспорт
	ШаблонМаркера = Маркер;
	ШаблонМаркера = ирОбщий.ТекстДляРегВыраженияЛкс(ШаблонМаркера);
	ШаблонЗаменыНепечатных = "[ \t\n]+";
	ШаблонМаркера = ирОбщий.ЗаменитьРегВыражениеЛкс(ШаблонМаркера, "(\\n|[ \t])+", ШаблонЗаменыНепечатных, Ложь);
	Если ирОбщий.СтрНачинаетсяСЛкс(ШаблонМаркера, ШаблонЗаменыНепечатных) Тогда
		ШаблонМаркера = ирОбщий.ТекстБезПервогоФрагментаЛкс(ШаблонМаркера, ШаблонЗаменыНепечатных);
	КонецЕсли;
	Если ирОбщий.СтрКончаетсяНаЛкс(ШаблонМаркера, ШаблонЗаменыНепечатных) Тогда
		ШаблонМаркера = ирОбщий.ТекстБезПоследнегоФрагментаЛкс(ШаблонМаркера, ШаблонЗаменыНепечатных);
	КонецЕсли;
	ШаблонМаркера = "^[ \t]*" + ШаблонМаркера;
	Если ЛиСтрогийКонец Тогда
		ШаблонМаркера = ШаблонМаркера + "[ |\t]*$";
	КонецЕсли;
	Вхождение = ирОбщий.НайтиРегВыражениеЛкс(Сред(Текст, НачальнаяПозиция + 1), ШаблонМаркера,, ТребоватьУникальность,, Истина, Ложь);
	Если Вхождение.Количество() = 1 Тогда
		Вхождение = Вхождение[0];
	ИначеЕсли Вхождение.Количество() > 1 Тогда
		Если ТребоватьУникальность Тогда
			ТекстСообщения = "Найдены дубли маркера: " + ирОбщий.ПредставлениеСОбрезкойДлиныЛкс(СокрЛП(Маркер), 100);
			Если Ошибки <> Неопределено Тогда
				Ошибки.Добавить(ТекстСообщения);
			Иначе
				ирОбщий.СообщитьЛкс(ТекстСообщения);
			КонецЕсли;
			Возврат Неопределено;
		КонецЕсли;
		Вхождение = Вхождение[0];
	Иначе
		ТекстСообщения = "Не удалось найти маркер: " + ирОбщий.ПредставлениеСОбрезкойДлиныЛкс(СокрЛП(Маркер), 100);
		Если Ошибки <> Неопределено Тогда
			Ошибки.Добавить(ТекстСообщения);
		Иначе
			ирОбщий.СообщитьЛкс(ТекстСообщения);
		КонецЕсли;
		Возврат Неопределено;
	КонецЕсли;
	Возврат Вхождение;
КонецФункции   

Функция Инструмент_СписокМетодов(Знач Аргументы) Экспорт
	Структура = Новый Структура;
	Если Аргументы.exportedOnly Тогда
		Структура.Вставить("ЛиЭкспорт", Истина);
	КонецЕсли;
	МодульПоИмени = МодульПоИмени(Аргументы.module_name);
	Массив = МодульПоИмени.Методы.Скопировать(Структура).ВыгрузитьКолонку("Имя");
	Возврат Массив;
КонецФункции

Функция МодульПоИмени(Знач ИмяМодуля) Экспорт
	МодульПоИмени = мПлатформа.ПолеТекстаМодуля(ИмяМодуля).мМодульМетаданных;
	Возврат МодульПоИмени;
КонецФункции

Функция Инструмент_ОписаниеМетода(Знач Аргументы) Экспорт
	МодульПоИмени = МодульПоИмени(Аргументы.module_name);
	СтрокаМетода = МодульПоИмени.Методы.Найти(НРег(Аргументы.method_name), "НИмя");
	Результат = мПолеТекстаПрограммы.МетодНапарника(СтрокаМетода, Аргументы.module_name);
	Возврат Результат;
КонецФункции

Функция Инструмент_ПлатформаСписокОбъектов(Знач Аргументы)
	Отбор = Новый Структура("ЯзыкПрограммы", 0);
	Возврат мПлатформа.ТаблицаОбщихТипов.Скопировать(Отбор).ВыгрузитьКолонку("БазовыйТип");
КонецФункции

Функция Инструмент_ПлатформаОписаниеОбъекта(Знач Аргументы)
	ОписаниеОбщегоТипа = мПлатформа.ОписаниеОбщегоТипаПоБазовому(Аргументы.name);
	Таблица = мПлатформа.ТаблицаКонтекстов.Скопировать(Новый Структура("ТипКонтекста, ЯзыкПрограммы", ОписаниеОбщегоТипа.Слово, 0), "Слово, ТипСлова");
	//СинтаксПомощник = Обработки.ирСинтаксПомощник.Создать();
	//Результат = СинтаксПомощник.ТекстовоеОписаниеСлова(ОписаниеОбщегоТипа);
	Результат = ирОбщий.СтруктураИзСтрокиТаблицыИлиДереваИлиВыборкиЛкс(ОписаниеОбщегоТипа);
	Результат.Вставить("Члены", ирОбщий.ТаблицаЗначенийВМассивЛкс(Таблица));
	Возврат Результат;
КонецФункции

Функция Инструмент_ПлатформаОписаниеСлова(Знач Аргументы)
	ПолноеИмяСлова = Аргументы.full_name;
	Если ПустаяСтрока(ПолноеИмяСлова) Тогда
		ВызватьИсключение "full_name не задан";
	КонецЕсли;
	ЛиМетод = Аргументы.isMethod;
	ТипКонтекста = "Глобальный";
	Если Найти(ПолноеИмяСлова, ".") Тогда
		ТипКонтекста = ирОбщий.ПервыйФрагментЛкс(ПолноеИмяСлова);
	КонецЕсли;
	Слово = ирОбщий.ПоследнийФрагментЛкс(ПолноеИмяСлова);
	Отбор = Новый Структура("ТипКонтекста, Слово, ЯзыкПрограммы", ТипКонтекста, Слово, 0);
	СтрокаСлова = мПлатформа.ТаблицаКонтекстов.НайтиСтроки(Отбор)[0];
	СинтаксПомощник = Обработки.ирСинтаксПомощник.Создать();
	Результат = СинтаксПомощник.ТекстовоеОписаниеСлова(СтрокаСлова);
	Возврат Результат;
КонецФункции

Функция Инструмент_МетаданныеСписокОбъектов(Знач Аргументы)
	Типы = Неопределено;
	Если ЗначениеЗаполнено(Аргументы) Тогда
		Типы = ирОбщий.СвойствоСтруктурыЛкс(Аргументы, "types");
	КонецЕсли;
	Если Типы = Неопределено Или Типы.Количество() = 0 Тогда
		Типы = ирКэш.ТипыМетаОбъектов(Истина, Ложь, Истина).ВыгрузитьКолонку("Множественное");
	КонецЕсли;
	Результат = Новый Массив;
	Для Каждого ИмяКоллекции Из Типы Цикл
		Если ИмяКоллекции = "Перерасчеты" Тогда
			Продолжить;
		КонецЕсли;
		Коллекция = Метаданные[ИмяКоллекции];
		Для Каждого ОбъектМД Из Коллекция Цикл // ОбъектМетаданных
			Значение = Новый Структура;
			//Значение.Вставить("type", ИмяКоллекции);
			Значение.Вставить("name", ОбъектМД.Имя);
			Значение.Вставить("full_name", ОбъектМД.ПолноеИмя());
			Результат.Добавить(Значение);
		КонецЦикла;
	КонецЦикла;
	Возврат Результат;
КонецФункции

Функция Инструмент_МетаданныеСписокОбщихМодулей()
	Результат = Новый Массив;
	Для Каждого МД Из Метаданные.ОбщиеМодули Цикл
		Структура = Новый Структура;
		Структура.Вставить("name", МД.Имя);
		Структура.Вставить("global", МД.Глобальный);
		Структура.Вставить("server", МД.Сервер);
		Структура.Вставить("serverCall", МД.ВызовСервера);
		Структура.Вставить("сashMode", МД.ПовторноеИспользованиеВозвращаемыхЗначений);
		Структура.Вставить("clientOrdinary", МД.КлиентОбычноеПриложение);
		Структура.Вставить("clientManaged", МД.КлиентУправляемоеПриложение);
		Результат.Добавить(Структура);
	КонецЦикла;
	Возврат Результат;
КонецФункции

Функция Инструмент_MetadataListCommonForms()
	Результат = Новый Массив;
	Для Каждого МД Из Метаданные.ОбщиеФормы Цикл
		Результат.Добавить(Новый Структура("name", МД.Имя));
	КонецЦикла;
	Возврат Результат;
КонецФункции

Функция Инструмент_МетаданныеОписаниеОбъекта(Знач ПолноеИмяМД)
	Если ПустаяСтрока(ПолноеИмяМД) Тогда
		ВызватьИсключение "full_name не задан";
	КонецЕсли;
	ОбъектМД = Метаданные.НайтиПоПолномуИмени(ПолноеИмяМД);
	Структура = мПолеТекстаПрограммы.ОбъектМДНапарника(ОбъектМД);
	Возврат Структура;
КонецФункции

Функция Инструмент_ОписаниеФормы(Знач ПолноеИмяФормы)
	Если ПустаяСтрока(ПолноеИмяФормы) Тогда
		ВызватьИсключение "full_name не задан";
	КонецЕсли;
	Форма = мПлатформа.ПассивнаяФормаПоИмениКэш(ПолноеИмяФормы);
	Структура = мПолеТекстаПрограммы.ФормаНапарника(Форма);
	Возврат Структура;
КонецФункции    

// QWEN CLI OAuth авторизация. Больше не работает бесплатно.
// https://qwenlm.github.io/qwen-code-docs/ru/users/configuration/auth/
// https://github.com/hawkxtreme/mini-ai-1c/blob/main/tauri-app/src-tauri/src/llm/cli_providers/qwen.rs

// глобавльный фиксированный идентификатор этого типа клиента
Функция ИДКлиентаКВЕН() Экспорт
	Возврат "f0304373b74a44d2b584a3fb70ca9e56";
КонецФункции

Функция ФайлТокенаКВЕН() Экспорт
	ФайлТокена = Новый Файл(мПлатформа.КаталогФайловогоКэша + ирОбщий.РазделительПутиКФайлуЛкс() + "QWEN.tkn");
	Возврат ФайлТокена;
КонецФункции

Функция ПолучитьТокенКвен() Экспорт
	ФайлТокена = ФайлТокенаКВЕН();
	Если Не ФайлТокена.Существует() Тогда
		Возврат Неопределено;
	КонецЕсли;
	Данные = ирОбщий.ЗагрузитьЗначениеИзФайлаЛкс(ФайлТокена.ПолноеИмя); // см. ДанныеТокенаОбразец
	Если Ложь
		Или Данные = Неопределено
		Или Не Данные.Свойство("expires_at")
	Тогда
		Возврат Неопределено;
	КонецЕсли;
	ТекущееВремя = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Если ТекущееВремя > Данные.expires_at Тогда
		Возврат ОбновитьТокенКвен(Данные);
	КонецЕсли;
	Возврат Данные;
КонецФункции  

Функция ДанныеТокенаОбразец() Экспорт
	Текст = "{
|""status"": ""success"",
|""access_token"": ""DDoKXu0S0YLA9uqZJhnMmmne-jk9neRmHjcEtqHnVoLVxaI5jzg9WHYHFDUaUWui96by9sG4LbGQ4SD76Cew1g"",
|""refresh_token"": ""Jp-FxIH6gUHunDjnzmmey7MSs7SURfYfYUNDZESsvf-k3Tmdx7VPr84tAHC6IkgGUXbXFm2xJuRja9FV4oDSuQ"",
|""token_type"": ""Bearer"",
|""expires_in"": 21600,
|""scope"": ""openid profile email model.completion"",
|""resource_url"": ""portal.qwen.ai"",
|""expires_at"": 63909906935058
|}";
	Возврат Вычислить("ПрочитатьJSON(Текст)");
КонецФункции

Функция ОбновитьТокенКвен(Знач ДанныеТокена) Экспорт
	Если НЕ ДанныеТокена.Свойство("refresh_token") Тогда
		Возврат Неопределено;
	КонецЕсли;
	Тело = "client_id="+ИДКлиентаКВЕН()+
		"&grant_type=refresh_token" +
		"&refresh_token=" + ДанныеТокена.refresh_token;
	HTTPСоединение = ирОбщий.СоединениеHTTPЛкс("chat.qwen.ai",,,,,, Истина);
	HTTPОтвет = ЗапроситьКвенТокен(HTTPСоединение, "token", Тело);
	Если ирОбщий.ЛиУспешныйОтветHTTPЛкс(HTTPОтвет) Тогда
		ТекстОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
		НовыеДанные = ирОбщий.ОбъектИзТекстаЖСОНЛкс(ТекстОтвета);
		СохранитьТокенКВЕН(НовыеДанные);
		Возврат НовыеДанные;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

Функция ВосстановитьКодПроверки() Экспорт
	Возврат ирОбщий.ВосстановитьЗначениеЛкс("КодПроверкиКВЕН");
КонецФункции

Функция СохранитьКодПроверки(ПроверочныйКод) Экспорт
	ирОбщий.СохранитьЗначениеЛкс("КодПроверкиКВЕН", ПроверочныйКод);
КонецФункции

Процедура АвторизоватьсяВКвен() Экспорт
	CodeVerifier = СгенерироватьКодПроверки();
	CodeChallenge = СгенерироватьКодГонки(CodeVerifier);
	СохранитьКодПроверки(CodeVerifier);
	Тело = "client_id="+ИДКлиентаКВЕН()+
		"&scope=openid%20profile%20email%20model.completion" +
		"&code_challenge_method=S256" +
		"&code_challenge=" + CodeChallenge;
	HTTPСоединение = ирОбщий.СоединениеHTTPЛкс("chat.qwen.ai",,,,,, Истина);
	HTTPОтвет = ЗапроситьКвенТокен(HTTPСоединение, "device/code", Тело);
	Если Не ирОбщий.ЛиУспешныйОтветHTTPЛкс(HTTPОтвет) Тогда
		Сообщить("Ошибка начала авторизации: " + HTTPОтвет.ПолучитьТелоКакСтроку());
		Возврат;
	КонецЕсли;
	Данные = ирОбщий.ОбъектИзТекстаЖСОНЛкс(HTTPОтвет.ПолучитьТелоКакСтроку());
	ЗапуститьПриложение(Данные.verification_uri_complete);
	Сообщить("Выполните авторизацию в открывшемся браузере на сайте Qwen");
	DeviceCode = Данные.device_code;
	ИнтервалСекунд = 3;
	МаксОжидание = 10; // Максимум 10 секунд
	ПрошлоСекунд = 0;
	Успех = Ложь;
	Индикатор = ирОбщий.ПолучитьИндикаторПроцессаЛкс(, "Ждем авторизации через Браузер");
	Пока ПрошлоСекунд < МаксОжидание Цикл
		ирОбщий.ОбработатьИндикаторЛкс(Индикатор);
		ирОбщий.ПаузаЛкс(ИнтервалСекунд);
		ПрошлоСекунд = ПрошлоСекунд + ИнтервалСекунд;
		Тело = "client_id="+ИДКлиентаКВЕН()+
			"&device_code=" + DeviceCode +
			"&grant_type=urn:ietf:params:oauth:grant-type:device_code" +
			"&code_verifier=" + ВосстановитьКодПроверки();
		HTTPОтвет = ЗапроситьКвенТокен(HTTPСоединение, "token", Тело);
		Если ирОбщий.ЛиУспешныйОтветHTTPЛкс(HTTPОтвет) Тогда
			НовыеДанные = ирОбщий.ОбъектИзТекстаЖСОНЛкс(HTTPОтвет.ПолучитьТелоКакСтроку());
			СохранитьТокенКВЕН(НовыеДанные);
			Успех = Истина;
			Прервать;
		Иначе
			ТекстОшибки = HTTPОтвет.ПолучитьТелоКакСтроку();
			Если Найти(ТекстОшибки, "authorization_pending") Тогда
				Продолжить;
			ИначеЕсли Найти(ТекстОшибки, "slow_down") Тогда
				ИнтервалСекунд = ИнтервалСекунд + 1;
				Продолжить;
			ИначеЕсли Найти(ТекстОшибки, "expired_token") Тогда
				Сообщить("Время ожидания авторизации истекло");
				Прервать;
			Иначе
				Сообщить("Ошибка авторизации: " + ТекстОшибки);
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Если Успех Тогда
		Сообщить("Авторизация Qwen выполнена!");
	Иначе
		Сообщить("Авторизация Qwen НЕ выполнена.");
	КонецЕсли;
КонецПроцедуры

Функция ЗапроситьКвенТокен(Знач HTTPСоединение, Знач АдресРесурса, Знач Тело) Экспорт
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");
	HTTPЗапрос = Новый HTTPЗапрос("/api/v1/oauth2/"+ АдресРесурса);
	HTTPЗапрос.Заголовки = Заголовки;
	HTTPЗапрос.УстановитьТелоИзСтроки(Тело);
	HTTPОтвет = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	Возврат HTTPОтвет;
КонецФункции

Процедура СохранитьТокенКВЕН(Знач НовыеДанные) Экспорт
	НовыеДанные.Вставить("expires_at", ТекущаяУниверсальнаяДатаВМиллисекундах() + НовыеДанные.expires_in * 1000);
	ирОбщий.СохранитьЗначениеВФайлЛкс(НовыеДанные, ФайлТокенаКВЕН().ПолноеИмя);
КонецПроцедуры

// Генерирует случайный code_verifier (строка из 43-128 символов)
// Используется для OAuth2 PKCE flow
Функция СгенерироватьКодПроверки() Экспорт
	// code_verifier должен быть длиной от 43 до 128 символов
	// Генерируем 64 случайных символа из безопасного набора
	Длина = 64;
	РазрешенныеСимволы = "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789-._~";
	Результат = "";
	Генератор = Новый ГенераторСлучайныхЧисел();
	Для Номер = 1 По Длина Цикл
		СлучайныйИндекс = Генератор.СлучайноеЧисло(0, СтрДлина(РазрешенныеСимволы) - 1);
		Результат = Результат + Сред(РазрешенныеСимволы, СлучайныйИндекс + 1, 1);
	КонецЦикла;
	Возврат Результат;
КонецФункции

// Вычисляет code_challenge из code_verifier по методу S256
// code_challenge = base64url(SHA256(code_verifier))
Функция СгенерироватьКодГонки(Знач КодПроверки) Экспорт
	Хеш = ирОбщий.ХешЛкс(КодПроверки,, Вычислить("ХешФункция").SHA256, Истина);
	Base64Строка = Вычислить("ПолучитьBase64СтрокуИзДвоичныхДанных(Хеш)");
	Base64Url = СтрЗаменить(Base64Строка, "+", "-");
	Base64Url = СтрЗаменить(Base64Url, "/", "_");
	Base64Url = СтрЗаменить(Base64Url, "=", "");
	Возврат Base64Url;
КонецФункции

//ирПортативный лФайл = Новый Файл(ИспользуемоеИмяФайла);
//ирПортативный ПолноеИмяФайлаБазовогоМодуля = Лев(лФайл.Путь, СтрДлина(лФайл.Путь) - СтрДлина("Модули\")) + "ирПортативный.epf";
//ирПортативный #Если Клиент Тогда
//ирПортативный 	Контейнер = Новый Структура();
//ирПортативный 	Оповестить("ирПолучитьБазовуюФорму", Контейнер);
//ирПортативный 	Если Не Контейнер.Свойство("ирПортативный", ирПортативный) Тогда
//ирПортативный 		ирПортативный = ВнешниеОбработки.ПолучитьФорму(ПолноеИмяФайлаБазовогоМодуля);
//ирПортативный 		ирПортативный.Открыть();
//ирПортативный 	КонецЕсли;
//ирПортативный #Иначе
//ирПортативный 	ирПортативный = ВнешниеОбработки.Создать(ПолноеИмяФайлаБазовогоМодуля, Ложь); // Это будет второй экземпляр объекта
//ирПортативный #КонецЕсли
//ирПортативный ирОбщий = ирПортативный.ОбщийМодульЛкс("ирОбщий");
//ирПортативный ирКэш = ирПортативный.ОбщийМодульЛкс("ирКэш");
//ирПортативный ирСервер = ирПортативный.ОбщийМодульЛкс("ирСервер");
//ирПортативный ирКлиент = ирПортативный.ОбщийМодульЛкс("ирКлиент");

мПлатформа = ирКэш.Получить();
#Если Сервер И Не Сервер Тогда
	мПлатформа = Обработки.ирПлатформа.Создать();
	мПолеТекстаПрограммы = Обработки.ирКлсПолеТекстаПрограммы.Создать();
#КонецЕсли
#КонецЕсли
