Процедура КнопкаОКНажатие(Кнопка)
	
	СохранитьЗначение("ир_ВыполнятьПредварительныйЗапрос", ВыполнятьПредварительныйЗапрос);
	СохранитьЗначение("ир_БезопасныйПорогКоличестваСтрок", БезопасныйПорогКоличестваСтрок);
	Закрыть();
	
КонецПроцедуры

Процедура ОбновитьДоступность()

	ЭлементыФормы.БезопасныйПорогКоличестваСтрок.Доступность = ВыполнятьПредварительныйЗапрос;

КонецПроцедуры // ОбновитьДоступность()

Процедура ПриОткрытии()
	
	ВыполнятьПредварительныйЗапрос = ВосстановитьЗначение("ир_ВыполнятьПредварительныйЗапрос");
	БезопасныйПорогКоличестваСтрок = ВосстановитьЗначение("ир_БезопасныйПорогКоличестваСтрок");
	ОбновитьДоступность();
	
КонецПроцедуры

Процедура ВыполнятьПредварительныйЗапросПриИзменении(Элемент)
	
	ОбновитьДоступность();

КонецПроцедуры

ирОбщий.ИнициализироватьФормуЛкс(ЭтаФорма, "Обработка.ирПлатформа.Форма.НастройкаОсторожностиВыборкиДанных");
