
Процедура ДействияФормыМенеджерТабличногоПоля(Кнопка)
	
	ирКлиент.ОткрытьМенеджерТабличногоПоляЛкс(ЭлементыФормы.СправочникСписок, ЭтаФорма);
	
КонецПроцедуры

Процедура ДействияФормыОПодсистеме(Кнопка)
	
	ирКлиент.ОткрытьСправкуПоПодсистемеЛкс(ТипЗнч(СправочникСписок));
	
КонецПроцедуры

Процедура СправочникСписокПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущаяСтрока <> Неопределено Тогда
		Текст = Элемент.ТекущаяСтрока.XML;
	Иначе
		Текст = "";
	КонецЕсли; 
	ЭлементыФормы.ПолеТекста.УстановитьТекст(Текст);
	
КонецПроцедуры

Процедура ДействияФормыОтладить(Кнопка)
	
	Ссылка = ЭлементыФормы.СправочникСписок.ТекущаяСтрока;
	Если Ссылка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ирКлиент.ОтладитьОтложенныйОбъектЛкс(Ссылка);
	
КонецПроцедуры

Порядок.Установить("ДатаИзменения Убыв");