
Процедура ОсновныеДействияФормыОК(Кнопка)
	
	СтруктураВозврата = Новый Структура("МинимальнаяДата, МаксимальнаяДата");
	ЗаполнитьЗначенияСвойств(СтруктураВозврата, ЭтаФорма);
	Закрыть(СтруктураВозврата);
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	Если Не ЗначениеЗаполнено(МаксимальнаяДата) Тогда
		МаксимальнаяДата = КонецМесяца(ДобавитьМесяц(ТекущаяДата(), -1));
	КонецЕсли; 
	Если Не ЗначениеЗаполнено(МинимальнаяДата) Тогда
		МинимальнаяДата = КонецМесяца(ДобавитьМесяц(ТекущаяДата(), -12*2));
	КонецЕсли;
	ЭлементыФормы.МинимальнаяДата.Доступность = ирКэш.НомерРежимаСовместимостиЛкс() >= 803003;
	
КонецПроцедуры

Процедура МинимальнаяДатаПриИзменении(Элемент)
	
	ЭтаФорма.МаксимальнаяДата = КонецМесяца(МаксимальнаяДата);
	
КонецПроцедуры // РегистрыНакопленияПериодИтоговПриИзменении

Процедура МаксимальнаяДатаПриИзменении(Элемент)
	
	ЭтаФорма.МинимальнаяДата = КонецМесяца(МинимальнаяДата);
	
КонецПроцедуры 

Процедура ВнешнееСобытие(Источник, Событие, Данные) Экспорт
	
	ирКлиент.Форма_ВнешнееСобытиеЛкс(ЭтаФорма, Источник, Событие, Данные);

КонецПроцедуры

Процедура ТабличноеПолеПриПолученииДанных(Элемент, ОформленияСтрок) Экспорт 
	
	ирКлиент.ТабличноеПолеПриПолученииДанныхЛкс(ЭтаФорма, Элемент, ОформленияСтрок);

КонецПроцедуры

ирКлиент.ИнициироватьФормуЛкс(ЭтаФорма, "Обработка.ирУправлениеИтогамиРегистров.Форма.УстановитьГраницыИтогов");
