Перем ПараметрыПодключаемыхКоманд Экспорт;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПараметрыПодключаемыхКоманд = Новый Структура; 
	ТаблицаКоманд = Неопределено;
	#Если Сервер И Не Сервер Тогда
		ТаблицаКоманд = Новый ТаблицаЗначений; // см. ПодключаемыеКомандыПереопределяемый.ПриОпределенииКомандПодключенныхКОбъекту.Команды 
	#КонецЕсли
	ПараметрыПодключаемыхКоманд.Вставить("АдресТаблицыКоманд", ПоместитьВоВременноеХранилище(ТаблицаКоманд)); 
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервереЛкс(Параметры) Экспорт
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(П1, П2) Экспорт
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(П1, П2) Экспорт
КонецПроцедуры


