Процедура OKНажатие(Кнопка)
	Отбор = Новый Структура;
	
	Если Не ПустаяСтрока(Ключ) Тогда
		Отбор.Вставить("Ключ", Ключ);
	КонецЕсли;
	
	Если Не ПустаяСтрока(Наименование) Тогда
		Отбор.Вставить("Наименование", Наименование);
	КонецЕсли;
	
	Если МетаданныеВыбор <> Неопределено Тогда
		Отбор.Вставить("Метаданные", МетаданныеВыбор);
	КонецЕсли;
	
	Если Предопределенное Тогда
		Отбор.Вставить("Предопределенное", Предопределенное);
	КонецЕсли;
	
	Если Использование Тогда
		Отбор.Вставить("Использование", Использование);
	КонецЕсли;
	
	Закрыть(Истина);
КонецПроцедуры

Процедура ПриОткрытии()
	Предопределенное = Ложь;
	Использование = Ложь;
	
	Для Каждого Метаданное из Метаданные.РегламентныеЗадания Цикл
		ЭлементыФормы.МетаданныеВыбор.СписокВыбора.Добавить(Метаданное, Метаданное.Представление());
	КонецЦикла;
	
	Если Отбор <> Неопределено Тогда
		Для Каждого Свойство из Отбор Цикл
			Если Свойство.Ключ = "Ключ" Тогда
				Ключ = Свойство.Значение;
			ИначеЕсли Свойство.Ключ = "Наименование" Тогда
				Наименование = Свойство.Значение;	
			ИначеЕсли Свойство.Ключ = "Использование" Тогда
				Использование = Свойство.Значение;	
			ИначеЕсли Свойство.Ключ = "Предопределенное" Тогда
				Предопределенное = Свойство.Значение;	
			ИначеЕсли Свойство.Ключ = "Метаданные" Тогда
				МетаданныеВыбор = Свойство.Значение;		
			КонецЕсли;		
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ВнешнееСобытие(Источник, Событие, Данные) Экспорт
	
	ирОбщий.Форма_ВнешнееСобытиеЛкс(ЭтаФорма, Источник, Событие, Данные);

КонецПроцедуры

Процедура ТабличноеПолеПриПолученииДанных(Элемент, ОформленияСтрок) Экспорт 
	
	ирОбщий.ТабличноеПолеПриПолученииДанныхЛкс(ЭтаФорма, Элемент, ОформленияСтрок);

КонецПроцедуры

ирОбщий.ИнициироватьФормуЛкс(ЭтаФорма, "Обработка.ирКонсольЗаданий.Форма.ДиалогОтбораРегламентногоЗадания");
