// https://infostart.ru/1c/tools/166557/
// Документация https://forum.infostart.ru/bitrix/components/bitrix/forum.interface/show_file.php?fid=281712

Перем ВерсияБазы Экспорт;
Перем LogLevel Экспорт; // Число - 0 не логировать
Перем РежимЛокализованныхИмен Экспорт; // Булево - Использовать локализованные имена полей в возвращаемых структурах 1С, по умолчанию - Ложь
Перем FileOpeningMode Экспорт; // Число - Режим открытия файла:
	//0 — чтение/запись с блокировкой сторонней записи в файл
	//1 — чтение/запись с полной блокировкой файла (монопольный режим)
	//2 — только чтение с блокировкой сторонней записи в файл
	//3 — только чтение без блокировки файла (данный режим не рекомендуется к использованию, поскольку изменение данных в файле не отслеживается)
	//Значение по умолчанию: 0 

// Открыть файл БД 1С.
// 
// Параметры:
//  ИмяФайла - Строка - 
//
Функция ОткрытьФайлБД(ИмяФайла) Экспорт
КонецФункции   

// Прочитать метаданные из уже открытого файла. OpenMetadata
//
Процедура ОткрытьМетаданные() Экспорт 
КонецПроцедуры   

// Получить массив структур с описанием таблиц БД
//
// Параметры:
//  ВключатьОписания - Булево - 
// 
// Возвращаемое значение:
//  Строка - в формате ЗначениеВСтрокуВнутр:
//   *Значение - Массив из Структура:
//    **Имя - Строка
//    **Описание - Строка
//    **ИндексЗаписей - Число
//    **ИндексБлоб - Число
//    **ИндексИндексов - Число
//
Функция ПолучитьМассивТаблиц(ВключатьОписания) Экспорт 
КонецФункции

// Получить размер объекта
//
// Параметры:
//  ИндексОбъекта - Число - 
// 
// Возвращаемое значение:
//  Число - размер в байтах
//
Функция ПолучитьРазмерОбъекта(ИндексОбъекта) Экспорт
КонецФункции

// Закрыть файл БД 1С
// 
Функция ЗакрытьФайл() Экспорт
КонецФункции   

// Закрыть лог-файл
// 
Функция ЗакрытьЛогФайл() Экспорт
КонецФункции    

// Открывает таблицу БД
// 
// Параметры:
//  ИндексЯчейки - Число - от 0 до 15
//  ИмяТаблицы - Строка
//
Функция ОткрытьТаблицу(ИндексЯчейки, ИмяТаблицы) Экспорт
КонецФункции   

// Закрыть таблицу БД
// 
// Параметры:
//  ИндексЯчейки - Число - от 0 до 15
//
Функция ЗакрытьТаблицу(ИндексЯчейки) Экспорт
КонецФункции   

