// https://github.com/tormozit/RDT_Common_1C

// Идентификатор текущего процесса ОС.
// 
// Возвращаемое значение:
//  Число - 
//
Функция PID() Экспорт
КонецФункции   

// Замораживает поток на заданное время.
// 
// Параметры:
//  ЧислоМилисекунд - Число - 
//
Функция Sleep(ЧислоМилисекунд) Экспорт
КонецФункции   

// Получает признак наличия административных привилегий с элевацией у текущего пользователя ОС.
// 
// Возвращаемое значение:
//  Булево - 
//
Функция IsAdmin() Экспорт
КонецФункции 

// Запоминает позицию каретки; к полученным через WinAPI координатам (их не всегда удается получить) добавляется смещение
// Параметры:
//  СмещениеX - Число - 
//  СмещениеY - Число - 
//
Функция GetCaretPos(СмещениеX, СмещениеY) Экспорт
КонецФункции 

// см. GetCaretPos
Функция ЗапомнитьПозициюКаретки(СмещениеX, СмещениеY) Экспорт
КонецФункции 

// Перемещает левый верхний угол окна в запомненную позицию каретки
// Параметры:
//  РазрешитьВыходЗаГраницыЭкрана - Булево - 
//
Функция MoveWindowToCaretPos(РазрешитьВыходЗаГраницыЭкрана = Ложь) Экспорт
КонецФункции 

// см. MoveWindowToCaretPos
Функция ПереместитьОкноВПозициюКаретки(РазрешитьВыходЗаГраницыЭкрана = Ложь) Экспорт
КонецФункции    

// Выполняет команду системы
// Параметры:
//  ИсполняемыйФайл - Строка - 
//  ПараметрыЗапуска - Строка - 
//  ТекущийКаталог - Строка - 
//  ОжидатьЗавершения - Булево - 
//  Элевация - Булево - 
//
Функция Run(ИсполняемыйФайл, ПараметрыЗапуска, ТекущийКаталог, ОжидатьЗавершения, Элевация) Экспорт
КонецФункции 
