Перем мФоновыйЗапросХттп;
Перем мДатаАктивностиПользователя;

Процедура ПриОткрытии()
	мПлатформа = ирКэш.Получить();
	#Если Сервер И Не Сервер Тогда
		мПлатформа = Обработки.ирПлатформа.Создать();
	#КонецЕсли
	ирКлиент.Форма_ПриОткрытииЛкс(ЭтаФорма);
	мФоновыйЗапросХттп = ирКлиент.НовыйФоновыйЗапросХттпЛкс(ЭтаФорма); 
	мДатаАктивностиПользователя = ТекущаяДата();
КонецПроцедуры

Процедура СинхронизоватьВФорме() Экспорт
	Если Истина
		И ТекущаяДата() - мПлатформа.мДатаАктивностиПользователя > 5 
		И Не мФоновыйЗапросХттп.ЛиЗапросВыполняется() 
	Тогда
		СинхронизоватьМетаданныеНапарника(, ЭтаФорма.Индикатор1, мФоновыйЗапросХттп);
		ЭтаФорма.Заголовок = "" + Индикатор1 + "% " + ирОбщий.СлужебныеДанныеФормыЛкс(ЭтаФорма).ОригинальныйЗаголовок;
		Если Индикатор1 = 100 Тогда
			Закрыть();
		КонецЕсли;
	КонецЕсли;
	Если Открыта() Тогда
		ПодключитьОбработчикОжидания("СинхронизоватьВФорме", 0.5, Истина);
	КонецЕсли;
КонецПроцедуры

Процедура ВнешнееСобытие(Источник, Событие, Данные) Экспорт
	ирКлиент.Форма_ВнешнееСобытиеЛкс(ЭтаФорма, Источник, Событие, Данные);
КонецПроцедуры

Процедура КлсКомандаНажатие(Кнопка)
	ирКлиент.УниверсальнаяКомандаФормыЛкс(ЭтаФорма, Кнопка);
КонецПроцедуры

Процедура ПриЗакрытии()
	ирКлиент.Форма_ПриЗакрытииЛкс(ЭтаФорма);
	ОтключитьОбработчикОжидания("СинхронизоватьВФорме");
КонецПроцедуры

Процедура ТабличноеПолеПриПолученииДанных(Элемент, ОформленияСтрок) Экспорт
	ирКлиент.ТабличноеПолеПриПолученииДанныхЛкс(ЭтаФорма, Элемент, ОформленияСтрок);
КонецПроцедуры

Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник) Экспорт
	ирКлиент.Форма_ОбработкаОповещенияЛкс(ЭтаФорма, ИмяСобытия, Параметр, Источник);
КонецПроцедуры

// Предопределеный метод механизма фоновых операций
Процедура ПроверкаЗавершенияФоновыхЗаданий() Экспорт
	ирКлиент.ПроверитьЗавершениеФоновыхЗаданийФормыЛкс(ЭтаФорма);
КонецПроцедуры

Процедура СлужебноеПолеХТМЛonclick(Элемент, pEvtObj) Экспорт
	ТелоОтвета = мФоновыйЗапросХттп.ПрочитатьЧастьОтвета();
	ЧислоОтправленныхВПорции = 0;
	ОбработатьОтветНапарника(ТелоОтвета,,,, мФоновыйЗапросХттп, ЧислоОтправленныхВПорции);
	ЭтаФорма.ЧислоОтправленных = ЧислоОтправленных + ЧислоОтправленныхВПорции;
КонецПроцедуры

Процедура СлужебноеПолеХТМЛДокументСформирован(Элемент)
	СинхронизоватьВФорме();
КонецПроцедуры

ирКлиент.ИнициироватьФормуЛкс(ЭтаФорма, "Обработка.ирКлсПолеТекстаПрограммы.Форма.ОтправкаМетаданныхНапарнику");
Если мПлатформа = Неопределено Тогда
	ИнициироватьНеинтерактивно();
КонецЕсли;
