&НаКлиенте
Процедура КонсольКода(Команда)
	
	#Если ТонкийКлиент Или ВебКлиент Тогда
		Сообщить("Команда доступна только в толстом клиенте");
		Возврат;
	#Иначе
		ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
		Если ТекущаяСтрока = Неопределено Тогда
			Возврат;
		КонецЕсли; 
		Справочники[ирОбщий.ОтделитьРазделителемЛкс(Список.ОсновнаяТаблица)].ОткрытьКонсольКодаДляАлгоритма(ТекущаяСтрока.Ссылка);
	#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура НастройкиВыполненияАлгоритмов(Команда)
	
	ирОбщий.ОткрытьНастройкиАлгоритмовЛкс();
	
КонецПроцедуры
