
Процедура ОсновныеДействияФормыОК(Кнопка)
	
	Результат = Новый Структура;
	Если ВариантИнтерфейсаКлиентскогоПриложенияУстановить Тогда
		Результат.Вставить("ВариантИнтерфейсаКлиентскогоПриложения", Вычислить("ВариантИнтерфейсаКлиентскогоПриложения." + ВариантИнтерфейсаКлиентскогоПриложенияЗначение));
	КонецЕсли;
	Если ВариантМасштабаФормКлиентскогоПриложенияУстановить Тогда
		Результат.Вставить("ВариантМасштабаФормКлиентскогоПриложения", Вычислить("ВариантМасштабаФормКлиентскогоПриложения." + ВариантМасштабаФормКлиентскогоПриложенияЗначение));
	КонецЕсли;
	Если РежимОткрытияФормПриложенияУстановить Тогда
		Результат.Вставить("РежимОткрытияФормПриложения", Вычислить("РежимОткрытияФормПриложения." + РежимОткрытияФормПриложенияЗначение));
	КонецЕсли; 
	Если ОтображатьПанелиНавигацииИДействийУстановить Тогда
		Результат.Вставить("ОтображатьПанелиНавигацииИДействий", ОтображатьПанелиНавигацииИДействийЗначение);
	КонецЕсли; 
	Если ОтображатьПанельРазделовУстановить Тогда
		Результат.Вставить("ОтображатьПанельРазделов", ОтображатьПанельРазделовЗначение);
	КонецЕсли; 
	Закрыть(Результат);
	
КонецПроцедуры

Процедура ОбновитьДоступность()
	
	ЭлементыФормы.ВариантИнтерфейсаКлиентскогоПриложенияТакси.Доступность = ВариантИнтерфейсаКлиентскогоПриложенияУстановить;
	ЭлементыФормы.ВариантИнтерфейсаКлиентскогоПриложенияВерсия8_2.Доступность = ВариантИнтерфейсаКлиентскогоПриложенияУстановить;
	ЭлементыФормы.ВариантМасштабаФормКлиентскогоПриложенияАвто.Доступность = ВариантМасштабаФормКлиентскогоПриложенияУстановить;
	ЭлементыФормы.ВариантМасштабаФормКлиентскогоПриложенияКомпактный.Доступность = ВариантМасштабаФормКлиентскогоПриложенияУстановить;
	ЭлементыФормы.ВариантМасштабаФормКлиентскогоПриложенияОбычный.Доступность = ВариантМасштабаФормКлиентскогоПриложенияУстановить;
	ЭлементыФормы.РежимОткрытияФормПриложенияОтдельныеОкна.Доступность = РежимОткрытияФормПриложенияУстановить;
	ЭлементыФормы.РежимОткрытияФормПриложенияЗакладки.Доступность = РежимОткрытияФормПриложенияУстановить;
	ЭлементыФормы.ОтображатьПанелиНавигацииИДействийЗначение.Доступность = ОтображатьПанелиНавигацииИДействийУстановить;
	ЭлементыФормы.ОтображатьПанельРазделовЗначение.Доступность = ОтображатьПанельРазделовУстановить;
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	ОбновитьДоступность();
	
КонецПроцедуры

Процедура ПриИзмененииФлажка(Элемент)
	ОбновитьДоступность();
КонецПроцедуры

ЭтаФорма.ВариантИнтерфейсаКлиентскогоПриложенияЗначение = "Такси";
ЭтаФорма.ВариантМасштабаФормКлиентскогоПриложенияЗначение = "Авто";
ЭтаФорма.РежимОткрытияФормПриложенияЗначение = "ОтдельныеОкна";
ЭтаФорма.ОтображатьПанелиНавигацииИДействийЗначение = Истина;
ЭтаФорма.ОтображатьПанельРазделовЗначение = Истина;
