////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ, ВЫЗЫВАЕМЫЕ ИЗ ОБРАБОТЧИКОВ ЭЛЕМЕНТОВ ФОРМЫ

// Инициализация формы
//
Процедура ПриОткрытии()
	
	ЗаполнитьСписокВыбораШаблона(ЭлементыФормы.ПолеВыбораСписокШаблонов.Значение, Ложь);
	ЭтотОбъект.УстанавливатьОсновныеКаталоги = Истина;
	Если НачальноеЗначениеВыбора <> Неопределено Тогда
		ЭлементСписка = ПолеВыбораСписокШаблонов.НайтиПоЗначению(НачальноеЗначениеВыбора.Значение);
		Если ЭлементСписка <> Неопределено Тогда
			ЭлементыФормы.ПолеВыбораСписокШаблонов.ТекущаяСтрока = ЭлементСписка;
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

Процедура КнопкаОКНажатие(Элемент)
	
	ЭтаФорма.Закрыть(ЭлементыФормы.ПолеВыбораСписокШаблонов.ТекущаяСтрока);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ПОЛЯ СПИСКА

Процедура ПолеВыбораСписокШаблоновПриАктивизацииСтроки(Элемент)
	
	ИмяШаблона = Элемент.ТекущаяСтрока.Значение;
	ЭтаФорма.ОписаниеШаблона = ПолучитьОписаниеШаблона(ИмяШаблона);
	СодержимоеФайла = ПолучитьСодержимоеФайлаШаблона(ИмяШаблона);
	ЭтаФорма.ЭлементыФормы.СодержимоеФайла.УстановитьТекст(СодержимоеФайла);
	//Если СписокСтандартныхШаблонов.НайтиПоЗначению(ИмяШаблона) = Неопределено Тогда
	//	ИспользоватьПутиИзШаблона = Ложь;
	//Иначе
	//	ИспользоватьПутиИзШаблона = Истина;
	//КонецЕсли;
	ЭлементыФормы.КоманднаяПанельСписка.Кнопки.Удалить.Доступность = Не Элемент.ТекущаяСтрока.Пометка;
	
	
КонецПроцедуры

Процедура ПолеВыбораСписокШаблоновВыбор(Элемент, ЭлементСписка)
	
	ЭтаФорма.Закрыть(ЭлементСписка);
	
КонецПроцедуры

Процедура ДействияФормыЗагрузитьИзФайла(Кнопка)
	
	ВыборФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ВыборФайла.Фильтр = ирОбщий.ПолучитьСтрокуФильтраДляВыбораФайлаЛкс("xml", "Шаблон настройки техножурнала");
	Если Не ВыборФайла.Выбрать() Тогда
		Возврат;
	КонецЕсли;
	ЭтаФорма.Закрыть(ВыборФайла.ПолноеИмяФайла);
	
КонецПроцедуры

Процедура КоманднаяПанельСпискаДействие(Кнопка)
	
	ТекущаяСтрока = ЭлементыФормы.ПолеВыбораСписокШаблонов.ТекущаяСтрока;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	Если ТекущаяСтрока.Пометка Тогда
		Возврат;
	КонецЕсли;
	Ответ = Вопрос("Удалить шаблон """ + ТекущаяСтрока.Представление + """?", РежимДиалогаВопрос.ОКОтмена);
	Если Ответ <> КодВозвратаДиалога.ОК Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьФайлы(ПолучитьДиректориюКонфигурационногоФайла() + "\" + ТекущаяСтрока.Значение + ".prst");
	ПолеВыбораСписокШаблонов.Удалить(ТекущаяСтрока);
	
КонецПроцедуры

ирОбщий.ИнициализироватьФормуЛкс(ЭтаФорма, "Обработка.ирНастройкаТехножурнала.Форма.ВыборШаблона");
