//ирМобильный Перем ирМобильный Экспорт;
//ирМобильный Перем ирОбщий Экспорт;
//ирМобильный Перем ирСервер Экспорт;
//ирМобильный Перем ирКэш Экспорт;
//ирМобильный Перем ирПривилегированный Экспорт;

Процедура КнопкаВыполнитьНажатие(Кнопка)

	Индикатор = ирОбщий.ПолучитьИндикаторПроцессаЛкс(ТаблицаДокументов.Количество(), "Перепроведение");
	ДокументыДляУдаленияИзСписка = Новый Массив;
	Для Каждого Строка Из ТаблицаДокументов Цикл
		ирОбщий.ОбработатьИндикаторЛкс(Индикатор);
		Документ = Строка.Документ;
		ДокументОбъект = Документ.ПолучитьОбъект();
		Успех = Истина;
		Попытка
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Успех = Ложь;
			Если ОстанавливатьсяПоОшибке Тогда
				ВызватьИсключение;
			Иначе
				ОписаниеОшибки = ИнформацияОбОшибке().Описание;
				Сообщить("Ошибка перепроведения " + ДокументОбъект + ": " + ОписаниеОшибки, СтатусСообщения.Важное);
			КонецЕсли;
		КонецПопытки; 
		Если Успех Тогда
			Сообщить("Перепроведен " + ДокументОбъект);
		КонецЕсли;
		ДокументыДляУдаленияИзСписка.Добавить(Документ);
	КонецЦикла;
	ирОбщий.ОсвободитьИндикаторПроцессаЛкс();
	Для Каждого Документ Из ДокументыДляУдаленияИзСписка Цикл
		Строка = ТаблицаДокументов.Найти(Документ, "Документ");
		ТаблицаДокументов.Удалить(Строка);
	КонецЦикла; 
	
КонецПроцедуры

//ирМобильный #Если Клиент Тогда
//ирМобильный Контейнер = Новый Структура();
//ирМобильный Оповестить("ирПолучитьБазовуюФорму", Контейнер);
//ирМобильный Если Не Контейнер.Свойство("ирМобильный", ирМобильный) Тогда
//ирМобильный 	ПолноеИмяФайлаБазовогоМодуля = ВосстановитьЗначение("ирПолноеИмяФайлаОсновногоМодуля");
//ирМобильный 	ирМобильный = ВнешниеОбработки.ПолучитьФорму(ПолноеИмяФайлаБазовогоМодуля);
//ирМобильный КонецЕсли; 
//ирМобильный ирОбщий = ирМобильный.ПолучитьОбщийМодульЛкс("ирОбщий");
//ирМобильный ирКэш = ирМобильный.ПолучитьОбщийМодульЛкс("ирКэш");
//ирМобильный ирСервер = ирМобильный.ПолучитьОбщийМодульЛкс("ирСервер");
//ирМобильный ирПривилегированный = ирМобильный.ПолучитьОбщийМодульЛкс("ирПривилегированный");
//ирМобильный #КонецЕсли

ирОбщий.ИнициализироватьФормуЛкс(ЭтаФорма, "Обработка.ирПоискДублейИЗаменаСсылок.Форма.ФормаПерепроведенияДокументов");
