
// Обработчик выбора строки в дереве
//
Процедура ДеревоЗапросовВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	РодительСтроки = ВыбраннаяСтрока;
	Пока РодительСтроки <> НеОпределено Цикл

		Если РодительСтроки = ТекущаяСтрокаВладельца Тогда
			Предупреждение("Нельзя выбирать в качестве копируемой строки саму строку
			               |или подчиненные ей строки. Выберите другую строку.");
			Возврат;
		КонецЕсли;

		РодительСтроки = РодительСтроки.Родитель;

	КонецЦикла;

	ОповеститьОВыборе(ЭлементыФормы.ДеревоЗапросов.ТекущаяСтрока);

КонецПроцедуры // ДеревоЗапросовВыбор()

// Обработчик нажатия кнопки переноса на верхний уровень
//
Процедура КнопкаНаВерхнийУровеньНажатие(Элемент)

	ОповеститьОВыборе(ВладелецФормы.ДеревоЗапросов);

КонецПроцедуры // КнопкаНаВерхнийУровеньНажатие()





