
Процедура ОсновныеДействияФормыОсновныеДействияФормыОК(Кнопка)
	
	ирОбщий.СохранитьЗначениеЛкс("ИсполняемыйФайлRegexBuddy", ЭтаФорма.ИсполняемыйФайлRegexBuddy);
	Закрыть();
	
КонецПроцедуры

Процедура ИсполняемыйФайлRegexBuddyНачалоВыбора(Элемент, СтандартнаяОбработка)
	
	РезультатВыбора = ирОбщий.ВыбратьФайлЛкс(, "exe", "Исполняемый файл", ЭтаФорма.ИсполняемыйФайлRegexBuddy);
	Если РезультатВыбора <> Неопределено Тогда
		ирОбщий.ИнтерактивноЗаписатьВПолеВводаЛкс(ЭлементыФормы.ИсполняемыйФайлRegexBuddy, РезультатВыбора);
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	ЭтаФорма.ИсполняемыйФайлRegexBuddy = ирОбщий.ВосстановитьЗначениеЛкс("ИсполняемыйФайлRegexBuddy");
	
КонецПроцедуры
