//ирМобильный Перем ирМобильный Экспорт;
//ирМобильный Перем ирОбщий Экспорт;
//ирМобильный Перем ирСервер Экспорт;
//ирМобильный Перем ирКэш Экспорт;
//ирМобильный Перем ирПривилегированный Экспорт;
#Если Клиент Тогда	
	
// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  – <Тип.Вид> – <описание параметра>
//                 <продолжение описания параметра>;
//  <Параметр2>  – <Тип.Вид> – <описание параметра>
//                 <продолжение описания параметра>.
//
Процедура ВосстановитьСписокИнтерфейсов() Экспорт

	лСписокИнтерфейсов = ВосстановитьЗначение("СписокИнтерфейсов");
	Если лСписокИнтерфейсов <> Неопределено Тогда
		СписокИнтерфейсов = лСписокИнтерфейсов;
	КонецЕсли;
	ОбновитьСписокИнтерфейсов();

КонецПроцедуры // ВосстановитьСписокИнтерфейсов()

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  – <Тип.Вид> – <описание параметра>
//                 <продолжение описания параметра>;
//  <Параметр2>  – <Тип.Вид> – <описание параметра>
//                 <продолжение описания параметра>.
//
Процедура СохранитьСписокИнтерфейсов() Экспорт

	СохранитьЗначение("СписокИнтерфейсов", СписокИнтерфейсов);

КонецПроцедуры // СохранитьСписокИнтерфейсов()

Процедура ОбновитьСписокИнтерфейсов() Экспорт
	
	МассивСтарых = Новый Массив;
	Для Каждого ИнтерфейсСписка Из СписокИнтерфейсов Цикл
		Если Метаданные.Интерфейсы.Найти(ИнтерфейсСписка.Значение) = Неопределено Тогда 
			МассивСтарых.Добавить(ИнтерфейсСписка);
		КонецЕсли;
	КонецЦикла;
	Для Каждого СтарыйИнтерфейс Из МассивСтарых Цикл
		СписокИнтерфейсов.Удалить(СтарыйИнтерфейс);
	КонецЦикла;

	Для каждого Интерфейс Из Метаданные.Интерфейсы Цикл
		ЭлементСписка = СписокИнтерфейсов.НайтиПоЗначению(Интерфейс.Имя);
		Если Не ПравоДоступа("Использование", Интерфейс) Тогда 
			Продолжить;
		КонецЕсли; 
		Если ЭлементСписка = Неопределено Тогда
			ЭлементСписка = СписокИнтерфейсов.Добавить(Интерфейс.Имя, Интерфейс.Синоним, ГлавныйИнтерфейс[Интерфейс.Имя].Видимость);
		КонецЕсли;
		Если ЭлементСписка <> Неопределено Тогда
			Если Интерфейс.Переключаемый Тогда 
				ЭлементСписка.Представление = "Переключаемый - " + Интерфейс.Представление();
			Иначе
				ЭлементСписка.Представление = "Общий - "  + Интерфейс.Представление();
			КонецЕсли;
		КонецЕсли;
		ЭлементИнтерфейса = ГлавныйИнтерфейс.Найти(Интерфейс.Имя);
		ЭлементСписка.Пометка = ЭлементИнтерфейса.Видимость;
	КонецЦикла;
	
	СписокИнтерфейсов.СортироватьПоПредставлению();
	
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  – <Тип.Вид> – <описание параметра>
//                 <продолжение описания параметра>;
//  <Параметр2>  – <Тип.Вид> – <описание параметра>
//                 <продолжение описания параметра>.
//
Процедура ДобавитьИнтерфейс(ИмяИнтерфейса) Экспорт

	ЭлементИнтерфейса = СписокИнтерфейсов.НайтиПоЗначению(ИмяИнтерфейса);
	Если ЭлементИнтерфейса <> Неопределено Тогда
		ЭлементИнтерфейса.Пометка = Истина;
	КонецЕсли;

КонецПроцедуры // ДобавитьИнтерфейс()

Процедура ВыполнитьПереключениеИнтерфейсов() Экспорт
	
	СтрокаИменИнтерфейсов = "";
	
	Для каждого СтрокаСписка Из СписокИнтерфейсов Цикл
		
		Если СтрокаСписка.Пометка Тогда;
			СтрокаИменИнтерфейсов = СтрокаИменИнтерфейсов + ?(СтрокаИменИнтерфейсов = "", "", ",") + СтрокаСписка.Значение;
		КонецЕсли;
		
	КонецЦикла;
	
	ГлавныйИнтерфейс.ПереключитьИнтерфейс(СтрокаИменИнтерфейсов);
	
КонецПроцедуры

//ирМобильный #Если Клиент Тогда
//ирМобильный Контейнер = Новый Структура();
//ирМобильный Оповестить("ирПолучитьБазовуюФорму", Контейнер);
//ирМобильный Если Не Контейнер.Свойство("ирМобильный", ирМобильный) Тогда
//ирМобильный 	ПолноеИмяФайлаБазовогоМодуля = ВосстановитьЗначение("ирПолноеИмяФайлаОсновногоМодуля");
//ирМобильный 	ирМобильный = ВнешниеОбработки.ПолучитьФорму(ПолноеИмяФайлаБазовогоМодуля);
//ирМобильный КонецЕсли; 
//ирМобильный ирОбщий = ирМобильный.ПолучитьОбщийМодульЛкс("ирОбщий");
//ирМобильный ирКэш = ирМобильный.ПолучитьОбщийМодульЛкс("ирКэш");
//ирМобильный ирСервер = ирМобильный.ПолучитьОбщийМодульЛкс("ирСервер");
//ирМобильный ирПривилегированный = ирМобильный.ПолучитьОбщийМодульЛкс("ирПривилегированный");
//ирМобильный #КонецЕсли

ВосстановитьСписокИнтерфейсов();

#КонецЕсли

