Функция СохраняемаяНастройкаФормы(выхНаименование, выхИменаСвойств) Экспорт 
	выхИменаСвойств = "Форма.Список";
	Возврат Неопределено;
КонецФункции

Процедура ПриОткрытии()
	
	ирОбщий.Форма_ПриОткрытииЛкс(ЭтаФорма);
	ирОбщий.СоздатьМенеджерСохраненияНастроекФормыЛкс(ЭтаФорма);

КонецПроцедуры

Процедура КлсКомандаНажатие(Кнопка) Экспорт 
	
	ирОбщий.УниверсальнаяКомандаФормыЛкс(ЭтаФорма, Кнопка);
	
КонецПроцедуры

Процедура ВнешнееСобытие(Источник, Событие, Данные) Экспорт
	
	ирОбщий.Форма_ВнешнееСобытиеЛкс(ЭтаФорма, Источник, Событие, Данные);

КонецПроцедуры

Процедура ПриЗакрытии()
	ирОбщий.Форма_ПриЗакрытииЛкс(ЭтаФорма);
КонецПроцедуры

Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник) Экспорт
	
	ирОбщий.Форма_ОбработкаОповещенияЛкс(ЭтаФорма, ИмяСобытия, Параметр, Источник); 

КонецПроцедуры

Процедура ОсновныеДействияФормыОтключить(Кнопка)
	
	Если Список.Количество() = 0 Тогда
		ЗаполнитьСписок();
	КонецЕсли; 
	Для Каждого СтрокаМетода Из Список Цикл
		ОтключитьОбработчикОжидания(СтрокаМетода.Значение);
	КонецЦикла;
	Закрыть();
	ирОбщий.СообщитьЛкс(ирОбщий.СтрШаблонИменЛкс("Отключено %1 возможных глобальных обработчиков ожидания",, Список.Количество()),,,, Ложь);
	
КонецПроцедуры

Процедура ОсновныеДействияФормыЗаполнить(Кнопка)
	
	ЗаполнитьСписок();
	
КонецПроцедуры

Процедура ЗаполнитьСписок()
	
	Форма = ирОбщий.ПолучитьФормуЛкс("Обработка.ирКлсПолеТекстаПрограммы.Форма.ОбщиеМетоды",,, "Программно");
	Форма.ПерезаполнитьТаблицуВсехМетодов(Истина);
	Компоновщик = Форма.Компоновщик;
	ирОбщий.НайтиДобавитьЭлементНастроекКомпоновкиПоПолюЛкс(Компоновщик.Настройки.Порядок, "Имя");
	ирОбщий.НайтиДобавитьЭлементОтбораКомпоновкиЛкс(Компоновщик.Настройки.Отбор, "КоличествоПараметров", 0, ВидСравненияКомпоновкиДанных.Равно);
	ирОбщий.НайтиДобавитьЭлементОтбораКомпоновкиЛкс(Компоновщик.Настройки.Отбор, "Глобальный", Истина);
	Форма.ОбновитьДанные();
	Список.ЗагрузитьЗначения(ирОбщий.РазличныеЗначенияКолонкиТаблицыЛкс(Форма.ОбщиеМетоды, "Имя"));

КонецПроцедуры

Процедура СписокНачалоВыбора(Элемент, СтандартнаяОбработка)
	
	ирОбщий.ПолеВводаРасширенногоЗначения_НачалоВыбораЛкс(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ОсновныеДействияФормыКэшМодулей(Кнопка)
	
	Форма = ирОбщий.ПолучитьФормуЛкс("Обработка.ирКлсПолеТекстаПрограммы.Форма.ФормаНастройки");
	Форма.Открыть();
	
КонецПроцедуры

ирОбщий.ИнициироватьФормуЛкс(ЭтаФорма, "Обработка.ирПлатформа.Форма.ГлобальныеОбработчикиОжидания");
