&НаКлиенте
Процедура КонсольКода(Команда = Неопределено)
	
	#Если ВебКлиент Или МобильныйКлиент Тогда
		Сообщить("Команда недоступна в этом клиенте");
	#ИначеЕсли ТонкийКлиент Тогда
		ОткрытьФорму("Обработка.ирПортативный.Форма.ЗапускСеансаУправляемая");
	#Иначе
		ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
		Если ТекущаяСтрока = Неопределено Тогда
			Возврат;
		КонецЕсли;  
		Справочники.ирАлгоритмы.ОткрытьКонсольКодаДляАлгоритма(ТекущаяСтрока); 
	#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура НастройкиВыполненияАлгоритмов(Команда)
	
	ирКлиент.ОткрытьНастройкиАлгоритмовЛкс();
	
КонецПроцедуры

