Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	Если ВладелецФормы = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	Отказ = Истина;
	ФормаОбработки = ирКлиент.ПолучитьФормуЛкс("Обработка.ирПоискДублейИЗаменаСсылок.Форма");
	КопияСтрокиДляОбработки = СтрокиДляОбработки.Скопировать(Новый Структура(мИмяКолонкиПометки, Истина));
	Объекты = КопияСтрокиДляОбработки.ВыгрузитьКолонку("Ссылка");
	ФормаОбработки.ОткрытьДляЗаменыПоСпискуСсылок(Объекты);

КонецПроцедуры

ирКлиент.ИнициироватьФормуЛкс(ЭтаФорма, "Обработка.ирПодборИОбработкаОбъектов.Форма.ЗаменитьСсылкиНаОбъекты");
