Процедура КнопкаВыполнитьНажатие(Кнопка)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ЗагрузитьСхемуНажатие(Элемент)
	
	ВыборФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ВыборФайла.Фильтр = "(*.zip)|*.zip";
	Если Не ВыборФайла.Выбрать() Тогда
		Возврат;
	КонецЕсли;   
	НоваяСхема = Неопределено;
	Попытка
		ЧтениеZip = Новый ЧтениеZipФайла(ВыборФайла.ПолноеИмяФайла);
		ЧтениеZip.Извлечь(ЧтениеZip.Элементы[0], КаталогВременныхФайлов());
		ИмяВременногоФайла = КаталогВременныхФайлов() + "\" + ЧтениеZip.Элементы[0].Имя;
		Чтение = Новый ЧтениеXML;
		Чтение.ОткрытьФайл(ИмяВременногоФайла);
		Структура = СериализаторXDTO.ПрочитатьXML(Чтение);
		Чтение.Закрыть();
		УдалитьФайлы(ИмяВременногоФайла);
		Если Структура.Свойство("SDBL") И Структура.Свойство("СУБД") Тогда
			НоваяСхема = Структура;
		КонецЕсли; 
	Исключение
		Сообщить(ОписаниеОшибки(), СтатусСообщения.Внимание);
	КонецПопытки;
	Если НоваяСхема = Неопределено Тогда
		Сообщить("Неверный формат файла", СтатусСообщения.Внимание);
	Иначе
		УстановитьНовуюСхему(НоваяСхема);
	КонецЕсли; 
	
КонецПроцедуры

Процедура ОбновитьДоступность()
	
	мПлатформа = ирКэш.Получить();
	ЭтаФорма.ИспользоватьЧужуюСхему = мПлатформа.ЧужаяСхемаБД <> Неопределено;
	ЭлементыФормы.ИспользоватьЧужуюСхему.Доступность = ИспользоватьЧужуюСхему;
	Если мПлатформа.ЧужаяСхемаБД <> Неопределено Тогда
		ЭтаФорма.СтрокаСоединенияБазы = мПлатформа.ЧужаяСхемаБД.СтрокаСоединения;
	КонецЕсли; 
	
КонецПроцедуры

Процедура ИспользоватьЧужуюСхемуПриИзменении(Элемент)
	
	УстановитьНовуюСхему(Неопределено);
	
КонецПроцедуры

Процедура УстановитьНовуюСхему(НоваяСхема)
	
	ирКэш.Получить().ЧужаяСхемаБД = НоваяСхема;
	Если НоваяСхема = Неопределено Тогда
		ЭтаФорма.СтрокаСоединенияБазы = Неопределено;
		ирОбщий.ОбновитьПовторноИспользуемыеЗначенияЛкс();
	Иначе
		ЭтаФорма.СтрокаСоединенияБазы = НоваяСхема.СтрокаСоединения;
	КонецЕсли; 
	ВыбранныеСтроки = ТаблицаЖурнала.НайтиСтроки(Новый Структура("СвойстваСИменамиМетаданныхАктуальны", Истина));
	Для Каждого ВыбраннаяСтрока Из ВыбранныеСтроки Цикл
		ВыбраннаяСтрока.СвойстваСИменамиМетаданныхАктуальны = Ложь;
	КонецЦикла;
	ОбновитьДоступность();
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	ОбновитьДоступность();
	
КонецПроцедуры

Процедура СохранитьВФайлНажатие(Элемент)
	
	ВыборФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Если Не ВыборФайла.Выбрать() Тогда
		Возврат;
	КонецЕсли;
	ИмяФайла = ВыборФайла.Каталог + "\Сохранение схемы БД в файл.epf";
	ПолучитьМакет("ОбработкаВыгрузкиСхемыБД").Записать(ИмяФайла);
	Сообщить("Обработка сохранена в файл """ + ИмяФайла + """");
	
КонецПроцедуры
