
Процедура ОсновныеДействияФормыОК(Кнопка)
	
	НовоеЗначение = ПолучитьРезультат();
	ирКлиент.ПрименитьИзмененияИЗакрытьФормуЛкс(ЭтаФорма, НовоеЗначение);
	
КонецПроцедуры

Функция ПолучитьРезультат()
	
	Возврат ЭлементыФормы.ПолеКартинки.Картинка;

КонецФункции

Процедура ПриОткрытии()
	
	ирКлиент.Форма_ПриОткрытииЛкс(ЭтаФорма);
	Если ТипЗнч(НачальноеЗначениеВыбора) <> Тип("Картинка") Тогда
		НачальноеЗначениеВыбора = Новый Картинка;
	КонецЕсли; 
	ирКлиент.ФормаОбъекта_ОбновитьЗаголовокЛкс(ЭтаФорма);
	ЭлементыФормы.ПолеКартинки.Картинка = НачальноеЗначениеВыбора;
	ЗначениеПриИзменении();

КонецПроцедуры

Процедура ОсновныеДействияФормыИсследовать(Кнопка)
	
	ирОбщий.ИсследоватьЛкс(ПолучитьРезультат());
	
КонецПроцедуры

Процедура КлсКомандаНажатие(Кнопка) Экспорт 
	
	ирКлиент.УниверсальнаяКомандаФормыЛкс(ЭтаФорма, Кнопка);
	
КонецПроцедуры

Процедура ОбработчикОжиданияСПараметрамиЛкс() Экспорт 
	
	ирКлиент.ОбработчикОжиданияСПараметрамиЛкс();

КонецПроцедуры

Процедура ЗначениеПриИзменении(Элемент = Неопределено)
	
	ЭтаФорма.Вид = ЭлементыФормы.ПолеКартинки.Картинка.Вид;
	ОбновитьРазмер();
	
КонецПроцедуры

Процедура ОбновитьРазмер()
	
	ЭтаФорма.Размер = ирОбщий.РазмерЗначенияЛкс(ЭлементыФормы.ПолеКартинки.Картинка);

КонецПроцедуры

Процедура ВыгрузитьВФайлНажатие(Элемент)
	
	ПолноеИмяФайла = ирКлиент.ВыбратьФайлЛкс(Ложь);
	Если ЗначениеЗаполнено(ПолноеИмяФайла) Тогда
		ЭлементыФормы.ПолеКартинки.Картинка.Записать(ПолноеИмяФайла);
	КонецЕсли; 
	
КонецПроцедуры

Процедура ЗагрузитьИзФайлаНажатие(Элемент)
	
	ПолноеИмяФайла = ирКлиент.ВыбратьФайлЛкс(Истина);
	Если ЗначениеЗаполнено(ПолноеИмяФайла) Тогда
		ЭлементыФормы.ПолеКартинки.Картинка = Новый Картинка(ПолноеИмяФайла);
	КонецЕсли; 
	ЗначениеПриИзменении();
	
КонецПроцедуры

Процедура ВнешнееСобытие(Источник, Событие, Данные) Экспорт
	
	ирКлиент.Форма_ВнешнееСобытиеЛкс(ЭтаФорма, Источник, Событие, Данные);

КонецПроцедуры

Процедура ТабличноеПолеПриПолученииДанных(Элемент, ОформленияСтрок) Экспорт 
	
	ирКлиент.ТабличноеПолеПриПолученииДанныхЛкс(ЭтаФорма, Элемент, ОформленияСтрок);

КонецПроцедуры

Процедура ПриЗакрытии()
	ирКлиент.Форма_ПриЗакрытииЛкс(ЭтаФорма);
КонецПроцедуры

ирКлиент.ИнициироватьФормуЛкс(ЭтаФорма, "Обработка.ирПлатформа.Форма.Картинка");

