// Используется недокументированная особенность (скорее всего ошибка) платформы - 
// глобальная непараметризованная команда формы по горячей клавише сработавает во всех формах, открытых без блокирования других форм

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	#Если ВебКлиент Тогда
		Сообщить("Команда недоступна в вебклиенте");
	#ИначеЕсли ТонкийКлиент Тогда
		ОткрытьФорму("Обработка.ирПортативный.Форма.ФормаУправляемая");
	#Иначе
		ПараметрКоманды = ПолучитьТекущуюСсылкуОбъекта();
		Если Не ЗначениеЗаполнено(ПараметрКоманды) Тогда
			Возврат;
		КонецЕсли; 
		ирОбщий.ОткрытьСсылкуВРедактореОбъектаБДЛкс(ПараметрКоманды);
	#КонецЕсли 
	
КонецПроцедуры

&НаКлиенте 
Функция ПолучитьТекущуюСсылкуОбъекта()
	
	ТекущееОкно = АктивноеОкно();
	Если ТипЗнч(ТекущееОкно) = Тип("ОкноКлиентскогоПриложения") Тогда
		ТекущаяФорма = ТекущееОкно.ПолучитьСодержимое();
		Если ТипЗнч(ТекущаяФорма) = Тип("УправляемаяФорма") Тогда
			Если ТипЗнч(ТекущаяФорма.ТекущийЭлемент) = Тип("ТаблицаФормы") Тогда
				Ссылка = ТекущаяФорма.ТекущийЭлемент.ТекущаяСтрока;
				Если ирОбщий.ЛиСсылкаНаОбъектБДЛкс(Ссылка) Тогда
					Возврат Ссылка;
				КонецЕсли; 
				Структура = Новый Структура("Ссылка, Data");
				ТекущиеДанные = ТекущаяФорма.ТекущийЭлемент.ТекущиеДанные;
				Если ТекущиеДанные <> Неопределено Тогда
					ЗаполнитьЗначенияСвойств(Структура, ТекущиеДанные); 
					Ссылка = Структура["Ссылка"];
					Если ирОбщий.ЛиСсылкаНаОбъектБДЛкс(Ссылка) Тогда
						Возврат Ссылка;
					КонецЕсли;
					Ссылка = Структура["Data"];
					Если ирОбщий.ЛиСсылкаНаОбъектБДЛкс(Ссылка) Тогда
						Возврат Ссылка;
					КонецЕсли;
				КонецЕсли; 
			КонецЕсли; 
			Попытка
				Ссылка = ТекущаяФорма.Объект.Ссылка;
			Исключение
				Ссылка = Неопределено;
			КонецПопытки;
			Если ирОбщий.ЛиСсылкаНаОбъектБДЛкс(Ссылка) Тогда
				Возврат Ссылка;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат Неопределено;
	
КонецФункции