Процедура КнопкаОКНажатие(Кнопка)
	
	ирКэш.Получить().СинтаксическийКонтрольПередЗаписью = СинтаксическийКонтрольПередЗаписью;
	ирКэш.Получить().ВыполнятьАлгоритмыЧерезВнешниеОбработки = ВыполнятьАлгоритмыЧерезВнешниеОбработки;
	ирКэш.Получить().ПоказыватьВнешниеИсключенияПриВыполненииАлгоритмов = ПоказыватьВнешниеИсключенияПриВыполненииАлгоритмов;
	ирКэш.Получить().ФиксироватьВнешниеИсключенияАлгоритмов = ФиксироватьВнешниеИсключенияАлгоритмов;
	ирКэш.Получить().ФайловыйКэшАлгоритмовДопускаетРедактирование = ФайловыйКэшАлгоритмовДопускаетРедактирование;
	ирКэш.Получить().ПроверитьСтруктуруФайловогоКэша();
	ирКэш.Получить().СохранитьНастройкиАлгоритмов();
	Закрыть();
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	КаталогДинамическихВнешнихОбработок = ирКэш.Получить().ПапкаКешаВнешнихОбработокАлгоритмов.ПолноеИмя;
	ФайловыйКэшАлгоритмовДопускаетРедактирование = ирКэш.Получить().ФайловыйКэшАлгоритмовДопускаетРедактирование;
	СинтаксическийКонтрольПередЗаписью = ирКэш.Получить().СинтаксическийКонтрольПередЗаписью;
	ВыполнятьАлгоритмыЧерезВнешниеОбработки = ирКэш.Получить().ВыполнятьАлгоритмыЧерезВнешниеОбработки;
	ПоказыватьВнешниеИсключенияПриВыполненииАлгоритмов = ирКэш.Получить().ПоказыватьВнешниеИсключенияПриВыполненииАлгоритмов;
	ФиксироватьВнешниеИсключенияАлгоритмов = ирКэш.Получить().ФиксироватьВнешниеИсключенияАлгоритмов;
	ФиксироватьВнешниеИсключенияАлгоритмовПриИзменении(ЭлементыФормы.ФиксироватьВнешниеИсключенияАлгоритмов);
	
КонецПроцедуры

Процедура КаталогДинамическихВнешнихОбработокОткрытие(Элемент, СтандартнаяОбработка)
	
	ЗапуститьПриложение(Элемент.Значение);
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

Процедура ОчиститьНажатие(Элемент)
	
	ирКэш.Получить().ОчиститьКешАлгоритмов(Истина);
	
КонецПроцедуры

Процедура ФиксироватьВнешниеИсключенияАлгоритмовПриИзменении(Элемент)
	
	ЭлементыФормы.ПоказыватьВнешниеИсключенияПриВыполненииАлгоритмов.Доступность = Элемент.Значение;
	
КонецПроцедуры

Процедура ВыполнятьАлгоритмыЧерезВнешниеОбработкиПриИзменении(Элемент)

	ЭлементыФормы.ФайловыйКэшАлгоритмовДопускаетРедактирование.Доступность = Элемент.Значение;
	
КонецПроцедуры

Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник) Экспорт
	
	ирКлиент.Форма_ОбработкаОповещенияЛкс(ЭтаФорма, ИмяСобытия, Параметр, Источник); 
	
КонецПроцедуры

Процедура ВнешнееСобытие(Источник, Событие, Данные) Экспорт
	
	ирКлиент.Форма_ВнешнееСобытиеЛкс(ЭтаФорма, Источник, Событие, Данные);

КонецПроцедуры

Процедура ТабличноеПолеПриПолученииДанных(Элемент, ОформленияСтрок) Экспорт 
	
	ирКлиент.ТабличноеПолеПриПолученииДанныхЛкс(ЭтаФорма, Элемент, ОформленияСтрок);

КонецПроцедуры

ирКлиент.ИнициироватьФормуЛкс(ЭтаФорма, "Обработка.ирПлатформа.Форма.НастройкиАлгоритмов");
