Перем ирПерехватКлавиатуры Экспорт;

Процедура ирПриНачалеРаботыСистемы()
	
	Если ирСервер.ПриНачалеРаботыСистемыРасширениеЛкс(ПараметрЗапуска) Тогда 
		ЗавершитьРаботуСистемы(Ложь, Истина);
	Иначе
	#Если Не ТонкийКлиент И Не ВебКлиент И Не МобильныйКлиент Тогда
		ОткрытьОднократноАдаптациюРасширенияЛкс(ирПерехватКлавиатуры);
	#КонецЕсли 
	КонецЕсли; 

КонецПроцедуры

Процедура ирОбработкаВнешнегоСобытия(Источник, Событие, Данные)
	
	ирОбщий.ВнешнееСобытиеЛкс(Источник, Событие, Данные);
	
КонецПроцедуры

