
Функция СохраняемаяНастройкаФормы(выхНаименование, выхИменаСвойств) Экспорт 
	выхИменаСвойств = "Форма.ТипыПараметров, Форма.КомментарииПараметров, Форма.КомментарииВКоде, Форма.ЗаменятьИмяМетода, Форма.ЗаменятьТипыПараметров, Форма.ЗаменятьКомментарииПараметров, Форма.КомментарийМетода, Форма.ЗаменятьКомментарийМетода, Форма.ЗаменятьКомментарииВКоде, Форма.ЗаменятьТелоМетода";
	Возврат Неопределено;
КонецФункции

Процедура ЗагрузитьНастройкуВФорме(НастройкаФормы, ДопПараметры) Экспорт 
	ирКлиент.ЗагрузитьНастройкуФормыЛкс(ЭтаФорма, НастройкаФормы); 
	ОбновитьДоступность();
КонецПроцедуры

Процедура ОсновныеДействияФормыОК(Кнопка = Неопределено)
	Результат = Новый Структура("ТипыПараметров, КомментарииПараметров, КомментарииВКоде, ЗаменятьИмяМетода, ЗаменятьТипыПараметров, ЗаменятьКомментарииПараметров, КомментарийМетода, ЗаменятьКомментарийМетода, ЗаменятьКомментарииВКоде, ЗаменятьТелоМетода");
	ЗаполнитьЗначенияСвойств(Результат, ЭтаФорма);
	Закрыть(Результат);
КонецПроцедуры

Процедура ПриОткрытии()
	ирКлиент.СоздатьМенеджерСохраненияНастроекФормыЛкс(ЭтаФорма);
КонецПроцедуры

Процедура ВнешнееСобытие(Источник, Событие, Данные) Экспорт
	
	ирКлиент.Форма_ВнешнееСобытиеЛкс(ЭтаФорма, Источник, Событие, Данные);

КонецПроцедуры

Процедура КлсКомандаНажатие(Кнопка)
	ирКлиент.УниверсальнаяКомандаФормыЛкс(ЭтаФорма, Кнопка);
КонецПроцедуры

Процедура ПриЗакрытии()
	ирКлиент.Форма_ПриЗакрытииЛкс(ЭтаФорма);
КонецПроцедуры

Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник) Экспорт 
	ирКлиент.Форма_ОбработкаОповещенияЛкс(ЭтаФорма, ИмяСобытия, Параметр, Источник);
КонецПроцедуры

Процедура ОбновитьДоступность() Экспорт
	ЭлементыФормы.ЗаменятьКомментарииВКоде.Доступность = КомментарииВКоде;
	ЭлементыФормы.ЗаменятьКомментарииПараметров.Доступность = КомментарииПараметров;
	ЭлементыФормы.ЗаменятьКомментарийМетода.Доступность = КомментарийМетода;
	ЭлементыФормы.ЗаменятьТипыПараметров.Доступность = ТипыПараметров;
КонецПроцедуры

Процедура КомментарийМетодаПриИзменении(Элемент)
	ОбновитьДоступность();
КонецПроцедуры

Процедура ТипыПараметровПриИзменении(Элемент)
	ОбновитьДоступность();
КонецПроцедуры

Процедура КомментарииПараметровПриИзменении(Элемент)
	ОбновитьДоступность();
КонецПроцедуры

Процедура КомментарииВКодеПриИзменении(Элемент)
	ОбновитьДоступность();
КонецПроцедуры

ирКлиент.ИнициироватьФормуЛкс(ЭтаФорма, "Обработка.ирКлсПолеТекстаПрограммы.Форма.ПараметрыЗаполненияМетодаИИ");
КомментарийМетода = Истина;
КомментарииПараметров = Истина;