Перем мПолеТекстаПрограммы Экспорт;
Перем мПолеТекстаХТМЛ;
Перем мФоновыйЗапросХттп;
Перем мНовыйКод; // Строка, Неопределено
Перем мНачальныйМаркерКода;
Перем мКонечныйМаркерКода;
Перем мМаркерПолногоКода;
Перем мНачальныйМаркерПатчей;
Перем мКонечныйМаркерПатчей;
//Перем мНачальныйМаркерЖСОН;
Перем мЧислоЗавершенныхБлоковКода;

Функция СохраняемаяНастройкаФормы(выхНаименование, выхИменаСвойств) Экспорт 
	выхИменаСвойств = "Форма.ТекстЗапроса, Форма.ПередаватьКонтекст, Форма.ВернутьТолькоКод, Форма.РазрешитьДозапросы";
	Возврат Неопределено;
КонецФункции

Процедура ЗагрузитьНастройкуВФорме(НастройкаФормы, ДопПараметры) Экспорт 
	ирКлиент.ЗагрузитьНастройкуФормыЛкс(ЭтаФорма, НастройкаФормы); 
КонецПроцедуры
 
Процедура ПриОткрытии()
	ирКлиент.Форма_ПриОткрытииЛкс(ЭтаФорма);
	мФоновыйЗапросХттп = ирКлиент.НовыйФоновыйЗапросХттпЛкс(ЭтаФорма);
	Если мФоновыйЗапросХттп.мБраузер = Неопределено Тогда
		ирОбщий.СообщитьЛкс("Требуется платформа 8.3.14+");
		Закрыть();
		Возврат;
	КонецЕсли;
	Если мПолеТекстаПрограммы = Неопределено Тогда
		мПолеТекстаПрограммы = ирКэш.ПолеТекстаПрограммы(0);
	КонецЕсли;
	мПолеТекстаХТМЛ = ирКлиент.ОболочкаПоляТекстаЛкс(ЭлементыФормы.Ответ);
	ТекстХТМЛ = ПолучитьМакет("ПросмотрMarkdownHTML").ПолучитьТекст();
	ТекстХТМЛ = СтрЗаменить(ТекстХТМЛ, "%ТекстJS%", ПолучитьМакет("ПросмотрMarkdownКод").ПолучитьТекст()); 
	ЭлементыФормы.Ответ.УстановитьТекст(ТекстХТМЛ);
	Если Истина
		И мПолеТекстаПрограммы.мМетодМодуля <> Неопределено 
		И мПолеТекстаПрограммы.мМетодМодуля.Имя <> "<>"
	Тогда
		ЭтаФорма.ИмяМетода = мПолеТекстаПрограммы.мМетодМодуля.Имя;
	КонецЕсли;
	ЭлементыФормы.ПолеКода.УстановитьТекст(КодЗапроса);
	ЭтаФорма.ИмяМодуля = мПолеТекстаПрограммы.мИмяМодуля;
	Если ПустаяСтрока(КодЗапроса) И ЗначениеЗаполнено(ИмяМетода) Тогда
		ЭлементыФормы.ПанельКонтекст.ТекущаяСтраница = ЭлементыФормы.ПанельКонтекст.Страницы.Метод;
	КонецЕсли;
	ЭлементыФормы.НадписьРазмер.Заголовок = "Размер: " + СтрДлина(мПолеТекстаПрограммы.мОригинальныйТекст) + " символов";
КонецПроцедуры

// Предопределеный метод механизма фоновых операций
Процедура ПроверкаЗавершенияФоновыхЗаданий() Экспорт 
	ирКлиент.ПроверитьЗавершениеФоновыхЗаданийФормыЛкс(ЭтаФорма);
КонецПроцедуры

Процедура СлужебноеПолеХТМЛonclick(Элемент, pEvtObj) Экспорт
	мФоновыйЗапросХттп.ОбработатьОтвет(ЭтаФорма);
КонецПроцедуры

Процедура ДействияФормыОтправить(Кнопка = Неопределено)
	мЧислоЗавершенныхБлоковКода = 0;
	ПорогДлины = 10000;
	ПараметрыЗапроса = Новый Структура("Текст", ТекстЗапроса);
	Если Кнопка <> Неопределено Тогда
		ЭтаФорма.РежимНапарника = "custom";
	КонецЕсли; 
	Кнопка = ЭлементыФормы.ДействияФормы.Кнопки.Отправить;
	Если Кнопка.Картинка <> ирКэш.КартинкаПоИмениЛкс("ирОстановить") Тогда
		ОбновитьКодЗапроса();
		ЭлементыФормы.Ответ.Документ.defaultView._1CAPI.setText("");
		Если ВернутьТолькоКод Тогда
			ПараметрыЗапроса.Текст = ПараметрыЗапроса.Текст + ". Верни только код.";
		КонецЕсли;
		ПараметрыЗапроса.Текст = ПараметрыЗапроса.Текст + ".
		|Всегда отвечай на русском языке.
		|Блоки кода всегда обрамляй маркером (" + мКонечныйМаркерКода + ") на отдельной строке, а блок 1С начинай с маркера (" + СокрП(мНачальныйМаркерКода) + ").";
		Если РазрешитьДозапросы Тогда
			ПараметрыЗапроса.Текст = ПараметрыЗапроса.Текст + "
			|Используй вызовы инструментов для проверки твоих блоков кода.";
		КонецЕсли;
		Если ЗначениеЗаполнено(КодЗапроса) Тогда
			ПараметрыЗапроса.Текст = ПараметрыЗапроса.Текст + "
			|Оригинальный код:
			|" + мКонечныйМаркерКода + КодЗапроса + " 
			|" + мКонечныйМаркерКода + "
			|Не повторяй в ответе оригинальный код целиком.
			|Правки для кода присылай в виде либо полного кода (менее 10000 символов), либо патчей.
			|Если передаешь полный код, то вставь маркер " + мМаркерПолногоКода + " перед его началом. 
			|Если передаешь патчи кода, присылай их после заголовка ""Патчи"" в виде JSON-массива между маркерами " + СокрП(мНачальныйМаркерПатчей) + " и " + мКонечныйМаркерПатчей + ". 
			|Элемент этого массива (патч) содержит: 
			|- isInsert - булево - если true, то это вставка перед блоком, иначе это замена блока,
			|- start - начальный маркер блока, null - для вставки после конца кода,
			|- end - конечный маркер блока, null - если начальный маркер является полным блоком,
			|- captureStart - булево - входит ли начальный маркер в заменяемый блок,
			|- captureEnd - булево - входит ли конечный маркер в заменяемый блок,
			|- toEndOfText - булево - если true, то блок содержит весь следующий код,
			|- text - текст замены блока или вставки перед блоком. 
			|Начальный маркер патча должен начинаться в начале строки кода и быть уникальными во всем коде. Старайся выбирать для него начало метода (например, Процедура ОбновитьРазмер()). 
			|Для проверки корректности маркеров патчей вызывай инструмент check_patches.
			|";
		КонецЕсли;
		Если ПередаватьКонтекст И мПолеТекстаПрограммы.мМодульМетаданных <> Неопределено Тогда
			ПараметрыЗапроса.Текст = ПараметрыЗапроса.Текст + "
			|<Контекст>
			|" + мПолеТекстаПрограммы.КонтекстИИ(ТекстЗапроса) + "
			|</Контекст>    
			|";
		КонецЕсли;
		Если ПоказатьЗапрос Тогда
			Если ирКлиент.ОткрытьТекстЛкс(ПараметрыЗапроса.Текст, "Подтвердите запрос ИИ",,,,,, Истина) = Неопределено Тогда
				Возврат;
			КонецЕсли; 
		КонецЕсли;
		Дозапросы.Очистить();
		ирОбщий.ОбновитьТекстПослеМаркераЛкс(ЭтаФорма.Заголовок,, ирОбщий.ПредставлениеСОбрезкойДлиныЛкс(ТекстЗапроса, 50), ": ");
		мНовыйКод = "";
		ЭлементыФормы.ДействияФормы.Кнопки.СравнитьТекст.Доступность = Ложь;
		ЭлементыФормы.ДействияФормы.Кнопки.Применить.Доступность = Ложь;
		ЭлементыФормы.ДействияФормы.Кнопки.ПрименитьВыборочно.Доступность = Ложь;
	КонецЕсли;
	мФоновыйЗапросХттп.ОтправитьЗапросИИ(ПараметрыЗапроса, ЭтаФорма, "ОтправитьКонец",, Кнопка, Истина,, РежимНапарника,,,,, РазрешитьДозапросы,, мПолеТекстаПрограммы);
	ирКлиент.ПолеВводаСИсториейВыбора_ПриИзмененииЛкс(ЭлементыФормы.ТекстЗапроса, ЭтаФорма);
КонецПроцедуры

Процедура ОбновитьКодЗапроса() Экспорт
	Если ЭлементыФормы.ПанельКонтекст.ТекущаяСтраница = ЭлементыФормы.ПанельКонтекст.Страницы.Фрагмент Тогда
		ЭтаФорма.КодЗапроса = ЭлементыФормы.ПолеКода.ПолучитьТекст();
	ИначеЕсли ЭлементыФормы.ПанельКонтекст.ТекущаяСтраница = ЭлементыФормы.ПанельКонтекст.Страницы.Метод Тогда
		Если мПолеТекстаПрограммы.мМетодМодуля <> Неопределено Тогда
			ЭтаФорма.КодЗапроса = мПолеТекстаПрограммы.ОпределениеАктивногоМетодаСОписанием();
		КонецЕсли;
	Иначе
		ЭтаФорма.КодЗапроса = мПолеТекстаПрограммы.мОригинальныйТекст;
	КонецЕсли;
КонецПроцедуры

Процедура ОтправитьКонец(Знач СостояниеЗадания, Знач РезультатЗадания) Экспорт
	Если РезультатЗадания = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЭтаФорма.ТекстОтвета = РезультатЗадания.Ответ;
	ОбработатьТекстОтвета();
	Для Каждого Дозапрос Из мФоновыйЗапросХттп.мДозапросы Цикл
		Строка = Дозапросы.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, Дозапрос);
	КонецЦикла;
	мФоновыйЗапросХттп.мДозапросы.Очистить();
КонецПроцедуры   

Процедура ОбработатьТекстОтвета(Знач ЛиВнешний = Ложь) Экспорт
	НовоеЧислоЗавершенныхБлоковКода = Цел(СтрЧислоВхождений(ТекстОтвета, мКонечныйМаркерКода)/2);
	Если НовоеЧислоЗавершенныхБлоковКода > мЧислоЗавершенныхБлоковКода Тогда
		мЧислоЗавершенныхБлоковКода = НовоеЧислоЗавершенныхБлоковКода;
		//БлокиКода = ирОбщий.НайтиРегВыражениеЛкс(ТекстОтвета, СокрП(мНачальныйМаркерКода) + "((?:(?!"+мКонечныйМаркерКода+")[\s\S])*)",,,,,,,,,,, Истина);
		//Если мФоновыйЗапросХттп.ПроверитьБлокКода(БлокиКода[0].Группа0) Тогда
		//	Возврат;
		//КонецЕсли;
	КонецЕсли;
	Если СтрЧислоВхождений(ТекстОтвета, мНачальныйМаркерКода) > НовоеЧислоЗавершенныхБлоковКода Тогда
		ТекстОтвета = ТекстОтвета + Символы.ПС + мКонечныйМаркерКода;
	ИначеЕсли ПустаяСтрока(мНовыйКод) Тогда
		Если Найти(ТекстОтвета, мМаркерПолногоКода + Символы.ПС) Тогда
			мНовыйКод = ирОбщий.ТекстБезПервогоФрагментаЛкс(ТекстОтвета, мМаркерПолногоКода);
			СтрокаМаркераНачалаКода = ирОбщий.ТекстМеждуМаркерамиЛкс(мНовыйКод, мКонечныйМаркерКода, Символы.ПС, Ложь, Истина);
			Если ЗначениеЗаполнено(СтрокаМаркераНачалаКода) Тогда
				мНовыйКод = ирОбщий.ТекстМеждуМаркерамиЛкс(мНовыйКод, СтрокаМаркераНачалаКода, мКонечныйМаркерКода,,,, Истина);
			КонецЕсли;
		ИначеЕсли ирОбщий.СтрНачинаетсяСЛкс(ТекстОтвета, мНачальныйМаркерКода) Тогда
			мНовыйКод = ирОбщий.ТекстМеждуМаркерамиЛкс(ТекстОтвета, мНачальныйМаркерКода, мКонечныйМаркерКода, Ложь);
		Иначе
			ТекстПатчей = ирОбщий.ТекстМеждуМаркерамиЛкс(ТекстОтвета, мНачальныйМаркерПатчей, мКонечныйМаркерПатчей, Ложь);
			Если ПустаяСтрока(ТекстПатчей) И ЛиВнешний Тогда
				ТекстПатчей = ТекстОтвета;
			КонецЕсли;
			Если ЗначениеЗаполнено(ТекстПатчей) И Найти(ТекстПатчей, "isInsert") Тогда
				//ТекстПатчей = ирОбщий.ТекстМеждуМаркерамиЛкс(ТекстПатчей, мНачальныйМаркерЖСОН, мКонечныйМаркерКода, Истина); // Слишком строго для вставки ответа
				ТекстПатчей = ирОбщий.ТекстМеждуМаркерамиЛкс(ТекстПатчей + Символы.ПС, "["+Символы.ПС, "]"+Символы.ПС, Ложь, Истина);
				Если ЗначениеЗаполнено(ТекстПатчей) Тогда 
					Патчи = ирОбщий.ОбъектИзТекстаЖСОНЛкс(ТекстПатчей);
					Патчи = ирОбщий.ТаблицаЗначенийИзКоллекцииЛкс(Патчи,,,,, Ложь, Ложь,,,);
					//! Патчи.Колонки.Добавить("start");
					//! Патчи.Колонки.Добавить("end");
					//! Патчи.Колонки.Добавить("text");
					//! Патчи.Колонки.Добавить("isInsert");
					//! Патчи.Колонки.Добавить("captureStart");
					//! Патчи.Колонки.Добавить("captureEnd");
					//! Патчи.Колонки.Добавить("toEndOfText");
					СлужебноеПолеТекста = мПолеТекстаПрограммы.СлужебноеПолеТекстаДолгое;
					СлужебноеПолеТекста.УстановитьТекст(КодЗапроса);
					Для Каждого ПатчиЭлемент Из Патчи Цикл
						мНовыйКод = СлужебноеПолеТекста.ПолучитьТекст();
						Если ПатчиЭлемент.start = ПатчиЭлемент.end Тогда
							// Исправляем очевидную ошибку в патче
							ПатчиЭлемент.end = Неопределено;
						КонецЕсли;
						Если ирОбщий.СтрЧислоСтрокЛкс(ирОбщий.НепечатныйКонецЛкс(ПатчиЭлемент.text)) < 2 Тогда
							ПатчиЭлемент.text = СокрП(ПатчиЭлемент.text) + Символы.ПС;
						КонецЕсли;
						Вхождение = Неопределено;
						Если ПатчиЭлемент.start <> Неопределено И ПатчиЭлемент.start <> "" Тогда
							Вхождение = мФоновыйЗапросХттп.НайтиМаркерБлока(мНовыйКод, ПатчиЭлемент.start,, Не ПатчиЭлемент.isInsert, Истина);
							Если Вхождение = Неопределено Тогда
								Продолжить;
							КонецЕсли;
							ПозицияНачала = Вхождение.ПозицияВхождения;
							Если ирОбщий.СтрНачинаетсяСЛкс(ПатчиЭлемент.text, ПатчиЭлемент.start) Тогда
								// Исправляем очевидную ошибку в патче
								ПатчиЭлемент.captureStart = Истина;
							КонецЕсли;
							Если Не ПатчиЭлемент.isInsert И Не ПатчиЭлемент.captureStart Тогда
								ПозицияНачала = ПозицияНачала + Вхождение.ДлинаВхождения;
							КонецЕсли;
						Иначе
							ПозицияНачала = СтрДлина(мНовыйКод);
						КонецЕсли;
						ПозицияКонца = ПозицияНачала;
						Если ПатчиЭлемент.isInsert Тогда
							//
						ИначеЕсли ПатчиЭлемент.toEndOfText Тогда
							ПозицияКонца = СтрДлина(мНовыйКод);
						ИначеЕсли ПатчиЭлемент.end <> Неопределено И ПатчиЭлемент.end <> "" Тогда
							Вхождение = мФоновыйЗапросХттп.НайтиМаркерБлока(мНовыйКод, ПатчиЭлемент.end, ПозицияКонца);
							Если Вхождение = Неопределено Тогда
								Продолжить;
							КонецЕсли;
							ПозицияКонца = ПозицияКонца + Вхождение.ПозицияВхождения;
							Если ирОбщий.СтрКончаетсяНаЛкс(ПатчиЭлемент.text, ПатчиЭлемент.end) Тогда
								// Исправляем очевидную ошибку в патче
								ПатчиЭлемент.captureEnd = Истина;
							КонецЕсли;
							Если ПатчиЭлемент.captureEnd Тогда
								ПозицияКонца = ПозицияКонца + Вхождение.ДлинаВхождения;
							КонецЕсли;
						ИначеЕсли Вхождение <> Неопределено И ПатчиЭлемент.captureStart Тогда
							ПозицияКонца = ПозицияКонца + Вхождение.ДлинаВхождения;
						КонецЕсли;
						СлужебноеПолеТекста.УстановитьГраницыВыделения(ПозицияНачала + 1, ПозицияКонца + 1);
						НовыйТекстБлока = "";
						Если Патчи.Колонки.Найти("text") <> Неопределено Тогда
							НовыйТекстБлока = ПатчиЭлемент.text;
						КонецЕсли;
						СлужебноеПолеТекста.ВыделенныйТекст = НовыйТекстБлока;
					КонецЦикла;
					мНовыйКод = СлужебноеПолеТекста.ПолучитьТекст();
					СлужебноеПолеТекста.УстановитьТекст(мПолеТекстаПрограммы.мОригинальныйТекст);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(мНовыйКод) Тогда
			ЭлементыФормы.ДействияФормы.Кнопки.СравнитьТекст.Доступность = ЗначениеЗаполнено(мНовыйКод) И ЗначениеЗаполнено(КодЗапроса);
			Если ЭлементыФормы.ДействияФормы.Кнопки.СравнитьТекст.Доступность Тогда
				ДоступностьПрименить = ЗначениеЗаполнено(мНовыйКод) И мПолеТекстаПрограммы <> Неопределено;
				ЭлементыФормы.ДействияФормы.Кнопки.Применить.Доступность = ДоступностьПрименить;
				ЭлементыФормы.ДействияФормы.Кнопки.ПрименитьВыборочно.Доступность = ДоступностьПрименить;
				ДействияФормыСравнитьТекст();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	ЭлементыФормы.Ответ.Документ.defaultView._1CAPI.setText(ТекстОтвета,, Истина); // Долго на большом тексте
КонецПроцедуры   

Процедура ВнешнееСобытие(Источник, Событие, Данные) Экспорт
	ирКлиент.Форма_ВнешнееСобытиеЛкс(ЭтаФорма, Источник, Событие, Данные);
КонецПроцедуры

Процедура ТабличноеПолеПриПолученииДанных(Элемент, ОформленияСтрок) Экспорт
	ирКлиент.ТабличноеПолеПриПолученииДанныхЛкс(ЭтаФорма, Элемент, ОформленияСтрок);
КонецПроцедуры

Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник) Экспорт
	ирКлиент.Форма_ОбработкаОповещенияЛкс(ЭтаФорма, ИмяСобытия, Параметр, Источник);
КонецПроцедуры

Процедура ПриЗакрытии()
	ирКлиент.Форма_ПриЗакрытииЛкс(ЭтаФорма);
КонецПроцедуры     

Процедура КлсКомандаНажатие(Кнопка)
	ирКлиент.УниверсальнаяКомандаФормыЛкс(ЭтаФорма, Кнопка);
КонецПроцедуры

Процедура СлужебноеПолеХТМЛДокументСформирован(Элемент)
	//Если Истина
	//	И ТекстЗапроса <> ""
	//	И КодЗапроса <> "" 
	//Тогда
	//	ДействияФормыОтправить();
	//КонецЕсли;
КонецПроцедуры

Процедура ЗапросНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	ирОбщий.ПолеВводаСИсториейВыбора_ОбновитьСписокЛкс(Элемент, ЭтаФорма);
КонецПроцедуры

Процедура ЗапросНачалоВыбора(Элемент, СтандартнаяОбработка)
	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.Добавить("Объясни");
	СписокВыбора.Добавить("Советуй улучшения"); 
	СписокВыбора.Добавить("Советуй улучшения работы кода в плане скорости, надежности, потребления памяти, но без советов по качеству, документации, соблюдению стандартов.");
	СписокВыбора.Добавить("Раздроби сложные выражения");
	СписокВыбора.Добавить("Найди ошибки");
	СписокВыбора.Добавить("Исправь ошибки");
	СписокВыбора.Добавить("Исправь опечатки в идентификаторах");
	СписокВыбора.Добавить("Сгенерируй комментарии");
	СписокВыбора.Добавить("Устрани дублирование");
	СписокВыбора.СортироватьПоПредставлению();
	РезультатВыбора = ВыбратьИзСписка(СписокВыбора, Элемент);
	Если РезультатВыбора <> Неопределено Тогда
		ирКлиент.ИнтерактивноЗаписатьВПолеВводаЛкс(Элемент, РезультатВыбора.Значение);
	КонецЕсли;
КонецПроцедуры

Процедура ДействияФормыОткрытьПараметрыИИ(Кнопка)
	Форма = мПолеТекстаПрограммы.ПолучитьФорму("Настройки", ЭтаФорма);
	Форма.Открыть(); 
	Форма.ТекущийЭлемент = Форма.ЭлементыФормы.МодельИИ;
КонецПроцедуры

Процедура ДействияФормыСравнитьТекст(Кнопка = Неопределено)
	ирКлиент.Сравнить2ЗначенияВФормеЛкс(КодЗапроса, мНовыйКод,, "Старый", "Новый",,,,, "ВстроенныйЯзык");
КонецПроцедуры

Процедура Ответonclick(Элемент, pEvtObj)
	Если pEvtObj.srcElement.innerText = "Сравнить" Тогда
		ТекстБлокаКода = pEvtObj.srcElement.parentElement.parentElement.parentElement.childNodes[1].innerText;
		ирКлиент.Сравнить2ЗначенияВФормеЛкс(КодЗапроса, ТекстБлокаКода,, "Старый", "Новый",,,,, "ВстроенныйЯзык");
	КонецЕсли;
КонецПроцедуры

Процедура ДействияФормыПрименить(Кнопка = Неопределено)
	Если ЭлементыФормы.ПанельКонтекст.ТекущаяСтраница = ЭлементыФормы.ПанельКонтекст.Страницы.Модуль Тогда
		мПолеТекстаПрограммы.ВыделитьВесьТекст();
	ИначеЕсли ЭлементыФормы.ПанельКонтекст.ТекущаяСтраница = ЭлементыФормы.ПанельКонтекст.Страницы.Метод Тогда
		мПолеТекстаПрограммы.УстановитьГраницыВыделения(мПолеТекстаПрограммы.мМетодМодуля.ПозицияОпределения, мПолеТекстаПрограммы.мМетодМодуля.ПозицияОпределения + мПолеТекстаПрограммы.мМетодМодуля.ДлинаСОписанием);
	КонецЕсли;
	мПолеТекстаПрограммы.ВставитьНовыйВариантТекстаОтИИ(мНовыйКод);
	ЭлементыФормы.ДействияФормы.Кнопки.Применить.Доступность = Ложь;
	ЭлементыФормы.ДействияФормы.Кнопки.ПрименитьВыборочно.Доступность = Ложь;
	Если МодальныйРежим Тогда
		Закрыть(мНовыйКод);
	КонецЕсли;
КонецПроцедуры

Процедура ДействияФормыСыройОтвет(Кнопка)
	НовыйТекстОтвета = ирКлиент.ОткрытьТекстЛкс(ТекстОтвета, Заголовок, "Обычный",, КлючУникальности, ЭтаФорма,, Истина);
	Если НовыйТекстОтвета <> Неопределено Тогда
		Если Истина
			И Найти(НовыйТекстОтвета, "isInsert") = 0
			И Найти(НовыйТекстОтвета, мМаркерПолногоКода) = 0
		Тогда
			НовыйТекстОтвета = мМаркерПолногоКода + Символы.ПС + НовыйТекстОтвета;
		КонецЕсли;
		мНовыйКод = "";
		ОбновитьКодЗапроса();
		ЭтаФорма.ТекстОтвета = НовыйТекстОтвета;
		ОбработатьТекстОтвета(Истина);
	КонецЕсли;
КонецПроцедуры

Процедура ОбновлениеОтображения()
	ирКлиент.Форма_ОбновлениеОтображенияЛкс(ЭтаФорма);
КонецПроцедуры

Процедура ДозапросыПриАктивизацииСтроки(Элемент)
	ирКлиент.ТабличноеПолеПриАктивизацииСтрокиЛкс(ЭтаФорма, Элемент);
КонецПроцедуры

Процедура ДозапросыПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	ирКлиент.ТабличноеПолеПриВыводеСтрокиЛкс(ЭтаФорма, Элемент, ОформлениеСтроки, ДанныеСтроки);
КонецПроцедуры

Процедура ДозапросыВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	ирКлиент.ЯчейкаТабличногоПоляРасширенногоЗначения_ВыборЛкс(ЭтаФорма, Элемент, СтандартнаяОбработка);
КонецПроцедуры

Процедура ДействияФормыПрименитьВыборочно(Кнопка)
	НовыйКод = ирКлиент.Сравнить2ЗначенияВФормеЛкс(КодЗапроса, мНовыйКод, Истина, "Старый", "Новый",,,,, "ВстроенныйЯзык",,,,,, Истина);
	Если ТипЗнч(НовыйКод) = Тип("Строка") Тогда
		мНовыйКод = НовыйКод;
		ДействияФормыПрименить();
	КонецЕсли;
КонецПроцедуры

ирКлиент.ИнициироватьФормуЛкс(ЭтаФорма, "Обработка.ирПлатформа.Форма.ЧатИИ");
#Если Сервер И Не Сервер Тогда
	мПолеТекстаХТМЛ = Обработки.ирОболочкаПолеТекста.Создать();
	мПолеТекстаПрограммы = Обработки.ирКлсПолеТекстаПрограммы.Создать();
#КонецЕсли
//мВариантыИмениЯзыка = Новый Массив;
//мВариантыИмениЯзыка.Добавить("1с");
//мВариантыИмениЯзыка.Добавить("1c");
//мВариантыИмениЯзыка.Добавить("bsl");
мНачальныйМаркерКода = "```1c" + Символы.ПС;
мКонечныйМаркерКода = "```";
мМаркерПолногоКода = "<!--ПолныйКод-->";  
мНачальныйМаркерПатчей = "<!--Патчи_Начало-->" + Символы.ПС;
мКонечныйМаркерПатчей = "<!--Патчи_Конец-->";
//мНачальныйМаркерЖСОН = "```json" + Символы.ПС;
мЧислоЗавершенныхБлоковКода = 0;
