Перем мПолеТекстаПрограммы Экспорт;
Перем мПолеТекстаХТМЛ;
Перем мФоновыйЗапросХттп;
 
Процедура ПриОткрытии()
	ирКлиент.Форма_ПриОткрытииЛкс(ЭтаФорма);
	мФоновыйЗапросХттп = ирКлиент.НовыйФоновыйЗапросХттпЛкс(ЭтаФорма);
	мПолеТекстаХТМЛ = ирКлиент.ОболочкаПоляТекстаЛкс(ЭлементыФормы.HTMLГотовый);
	ТекстХТМЛ = ПолучитьМакет("ПросмотрMarkdownHTML").ПолучитьТекст();
	ТекстХТМЛ = СтрЗаменить(ТекстХТМЛ, "%ТекстJS%", ПолучитьМакет("ПросмотрMarkdownКод").ПолучитьТекст()); 
	ЭлементыФормы.HTMLГотовый.УстановитьТекст(ТекстХТМЛ);
КонецПроцедуры

// Предопределеный метод механизма фоновых операций
Процедура ПроверкаЗавершенияФоновыхЗаданий() Экспорт 
	ирКлиент.ПроверитьЗавершениеФоновыхЗаданийФормыЛкс(ЭтаФорма);
КонецПроцедуры

Процедура СлужебноеПолеХТМЛonclick(Элемент, pEvtObj) Экспорт
	мФоновыйЗапросХттп.ОбработатьОтвет(ЭтаФорма);
КонецПроцедуры

Процедура ДействияФормыОтправить(Кнопка = Неопределено)
	Если Кнопка <> Неопределено Тогда
		ЭтаФорма.ПараметрыЗапроса = Новый Структура("Текст", ЭлементыФормы.ПолеВопроса.ПолучитьТекст());
		ЭтаФорма.РежимНапарника = "custom";
	Иначе 
		ирОбщий.ОбновитьТекстПослеМаркераЛкс(ЭтаФорма.Заголовок,, "Советы по коду", ": ");
		ЭлементыФормы.ПолеВопроса.УстановитьТекст(ТекстВопроса);
	КонецЕсли;
	Кнопка = ЭлементыФормы.ДействияФормы.Кнопки.Отправить;
	мФоновыйЗапросХттп.ОтправитьЗапросИИ(ПараметрыЗапроса, ЭтаФорма, "ОтправитьКонец",, Кнопка, Истина,, РежимНапарника);
	ЭтаФорма.ПараметрыЗапроса = Неопределено;
КонецПроцедуры

Процедура ОтправитьКонец(Знач СостояниеЗадания, Знач РезультатЗадания) Экспорт
	Если РезультатЗадания = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЭлементыФормы.HTMLГотовый.Документ.defaultView.setText(РезультатЗадания.Ответ); // Долго на большом тексте
КонецПроцедуры   

Процедура ВнешнееСобытие(Источник, Событие, Данные) Экспорт
	ирКлиент.Форма_ВнешнееСобытиеЛкс(ЭтаФорма, Источник, Событие, Данные);
КонецПроцедуры

Процедура ТабличноеПолеПриПолученииДанных(Элемент, ОформленияСтрок) Экспорт
	ирКлиент.ТабличноеПолеПриПолученииДанныхЛкс(ЭтаФорма, Элемент, ОформленияСтрок);
КонецПроцедуры

Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник) Экспорт
	ирКлиент.Форма_ОбработкаОповещенияЛкс(ЭтаФорма, ИмяСобытия, Параметр, Источник);
КонецПроцедуры

Процедура ПриЗакрытии()
	ирКлиент.Форма_ПриЗакрытииЛкс(ЭтаФорма);
КонецПроцедуры     

Процедура КлсКомандаНажатие(Кнопка)
	ирКлиент.УниверсальнаяКомандаФормыЛкс(ЭтаФорма, Кнопка);
КонецПроцедуры

Процедура СлужебноеПолеХТМЛДокументСформирован(Элемент)
	Если ПараметрыЗапроса <> Неопределено Тогда
		ДействияФормыОтправить();
	КонецЕсли;
КонецПроцедуры

ирКлиент.ИнициироватьФормуЛкс(ЭтаФорма, "Обработка.ирПлатформа.Форма.ЧатИИ");
#Если Сервер И Не Сервер Тогда
	мПолеТекстаХТМЛ = Обработки.ирОболочкаПолеТекста.Создать();
#КонецЕсли
