
Процедура Надпись3Нажатие(Элемент)
	ЗапуститьПриложение("https://infostart.ru/1c/articles/1273456");
КонецПроцедуры

Процедура ПриОткрытии()
	Если КлючУникальности = "Автотест" Тогда
		Возврат;
	КонецЕсли;
	ирКлиент.Форма_ПриОткрытииЛкс(ЭтаФорма);
	ЭтаФорма.БольшеНеПоказывать = ирОбщий.ВосстановитьЗначениеЛкс("БольшеНеПоказыватьСоветы");
КонецПроцедуры

Процедура ПриЗакрытии()
	ирОбщий.СохранитьЗначениеЛкс("БольшеНеПоказыватьСоветы", БольшеНеПоказывать);
	ирКлиент.Форма_ПриЗакрытииЛкс(ЭтаФорма);
КонецПроцедуры

Процедура ВнешнееСобытие(Источник, Событие, Данные) Экспорт
	ирКлиент.Форма_ВнешнееСобытиеЛкс(ЭтаФорма, Источник, Событие, Данные);
КонецПроцедуры

Процедура КлсКомандаНажатие(Кнопка) Экспорт 
	ирКлиент.УниверсальнаяКомандаФормыЛкс(ЭтаФорма, Кнопка);
КонецПроцедуры

ирКлиент.ИнициироватьФормуЛкс(ЭтаФорма, "Обработка.ирПлатформа.Форма.ПолезныеСоветы", Ложь);
