// Используется недокументированная особенность (скорее всего ошибка) платформы - 
// глобальная непараметризованная команда формы по горячей клавише сработавает во всех формах, открытых без блокирования других форм

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	#Если Сервер И Не Сервер Тогда
		РедактироватьОбъектИзАктивнойФормыЛкс();
	#КонецЕсли
	ирОбщий.ВыполнитьГлобальнуюКомандуУправлямойФормыЛкс("РедактироватьОбъектИзАктивнойФормыЛкс");
	
КонецПроцедуры


