
Процедура КнопкаОКНажатие(Кнопка)

	ОповеститьОВыборе(Текст);
	
КонецПроцедуры

Процедура НадписьКакСохранитьНажатие(Элемент)
	
	Форма = ирОбщий.ОткрытьФормуЛкс("Обработка.ирПортативный.Форма.ФормаНастроек");
	Форма.ЭлементыФормы.Панель.ТекущаяСтраница = Форма.ЭлементыФормы.Панель.Страницы.Настройки;
	
КонецПроцедуры

Процедура НадписьФункцииДляОтладкиНажатие(Элемент)
	
	ЗапуститьПриложение("http://" + ирКэш.АдресСайтаЛкс() + "/index/funkcii_dlja_otladki/0-33");
	
КонецПроцедуры

ирОбщий.ИнициализироватьФормуЛкс(ЭтаФорма, "Обработка.ирПлатформа.Форма.ОткрытьОбъектДляОтладки");
