
Процедура КнопкаОКНажатие(Кнопка = Неопределено)

	ОповеститьОВыборе(Текст);
	
КонецПроцедуры

Процедура НадписьКакСохранитьНажатие(Элемент)
	
	Форма = ирОбщий.ОткрытьФормуЛкс("Обработка.ирПортативный.Форма.ФормаНастроек");
	Форма.ЭлементыФормы.Панель.ТекущаяСтраница = Форма.ЭлементыФормы.Панель.Страницы.Настройки;
	
КонецПроцедуры

Процедура НадписьФункцииДляОтладкиНажатие(Элемент)
	
	ЗапуститьПриложение("http://" + ирОбщий.АдресОсновногоСайтаЛкс() + "/index/funkcii_dlja_otladki/0-33");
	
КонецПроцедуры

Процедура ОсновныеДействияФормыПоследнийСохраненный(Кнопка)
	
	ЭтаФорма.Текст = ирОбщий.РезультатСохраненияОбъектаОтложеннойОтладкиВНастройкуЛкс();
	КнопкаОКНажатие();
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	Если Метаданные.Справочники.Найти("ирОбъектыДляОтладки") <> Неопределено Или ЗначениеЗаполнено(ирОбщий.ПолучитьКаталогОбъектовДляОтладкиЛкс(Истина)) Тогда
		ЭлементыФормы.ОсновныеДействияФормы.Кнопки.Удалить(ЭлементыФормы.ОсновныеДействияФормы.Кнопки.ПоследнийСохраненный);
	КонецЕсли; 
	
КонецПроцедуры

Процедура ВнешнееСобытие(Источник, Событие, Данные) Экспорт
	
	ирОбщий.Форма_ВнешнееСобытиеЛкс(ЭтаФорма, Источник, Событие, Данные);

КонецПроцедуры

Процедура ТабличноеПолеПриПолученииДанных(Элемент, ОформленияСтрок) Экспорт 
	
	ирОбщий.ТабличноеПолеПриПолученииДанныхЛкс(ЭтаФорма, Элемент, ОформленияСтрок);

КонецПроцедуры

Процедура ОсновныеДействияФормыОбучающееВидео(Кнопка)
	
	ЗапуститьПриложение("https://youtu.be/-NJJP79TccI");
	
КонецПроцедуры

ирОбщий.ИнициализироватьФормуЛкс(ЭтаФорма, "Обработка.ирПлатформа.Форма.ОткрытьОбъектДляОтладки");
