
Процедура КнопкаОКНажатие(Кнопка = Неопределено)

	ОповеститьОВыборе(Текст);
	
КонецПроцедуры

Процедура НадписьКакСохранитьНажатие(Элемент)
	
	Форма = ирОбщий.ОткрытьФормуЛкс("Обработка.ирПортативный.Форма.ФормаНастроек");
	Форма.ЭлементыФормы.Панель.ТекущаяСтраница = Форма.ЭлементыФормы.Панель.Страницы.Настройки;
	
КонецПроцедуры

Процедура НадписьФункцииДляОтладкиНажатие(Элемент)
	
	ЗапуститьПриложение("http://" + ирКэш.АдресСайтаЛкс() + "/index/funkcii_dlja_otladki/0-33");
	
КонецПроцедуры

Процедура ОсновныеДействияФормыПоследнийСохраненный(Кнопка)
	
	ЭтаФорма.Текст = ирОбщий.РезультатСохраненияОбъектаОтложеннойОтладкиВНастройкуЛкс();
	КнопкаОКНажатие();
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	Если Метаданные.Справочники.Найти("ирОбъектыДляОтладки") <> Неопределено Или ЗначениеЗаполнено(ирОбщий.ПолучитьКаталогОбъектовДляОтладкиЛкс()) Тогда
		ЭлементыФормы.ОсновныеДействияФормы.Кнопки.Удалить(ЭлементыФормы.ОсновныеДействияФормы.Кнопки.ПоследнийСохраненный);
	КонецЕсли; 
	
КонецПроцедуры

ирОбщий.ИнициализироватьФормуЛкс(ЭтаФорма, "Обработка.ирПлатформа.Форма.ОткрытьОбъектДляОтладки");
