Перем ИзПараметра Экспорт;

Функция СохраняемаяНастройкаФормы(выхНаименование, выхИменаСвойств) Экспорт 
	выхИменаСвойств = "Форма.СоздатьЗапросСозданияТаблицы, Форма.ОтредактироватьДанныеТаблицы, Форма.ЯвноВыбратьКаждоеПоле, Форма.ДекларироватьТипы, Форма.ЯвноДобавитьКаждуюСтроку";
	Возврат Неопределено;
КонецФункции

Процедура КнопкаВыполнитьНажатие(Кнопка)
	
	Закрыть(Истина);
	
КонецПроцедуры

Процедура ПриОткрытии()
	ирОбщий.Форма_ПриОткрытииЛкс(ЭтаФорма);
	ирОбщий.СоздатьМенеджерСохраненияНастроекФормыЛкс(ЭтаФорма);
	//ЭлементыФормы.СоздатьЗапросСозданияТаблицы.Видимость = Не ИзПараметра;
	ЭлементыФормы.ОтредактироватьДанныеТаблицы.Видимость = Не ИзПараметра;
	НастроитьЭлементыФормы();
КонецПроцедуры

Процедура НастроитьЭлементыФормы()
	
	ИмяТаблицыПриИзменении();
	ЭлементыФормы.ЯвноДобавитьКаждуюСтроку.Доступность = СоздатьЗапросСозданияТаблицы;
	ЭлементыФормы.ЯвноВыбратьКаждоеПоле.Доступность = ЭлементыФормы.ЯвноДобавитьКаждуюСтроку.Доступность И Не ЯвноДобавитьКаждуюСтроку;
	ЭлементыФормы.ДекларироватьТипы.Доступность = ЭлементыФормы.ЯвноВыбратьКаждоеПоле.Доступность;

КонецПроцедуры

Процедура ПриЗакрытии()
	ирОбщий.Форма_ПриЗакрытииЛкс(ЭтаФорма);
КонецПроцедуры

Процедура ИмяТаблицыНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	ирОбщий.ПолеВводаСИсториейВыбора_НачалоВыбораИзСпискаЛкс(Элемент, ЭтаФорма);
КонецПроцедуры

Процедура ИмяТаблицыПриИзменении(Элемент = Неопределено)
	Элемент = ЭлементыФормы.ИмяТаблицы;
	Если Не ирОбщий.ЛиИмяПеременнойЛкс(Элемент.Значение) Тогда
		Элемент.Значение = ирОбщий.ИдентификаторИзПредставленияЛкс(Элемент.Значение);
	КонецЕсли; 
	ирОбщий.ПолеВводаСИсториейВыбора_ПриИзмененииЛкс(Элемент, ЭтаФорма);
КонецПроцедуры

Процедура ВнешнееСобытие(Источник, Событие, Данные) Экспорт
	
	ирОбщий.Форма_ВнешнееСобытиеЛкс(ЭтаФорма, Источник, Событие, Данные);

КонецПроцедуры

Процедура ТабличноеПолеПриПолученииДанных(Элемент, ОформленияСтрок) Экспорт 
	
	ирОбщий.ТабличноеПолеПриПолученииДанныхЛкс(ЭтаФорма, Элемент, ОформленияСтрок);

КонецПроцедуры

Процедура ЯвноДобавитьСтрокиПриИзменении(Элемент)
	НастроитьЭлементыФормы();
КонецПроцедуры

Процедура СоздатьЗапросСозданияТаблицыПриИзменении(Элемент)
	НастроитьЭлементыФормы();
КонецПроцедуры

ирОбщий.ИнициироватьФормуЛкс(ЭтаФорма, "Обработка.ирКонсольЗапросов.Форма.ПомещениеВоВременнуюТаблицу");
ИзПараметра = Ложь;