// Управляет доступностью элементов управления
//
// Параметры:
//	Нет.
//
Процедура НастроитьЭлементыФормы()

	ЭлементыФормы.НадписьФрмИнтервалАвтосохранения.Доступность = фрмАвтосохранениеТекущегоФайла;
	ЭлементыФормы.ФрмИнтервалАвтосохранения.Доступность = фрмАвтосохранениеТекущегоФайла;

КонецПроцедуры // УправлениеДиалогом()

// Обработчик изменения флажка автосохранения
//
Процедура ИспользоватьАвтосохранениеПриИзменении(Элемент)

	НастроитьЭлементыФормы();

КонецПроцедуры // ИспользоватьАвтосохранениеПриИзменении()

// Обработчик нажатия кнопки ОК
//
Процедура КнопкаОКНажатие(Элемент)

	ЭтотОбъект.АвтосохранениеТекущегоФайла = фрмАвтосохранениеТекущегоФайла;
	ЭтотОбъект.АвтосохранениеФайлаВосстановления = фрмАвтосохранениеФайлаВосстановления;
	ЭтотОбъект.ИнтервалАвтосохранения = фрмИнтервалАвтосохранения;
	ЭтотОбъект.ВключатьДеревоЗапросаПриОтладке = фрмВключатьДеревоЗапросаПриОтладке;
	ирОбщий.СохранитьЗначениеЛкс("ПредлагатьОчиститьМенеджерВременныхТаблицЧерезМинут", ПредлагатьОчиститьМенеджерВременныхТаблицЧерезМинут);
	Закрыть();

КонецПроцедуры // КнопкаОКНажатие()

// Обработчик события перед открытием формы
//
Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)

	ФрмАвтосохранениеТекущегоФайла = ЭтотОбъект.АвтосохранениеТекущегоФайла;
	ФрмАвтосохранениеФайлаВосстановления = ЭтотОбъект.АвтосохранениеФайлаВосстановления;
	фрмИнтервалАвтосохранения = ЭтотОбъект.ИнтервалАвтосохранения;
	фрмВключатьДеревоЗапросаПриОтладке = ЭтотОбъект.ВключатьДеревоЗапросаПриОтладке;
	ЭтаФорма.ПредлагатьОчиститьМенеджерВременныхТаблицЧерезМинут = ирОбщий.ПериодОчисткиМенеджераВременныхТаблицЛкс();
	НастроитьЭлементыФормы();

КонецПроцедуры

Процедура ПриОткрытии()
	ирОбщий.Форма_ПриОткрытииЛкс(ЭтаФорма);
КонецПроцедуры

Процедура ПриЗакрытии()
	ирОбщий.Форма_ПриЗакрытииЛкс(ЭтаФорма);
КонецПроцедуры

Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	ирОбщий.Форма_ВнешнееСобытиеЛкс(ЭтаФорма, Источник, Событие, Данные);

КонецПроцедуры


ирОбщий.ИнициализироватьФормуЛкс(ЭтаФорма, "Обработка.ирКонсольЗапросов.Форма.ФормаНастройки");

СписокВыбора = ЭлементыФормы.ФрмИнтервалАвтосохранения.СписокВыбора;
СписокВыбора.Добавить(5);
СписокВыбора.Добавить(10);
СписокВыбора.Добавить(30);
СписокВыбора.Добавить(60);

СписокВыбора = ЭлементыФормы.ПредлагатьОчиститьМенеджерВременныхТаблицЧерезМинут.СписокВыбора;
СписокВыбора.Добавить(10);
СписокВыбора.Добавить(30);
СписокВыбора.Добавить(60);

ФрмИспользоватьАвтосохранениеФайлаВосстановления = Истина;