Процедура ОсновныеДействияФормыОК(Кнопка)
	
	СохранитьЗначение(ИмяКласса + ".ФайлШаблоновТекста", ФайлШаблоновТекста);
	ирКэш.Получить().ПолучитьТаблицуШаблоновТекста(ИмяКласса, мСообщенияЧерезПредупреждения, Истина);
	СохранитьЗначение(ИмяКласса + ".ЛиОткрыватьПустойСписок", ЛиОткрыватьПустойСписок);
	СохранитьЗначение(ИмяКласса + ".ЛиАктивизироватьОкноСправкиПриЕгоОткрытии", ЛиАктивизироватьОкноСправкиПриЕгоОткрытии);
	СохранитьЗначение(ИмяКласса + ".ИспользоватьПромежуточныеДополнения", ИспользоватьПромежуточныеДополнения);
	СохранитьЗначение(ИмяКласса + ".ПредпочитаюСобственныйКонструкторЗапроса", ПредпочитаюСобственныйКонструкторЗапроса);
	мПлатформа.ЛиНизкоуровневоеПолучениеОписанийОбъектов = ЛиНизкоуровневоеПолучениеОписанийОбъектов;
	СохранитьЗначение("ирПлатформа.ЛиНизкоуровневоеПолучениеОписанийОбъектов", ЛиНизкоуровневоеПолучениеОписанийОбъектов);
	Закрыть();
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	ФайлШаблоновТекста = ВосстановитьЗначение(ИмяКласса + ".ФайлШаблоновТекста");
	ЛиОткрыватьПустойСписок = ВосстановитьЗначение(ИмяКласса + ".ЛиОткрыватьПустойСписок");
	ЛиАктивизироватьОкноСправкиПриЕгоОткрытии = ВосстановитьЗначение(ИмяКласса + ".ЛиАктивизироватьОкноСправкиПриЕгоОткрытии");
	ИспользоватьПромежуточныеДополнения = ВосстановитьЗначение(ИмяКласса + ".ИспользоватьПромежуточныеДополнения");
	ПредпочитаюСобственныйКонструкторЗапроса = ВосстановитьЗначение(ИмяКласса + ".ПредпочитаюСобственныйКонструкторЗапроса");
	ЛиНизкоуровневоеПолучениеОписанийОбъектов = мПлатформа.ЛиНизкоуровневоеПолучениеОписанийОбъектов;
	
КонецПроцедуры

Процедура ФайлШаблоновНачалоВыбора(Элемент, СтандартнаяОбработка)
	
	ДиалогФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогФайла.ПолноеИмяФайла = Элемент.Значение;
	ДиалогФайла.Расширение = "st";
	ДиалогФайла.Фильтр = ирОбщий.ПолучитьСтрокуФильтраДляВыбораФайлаЛкс("st", "Файл шаблонов текста 1С");
	Если ДиалогФайла.Выбрать() Тогда
		Элемент.Значение = ДиалогФайла.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ФайлШаблоновТекстаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТаблицаШаблоновТекста = ирКэш.Получить().ПолучитьТаблицуШаблоновТекста(ИмяКласса, мСообщенияЧерезПредупреждения);
	ТаблицаШаблоновТекста.Сортировать("Шаблон");
	ирОбщий.ИсследоватьЛкс(ТаблицаШаблоновТекста, Ложь, Истина);
	
КонецПроцедуры

ирОбщий.ИнициализироватьФормуЛкс(ЭтаФорма, "Обработка.ирКлсПолеТекстовогоДокументаСКонтекстнойПодсказкой.Форма.ФормаНастройки");
