Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	Отказ = Истина;
	Если ВладелецФормы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Ответ = Вопрос("Для каждого объекта сразу будет создана копия, которая будет назначена правильным элементом его группы дублей.
	|Крайне желательно сразу провести замену ссылок и удалить неправильные элементы.", РежимДиалогаВопрос.ОКОтмена);
	Если Ответ = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	СтрокиДляОбработки = НайденныеОбъекты.Скопировать(Новый Структура(мИмяКолонкиПометки, Истина));
	Объекты = СтрокиДляОбработки.ВыгрузитьКолонку("Ссылка");
	ирОбщий.ОткрытьДиалогЗаменыИдентификаторовОбъектовЛкс(Объекты);

КонецПроцедуры

ирОбщий.ИнициализироватьФормуЛкс(ЭтаФорма, "Обработка.ирПодборИОбработкаОбъектов.Форма.ИзменитьИдентификаторы");
