////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Перем мИскомыйОбъект Экспорт;
Перем КлючНабораТаблицБД;
Перем мСхемаКомпоновки;
Перем мВыборкаРезультата;
Перем мТекстЗапросаБезУсловий;
Перем мСтруктураКлюча;
Перем мДоступнаЗапись;
Перем мИмяСлужебногоПоля;
Перем СсылкаНаБуфернуюТаблицу;
Перем мТекстЗапросаКоличестваСтрок;
Перем мАдресХранилищаКоличестваСтрок;
Перем мИДФоновогоЗадания;
Перем мИменаКоличестваПодчиненных;
Перем мСтарыеКолонкиТабличногоПоляРезультата;
Перем мШиринаПустойКолонки;

Функция СохраняемаяНастройкаФормы(выхНаименование, выхИменаСвойств) Экспорт 
	Если Истина
		И КлючНабораТаблицБД <> ""
		И ЭтаФорма.КлючУникальности = Неопределено
	Тогда
		НастройкиНабораТаблицБД = СохранитьНастройкиТекущейТаблицы();
	КонецЕсли;
	выхИменаСвойств = "Реквизит.АвтовВыбранныеПоляИзОтбора, Реквизит.АвтозаполнениеПорядка, Реквизит.БезАвтоупорядочивания, Реквизит.ВыбратьВсеПоля, Реквизит.ВыводитьСообщения, Реквизит.ВыполнятьНаСервере, Реквизит.ИмяСиноним, Реквизит.ИспользоватьОтборПоУзлу, Реквизит.КоличествоОбъектовВПорции, Реквизит.КоличествоПотоков, Реквизит.МноготабличнаяВыборка, Реквизит.НастройкиКомпоновки, Реквизит.ОбластьПоиска, Реквизит.ОбщаяТранзакция, Реквизит.ПервыеNКаждойТаблицы, Реквизит.ПодключатьПоляКоличестваДвижений, Реквизит.ПообъектныеТранзакции, Реквизит.ПроводитьПроведенныеДокументыПриЗаписи, Реквизит.ПропускатьОшибки, Реквизит.СтрокиДляОбработки, Реквизит.УзелОтбораОбъектов, Форма.ДоступныеОбработки";
	Результат = Новый Структура;
	Если Не ДинамическаяВыборка Тогда
		Результат.Вставить("СтрокиДляОбработки", СтрокиДляОбработки);
	Иначе
		Результат.Вставить("СтрокиДляОбработки", СтрокиДляОбработки.СкопироватьКолонки());
	КонецЕсли; 
	Результат.Вставить("ВыбранныеОбработки", ВыбранныеОбработкиДляСохранения());
	Результат.Вставить("НастройкиНабораТаблицБД", НастройкиНабораТаблицБД);
	Возврат Результат;
КонецФункции

Процедура ЗагрузитьНастройкуВФорме(НастройкаФормы, ДопПараметры) Экспорт 
	
	#Если Сервер И Не Сервер Тогда
		НастройкаФормы = Новый Структура;
	#КонецЕсли
	СохранитьНастройкиТекущейТаблицы();
	НастройкиНабораТаблицБД = Неопределено;
	ИспользованиеВсеТаблицы = Ложь;
	ИспользованиеОбработки = Ложь;
	ИспользованиеПрочее = Ложь;
	Если НастройкаФормы <> Неопределено Тогда
		ИспользованиеВсеТаблицы = Истина;
		ИспользованиеОбработки = Истина;
		ИспользованиеПрочее = Истина;
		СоставНастройкиФормы = ДопПараметры.СоставНастройкиФормы;
		#Если Сервер И Не Сервер Тогда
			СоставНастройкиФормы = Новый СписокЗначений;
		#КонецЕсли
		СпискиСвойств = Новый Соответствие;
		СпискиСвойств[Истина] = Новый Структура;
		СпискиСвойств[Ложь] = Новый Структура;
		Если СоставНастройкиФормы <> Неопределено Тогда
			ИспользованиеВсеТаблицы = СоставНастройкиФормы.НайтиПоЗначению("ВсеТаблицы").Пометка;
			ИспользованиеОбработки = СоставНастройкиФормы.НайтиПоЗначению("Обработки").Пометка;
			ИспользованиеПрочее = СоставНастройкиФормы.НайтиПоЗначению("Прочее").Пометка;
		КонецЕсли; 
		// Все таблицы
		СписокСвойств = СпискиСвойств[ИспользованиеВсеТаблицы];
		СписокСвойств.Вставить("НастройкиКомпоновки");
		// Обработки
		СписокСвойств = СпискиСвойств[ИспользованиеОбработки];
		СписокСвойств.Вставить("ДоступныеОбработки");
		СписокСвойств.Вставить("ВыбранныеОбработки");
		Если Истина
			И ИспользованиеПрочее
			И НастройкаФормы.Свойство("СтрокиДляОбработки") 
		Тогда
			СтарыеСтрокиДляОбработки = НастройкаФормы.СтрокиДляОбработки;
			#Если Сервер И Не Сервер Тогда
				СтарыеСтрокиДляОбработки = Новый ТаблицаЗначений;
			#КонецЕсли
			НастройкаФормы.Удалить("СтрокиДляОбработки");
		КонецЕсли; 
		Если Истина
			И ИспользованиеОбработки
			И НастройкаФормы.Свойство("ВыбранныеОбработки") 
		Тогда
			СтарыеВыбранныеОбработки = НастройкаФормы.ВыбранныеОбработки;
			#Если Сервер И Не Сервер Тогда
				СтарыеВыбранныеОбработки = Новый ТаблицаЗначений;
			#КонецЕсли
			НастройкаФормы.Удалить("ВыбранныеОбработки");
		КонецЕсли; 
		Если Истина
			И ДопПараметры <> Неопределено
			И ДопПараметры.Свойство("ПриОткрытии")
			И ЗначениеЗаполнено(ОбластьПоиска) 
			И НастройкаФормы.Свойство("ОбластьПоиска") 
		Тогда
			НастройкаФормы.Удалить("ОбластьПоиска");
			СтарыеСтрокиДляОбработки = Неопределено;
		КонецЕсли; 
		ирОбщий.ЗагрузитьНастройкуФормыЛкс(ЭтаФорма, НастройкаФормы, СпискиСвойств[Истина], СпискиСвойств[Ложь], ИспользованиеПрочее); 
		ЭтотОбъект.МноготабличнаяВыборка = ТипЗнч(ОбластьПоиска) = Тип("СписокЗначений");
		НастройкаФормы.Свойство("НастройкиНабораТаблицБД", НастройкиНабораТаблицБД);
	КонецЕсли; 
	УстановитьОбластьПоиска(ОбластьПоиска, НастройкиНабораТаблицБД);
	Если Истина
		И СтарыеСтрокиДляОбработки <> Неопределено 
		И СтарыеСтрокиДляОбработки.Количество() > 0
	Тогда
		мВопросНаОбновлениеСтрокДляОбработкиЗадавался = Ложь;
		ирОбщий.ЗагрузитьВТаблицуЗначенийЛкс(СтарыеСтрокиДляОбработки, СтрокиДляОбработки,,, Истина);
	КонецЕсли; 
	Если СтарыеВыбранныеОбработки <> Неопределено Тогда
		ЗагрузитьВыбранныеОбработки(СтарыеВыбранныеОбработки);
		вЗагрузитьОбработки(ДоступныеОбработки, ВыбранныеОбработки);
		ирОбщий.ТабличноеПолеДеревоЗначений_РазвернутьВсеСтрокиЛкс(ЭлементыФормы.ДоступныеОбработки);
	КонецЕсли; 
	АвтозаполнениеПорядкаПриИзменении();

КонецПроцедуры

Процедура НастроитьЭлементыФормы()

	Доступность = мИскомыйОбъект <> Неопределено;
	Если Доступность Тогда
		ЭлементыФормы.ОбластьПоиска.Картинка = ирОбщий.ПолучитьКартинкуКорневогоТипаЛкс(мИскомыйОбъект.ТипТаблицы);
	Иначе
		ЭлементыФормы.ОбластьПоиска.Картинка = Новый Картинка();
	КонецЕсли;
	ЭлементыФормы.Панель.Доступность = Доступность;
	ЭлементыФормы.КоманднаяПанельКомпоновки.Кнопки.ЗаполнитьСтроки.Доступность = Доступность;
	ЭлементыФормы.Панель.Страницы.НастройкаВыборки.Доступность = Доступность;
	//ЭлементыФормы.ОбластьПоиска.КнопкаСпискаВыбора = Не МноготабличнаяВыборка;
	Если Не ЭлементыФормы.Панель.ТекущаяСтраница.Доступность Тогда
		ЭлементыФормы.Панель.ТекущаяСтраница = ЭлементыФормы.Панель.Страницы.НастройкаВыборки;
	КонецЕсли;
	ДоступностьМногопоточности = ВыполнятьНаСервере И ЭлементыФормы.ВыполнятьНаСервере.Доступность И Не ирКэш.ЭтоФайловаяБазаЛкс();
	ЭлементыФормы.КоличествоПотоков.Доступность = ДоступностьМногопоточности;
	ЭлементыФормы.КоличествоОбъектовВПорции.Доступность = ДоступностьМногопоточности;
	ирОбщий.ОбновитьТекстПослеМаркераВСтрокеЛкс(ЭтаФорма.Заголовок,, "" + ОбластьПоиска, ": ");
	
КонецПроцедуры // НастроитьЭУ()

Процедура НастроитьСлужебныеКолонкиТабличногоПоляВыборки()
	
	Если МноготабличнаяВыборка Тогда
		КолонкаТП = ЭлементыФормы.СтрокиДляОбработки.Колонки[мИмяКолонкиПолногоИмениТаблицы];
		КолонкаТП.Данные = мИмяКолонкиПолногоИмениТаблицы;
		КолонкаТП.ТекстШапки = ПредставлениеСлужебнойКолонки(КолонкаТП.Данные);
		КолонкаТП.ТолькоПросмотр = Истина;
		КолонкаТП.ЦветТекстаПоля = WebЦвета.ТемноБордовый;
		КолонкаТП.ИзменятьВидимость = Ложь;
		КолонкаТП.Видимость = Истина;
		КолонкаТП.Ширина = 20;
		СтрокиДляОбработки.Колонки[КолонкаТП.Данные].Заголовок = КолонкаТП.ТекстШапки;
	КонецЕсли; 
	
	КолонкаТП = ЭлементыФормы.СтрокиДляОбработки.Колонки[мИмяКолонкиПометки];
	КолонкаТП.Данные = мИмяКолонкиПометки;
	КолонкаТП.ТекстШапки = ПредставлениеСлужебнойКолонки(КолонкаТП.Данные);
	КолонкаТП.ИзменятьВидимость = Ложь;
	КолонкаТП.Видимость = Истина;
	КолонкаТП.Ширина = 3;
	КолонкаТП.ИзменениеРазмера = ИзменениеРазмераКолонки.НеИзменять;
	КолонкаТП.ТолькоПросмотр = Ложь;
	СтрокиДляОбработки.Колонки[КолонкаТП.Данные].Заголовок = КолонкаТП.ТекстШапки;
	
	КолонкаТП = ЭлементыФормы.СтрокиДляОбработки.Колонки[мИмяКолонкиОтсутствияСтрокиВБД];
	КолонкаТП.Данные = "";
	КолонкаТП.Данные = мИмяКолонкиОтсутствияСтрокиВБД;
	КолонкаТП.ДанныеФлажка = мИмяКолонкиОтсутствияСтрокиВБД;
	КолонкаТП.ТекстШапки = ПредставлениеСлужебнойКолонки(КолонкаТП.Данные);
	КолонкаТП.ПодсказкаВШапке = "<Отсутствует: строка с таким ключом не найдена в БД>";
	КолонкаТП.ТолькоПросмотр = Истина;
	КолонкаТП.ИзменятьВидимость = Ложь;
	КолонкаТП.ЦветТекстаПоля = WebЦвета.ТемноСиний;
	КолонкаТП.Видимость = Истина;
	КолонкаТП.Ширина = 3;
	КолонкаТП.ИзменениеРазмера = ИзменениеРазмераКолонки.НеИзменять;
	СтрокиДляОбработки.Колонки[КолонкаТП.Данные].Заголовок = КолонкаТП.ТекстШапки;
	
	КолонкаТП = ЭлементыФормы.СтрокиДляОбработки.Колонки[мИмяКолонкиРезультатаОбработки];
	КолонкаТП.Данные = мИмяКолонкиРезультатаОбработки;
	КолонкаТП.ТекстШапки = ПредставлениеСлужебнойКолонки(КолонкаТП.Данные);
	КолонкаТП.ТолькоПросмотр = Истина;
	КолонкаТП.ЦветТекстаПоля = WebЦвета.ТемноСиний;
	КолонкаТП.ИзменятьВидимость = Ложь;
	КолонкаТП.Видимость = Истина;
	СтрокиДляОбработки.Колонки[КолонкаТП.Данные].Заголовок = КолонкаТП.ТекстШапки;
	
	КолонкаТП = ЭлементыФормы.СтрокиДляОбработки.Колонки[мИмяКолонкиСообщенияОбработки];
	КолонкаТП.Данные = мИмяКолонкиСообщенияОбработки;
	КолонкаТП.ТекстШапки = ПредставлениеСлужебнойКолонки(КолонкаТП.Данные);
	КолонкаТП.ТолькоПросмотр = Истина;
	КолонкаТП.ЦветТекстаПоля = WebЦвета.ТемноСиний;
	КолонкаТП.ИзменятьВидимость = Ложь;
	КолонкаТП.Видимость = Истина;
	СтрокиДляОбработки.Колонки[КолонкаТП.Данные].Заголовок = КолонкаТП.ТекстШапки;

КонецПроцедуры

Функция ПредставлениеСлужебнойКолонки(ИмяКолонки)
	Если ИмяКолонки = мИмяКолонкиПометки Тогда
		Результат = "<Пометка: нужно ли обрабатывать строку>";
	ИначеЕсли ИмяКолонки = мИмяКолонкиОтсутствияСтрокиВБД Тогда
		Результат = "<Отсутствует>";
	ИначеЕсли ИмяКолонки = мИмяКолонкиРезультатаОбработки Тогда
		Результат = "<Результат обработки>";
	ИначеЕсли ИмяКолонки = мИмяКолонкиСообщенияОбработки Тогда
		Результат = "<Сообщения>";
	ИначеЕсли ИмяКолонки = мИмяКолонкиПолногоИмениТаблицы Тогда
		Результат = "<Таблица>";
	КонецЕсли; 
	Возврат Результат;
КонецФункции

Процедура ОбновитьРазмерДинамическойТаблицы() Экспорт

	ирОбщий.ПослеЗагрузкиВыборкиВТабличноеПолеЛкс(ЭтаФорма, мВыборкаРезультата, ЭлементыФормы.КПСтрокиДляОбработки, ЭлементыФормы.КоличествоСтрок, СсылкаНаБуфернуюТаблицу);
	ВсеСчитано = Не ЭлементыФормы.КПСтрокиДляОбработки.Кнопки.ЗагрузитьПолностью.Доступность;
	ЭтотОбъект.ДинамическаяВыборка = ЭтотОбъект.ДинамическаяВыборка Или Не ВсеСчитано;
	ЭлементыФормы.ДинамическаяВыборка.Доступность = ВсеСчитано;
	ЭлементыФормы.КПСтрокиДляОбработки.Кнопки.УстановитьФлажки.Доступность = ВсеСчитано И Не ДинамическаяВыборка;
	ЭлементыФормы.КПСтрокиДляОбработки.Кнопки.СнятьПометкиУспешноОбработанных.Доступность = ВсеСчитано И Не ДинамическаяВыборка;
	ЭлементыФормы.КПСтрокиДляОбработки.Кнопки.СнятьФлажки.Доступность = ВсеСчитано И Не ДинамическаяВыборка;
	ЭлементыФормы.КПСтрокиДляОбработки.Кнопки.ЗаполнитьЗапросом.Доступность = ВсеСчитано И Не ДинамическаяВыборка;
	ЭлементыФормы.КПСтрокиДляОбработки.Кнопки.ПометитьНужноеКоличество.Доступность = ВсеСчитано И Не ДинамическаяВыборка;
	ЭлементыФормы.КПСтрокиДляОбработки.Кнопки.Подбор.Доступность = ВсеСчитано И Не ДинамическаяВыборка;
	Если ЗначениеЗаполнено(ОбластьПоиска) Тогда
		Если ЭлементыФормы.СтрокиДляОбработки.Колонки.Количество() > 0 Тогда
			ЭлементыФормы.СтрокиДляОбработки.Колонки[мИмяКолонкиПометки].Видимость = ВсеСчитано И Не ДинамическаяВыборка;
			ЭлементыФормы.СтрокиДляОбработки.Колонки[мИмяКолонкиРезультатаОбработки].Видимость = ВсеСчитано И Не ДинамическаяВыборка;
			ЭлементыФормы.СтрокиДляОбработки.Колонки[мИмяКолонкиСообщенияОбработки].Видимость = ВсеСчитано И Не ДинамическаяВыборка;
		КонецЕсли; 
	КонецЕсли; 
	ЭлементыФормы.СтрокиДляОбработки.ИзменятьСоставСтрок = ВсеСчитано И Не ДинамическаяВыборка;

КонецПроцедуры // ОбновитьРазмерТаблицы()

// Выполняет запрос и выгружает результат в таблицу значений.
//
// Параметры: 
//  Нет.
//
Процедура ЗаполнитьСтроки() Экспорт

	НастройкаКомпоновки = Неопределено;
	мЗапрос = ПолучитьЗапросВыборки(НастройкаКомпоновки);
	Если мЗапрос = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	Если Истина
		И ПараметрКлючТекущейСтроки = Неопределено 
		И Не МноготабличнаяВыборка
		И ЭлементыФормы.СтрокиДляОбработки.ТекущаяСтрока <> Неопределено 
	Тогда
		ПараметрКлючТекущейСтроки = ирОбщий.КлючСтрокиТаблицыБДИзСтрокиТаблицыЗначенийЛкс(ОбластьПоиска, ЭлементыФормы.СтрокиДляОбработки.ТекущаяСтрока, Истина);
	КонецЕсли; 
	#Если Сервер И Не Сервер Тогда
	    НастройкаКомпоновки = Новый НастройкиКомпоновкиДанных;
	#КонецЕсли
	мРезультатЗапроса = мЗапрос.Выполнить();
	мВопросНаОбновлениеСтрокДляОбработкиЗадавался = Истина;
	ЗагрузитьОтобранныеСтроки();
	ЗаполнитьКолонкиТабличногоПоляВыборки(НастройкаКомпоновки);
	ЭтотОбъект.ДинамическаяВыборка = Ложь;
	ДинамическаяВыборкаПриИзменении();
	ЭлементыФормы.Панель.ТекущаяСтраница = ЭлементыФормы.Панель.Страницы.Получить(1);
	//Для каждого Строка из СтрокиДляОбработки Цикл
	//	Строка[мИмяКолонкиПометки] = Истина;
	//КонецЦикла;
	СтрокиДляОбработки.ЗаполнитьЗначения(Истина, мИмяКолонкиПометки);
	СтрокиДляОбработки.ЗаполнитьЗначения(Ложь, мИмяКолонкиОтсутствияСтрокиВБД);
	АктивироватьКолонкуТекущегоВыбранногоПоля();
	ВосстановитьТекущуюСтрокуСтрокДляОбработки();
	НастроитьЭлементыФормы();

КонецПроцедуры

Процедура ВосстановитьТекущуюСтрокуСтрокДляОбработки()
	
	Если ПараметрКлючТекущейСтроки <> Неопределено Тогда
		Если ирОбщий.ПолучитьПолноеИмяМДТипаЛкс(ТипЗнч(ПараметрКлючТекущейСтроки)) = ОбластьПоиска Тогда
			Если ирОбщий.ЛиКлючЗаписиРегистраЛкс(ПараметрКлючТекущейСтроки) Тогда 
				ОтборСтрок = ирОбщий.СтруктураИзКлючаЗаписиЛкс(ПараметрКлючТекущейСтроки,, Истина);
			Иначе
				ОтборСтрок = Новый Структура("Ссылка", ПараметрКлючТекущейСтроки);
			КонецЕсли; 
			НоваяТекущаяСтрока = СтрокиДляОбработки.НайтиСтроки(ОтборСтрок);
			Если НоваяТекущаяСтрока.Количество() > 0 Тогда
				ЭлементыФормы.СтрокиДляОбработки.ТекущаяСтрока = НоваяТекущаяСтрока[0];
			КонецЕсли; 
		КонецЕсли; 
		ЭтаФорма.ПараметрКлючТекущейСтроки = Неопределено;
	КонецЕсли;

КонецПроцедуры

Процедура АктивироватьКолонкуТекущегоВыбранногоПоля()
	
	ТекущееВыбранноеПоле = ЭлементыФормы.КомпоновщикВыбор.ТекущаяСтрока;
	Если ТекущееВыбранноеПоле <> Неопределено Тогда
		Если Истина
			И ТипЗнч(ТекущееВыбранноеПоле) = Тип("ВыбранноеПолеКомпоновкиДанных")
			И ТекущееВыбранноеПоле.Использование
		Тогда
			НоваяТекущаяКолонка = ЭлементыФормы.СтрокиДляОбработки.Колонки.Найти(СтрЗаменить(ТекущееВыбранноеПоле.Поле, ".", ""));
			Если НоваяТекущаяКолонка <> Неопределено Тогда
				ЭлементыФормы.СтрокиДляОбработки.ТекущаяКолонка = НоваяТекущаяКолонка;
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли;

КонецПроцедуры

Процедура ЗагрузитьОтобранныеСтроки(ПерваяПорция = Истина)
	
	СсылкаНаБуфернуюТаблицу = Новый Структура;
	Если ПерваяПорция Тогда
		ирОбщий.ЗагрузитьВыборкуВТабличноеПолеПервуюПорциюЛкс(ЭтаФорма, мРезультатЗапроса, мВыборкаРезультата,
			ЭлементыФормы.КПСтрокиДляОбработки,,, СсылкаНаБуфернуюТаблицу);
	Иначе
		ирОбщий.ЗагрузитьВыборкуВТабличноеПолеПервуюПорциюЛкс(ЭтаФорма, мРезультатЗапроса, мВыборкаРезультата,
			ЭлементыФормы.КПСтрокиДляОбработки,, 0, СсылкаНаБуфернуюТаблицу);
	КонецЕсли; 
	ДобавитьСлужебныеКолонкиВТаблицуВыборки();

КонецПроцедуры

Процедура ЗаполнитьКолонкиТабличногоПоляВыборки(Знач НастройкаКомпоновки = Неопределено)
	
	Если ЭлементыФормы.СтрокиДляОбработки.ТекущаяКолонка <> Неопределено Тогда
		ИмяСтаройТекущейКолонки = ЭлементыФормы.СтрокиДляОбработки.ТекущаяКолонка.Имя;
	КонецЕсли; 
	Если НастройкаКомпоновки = Неопределено Тогда
		НастройкаКомпоновки = Компоновщик.Настройки;
	КонецЕсли; 
	ЭлементыФормы.СтрокиДляОбработки.СоздатьКолонки();
	КолонкиТабличногоПоля = ЭлементыФормы.СтрокиДляОбработки.Колонки;
	Для Каждого КолонкаТП Из КолонкиТабличногоПоля Цикл
		КолонкаТП.Видимость = Ложь;
	КонецЦикла;
	НастройкаКомпоновки = ирОбщий.СкопироватьНастройкиКомпоновкиЛкс(НастройкаКомпоновки,,,, Истина,, Истина);
	Для Каждого ЭлементПорядка Из НастройкаКомпоновки.Порядок.Элементы Цикл
		Если ЭлементПорядка.Использование И Компоновщик.Настройки.ДоступныеПоляВыбора.НайтиПоле(ЭлементПорядка.Поле) <> Неопределено Тогда
			ирОбщий.НайтиДобавитьЭлементНастроекКомпоновкиПоПолюЛкс(НастройкаКомпоновки.Выбор, ЭлементПорядка.Поле);
		КонецЕсли; 
	КонецЦикла;
	ЭлементыВыбора = НастройкаКомпоновки.Выбор.Элементы;
	КоличествоПолей = ЭлементыВыбора.Количество();
	Для Индекс = 0 По КоличествоПолей - 1 Цикл
		ПолеВыбора = ЭлементыВыбора[КоличествоПолей - 1 - Индекс];
		Если Не ПолеВыбора.Использование Тогда
			Продолжить;
		КонецЕсли;
		КлючИЗначение = ирОбщий.НайтиЭлементКоллекцииПоЗначениюСвойстваЛкс(мСхемаКолонок, "Значение", "" + ПолеВыбора.Поле);
		Если КлючИЗначение = Неопределено Тогда
			Продолжить;
		КонецЕсли; 
		ИмяПоля = КлючИЗначение.Ключ;
		КолонкаТП = КолонкиТабличногоПоля.Найти(ИмяПоля);
		Если КолонкаТП = Неопределено Тогда
			// Например реквизит ТЧ объекта
			Продолжить;
		КонецЕсли; 
		КолонкаТП.ТекстШапки = Компоновщик.Настройки.ДоступныеПоляВыбора.НайтиПоле(ПолеВыбора.Поле).Заголовок;
		КолонкиТабличногоПоля.Сдвинуть(КолонкаТП, -(КолонкиТабличногоПоля.Количество() - 1));
	КонецЦикла;
	Для Каждого КлючИЗначение Из мСхемаКолонок Цикл
		КолонкиТабличногоПоля[КлючИЗначение.Ключ].Видимость = Истина;
		КолонкиТабличногоПоля[КлючИЗначение.Ключ].ТолькоПросмотр = Истина;
	КонецЦикла;
	
	// Расставляем колонки табличного поля путем сдвига в начало в обратном визуальному порядке
	КолонкаТП = КолонкиТабличногоПоля[мИмяКолонкиСообщенияОбработки];
	КолонкаТП.Видимость = Истина;
	КолонкиТабличногоПоля.Сдвинуть(КолонкаТП, -(КолонкиТабличногоПоля.Количество() - 1));
	КолонкаТП = КолонкиТабличногоПоля[мИмяКолонкиРезультатаОбработки];
	КолонкаТП.Видимость = Истина;
	КолонкиТабличногоПоля.Сдвинуть(КолонкаТП, -(КолонкиТабличногоПоля.Количество() - 1));
	КолонкаТП = КолонкиТабличногоПоля[мИмяКолонкиОтсутствияСтрокиВБД];
	КолонкаТП.Видимость = Истина;
	КолонкиТабличногоПоля.Сдвинуть(КолонкаТП, -(КолонкиТабличногоПоля.Количество() - 1));
	Для Каждого КлючИЗначение Из мСтруктураКлюча Цикл
		КолонкаТП = КолонкиТабличногоПоля.Найти(КлючИЗначение.Ключ);
		КолонкиТабличногоПоля.Сдвинуть(КолонкаТП, -(КолонкиТабличногоПоля.Количество() - 1));
	КонецЦикла;
	Если МноготабличнаяВыборка Тогда
		КолонкаТП = КолонкиТабличногоПоля[мИмяКолонкиПолногоИмениТаблицы];
		КолонкаТП.Видимость = Истина;
		КолонкиТабличногоПоля.Сдвинуть(КолонкаТП, -(КолонкиТабличногоПоля.Количество() - 1));
	КонецЕсли; 
	ирОбщий.ТабличноеПолеВставитьКолонкуНомерСтрокиЛкс(ЭлементыФормы.СтрокиДляОбработки);
	ирОбщий.ТабличноеПолеРезультатаЗапросаНастроитьКолонкиЛкс(ЭлементыФормы.СтрокиДляОбработки, мСтарыеКолонкиТабличногоПоляРезультата);
	КолонкаТП = КолонкиТабличногоПоля[мИмяКолонкиПометки];
	КолонкаТП.Видимость = Истина;
	КолонкиТабличногоПоля.Сдвинуть(КолонкаТП, -КолонкиТабличногоПоля.Индекс(КолонкаТП));
	НастроитьСлужебныеКолонкиТабличногоПоляВыборки();
	НачальноеКоличество = КолонкиТабличногоПоля.Количество(); 
	Для СчетчикКолонкиТП = 1 По НачальноеКоличество Цикл
		КолонкаТП = КолонкиТабличногоПоля[НачальноеКоличество - СчетчикКолонкиТП];
		Если Не КолонкаТП.Видимость Тогда
			КолонкиТабличногоПоля.Удалить(КолонкаТП);
		КонецЕсли;
	КонецЦикла;
	Если ИмяСтаройТекущейКолонки <> Неопределено Тогда
		НоваяТекущаяКолонка = ЭлементыФормы.СтрокиДляОбработки.Колонки.Найти(ИмяСтаройТекущейКолонки);
		Если НоваяТекущаяКолонка <> Неопределено Тогда
			ЭлементыФормы.СтрокиДляОбработки.ТекущаяКолонка = НоваяТекущаяКолонка;
		КонецЕсли; 
	КонецЕсли; 

КонецПроцедуры

Функция ПолучитьЗапросВыборки(выхНастройкаКомпоновки =  Неопределено)

	выхНастройкаКомпоновки = ПолучитьИсполняемуюКомпоновку(выхНастройкаКомпоновки);
	Если выхНастройкаКомпоновки = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли; 
	мСхемаКолонок = Новый Структура();
	//Для Каждого НаборДанных Из МакетКомпоновки.НаборыДанных Цикл
	//	Для Каждого ПолеНабора Из НаборДанных.Поля Цикл
	//		СхемаКолонок.Вставить(ПолеНабора.Имя, ПолеНабора.ПутьКДанным);
	//	КонецЦикла;
	//КонецЦикла;
	Запрос = ирОбщий.ПолучитьЗапросИзКомпоновкиЛкс(мСхемаКомпоновки, выхНастройкаКомпоновки, Истина,,, мСхемаКолонок, Не БезАвтоупорядочивания);
	#Если Сервер И Не Сервер Тогда
		Запрос = Новый Запрос;
	#КонецЕсли
	ЗаменитьОбращенияКОтключеннымПолямВЗапросе(Запрос);
	Возврат Запрос;

КонецФункции

Процедура ЗаменитьОбращенияКОтключеннымПолямВЗапросе(Знач Запрос)
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "_ОтключенныеПоля_.__", "Т.");

КонецПроцедуры

Функция ПолучитьИсполняемуюКомпоновку(выхНастройкаКомпоновки = Неопределено)
    
	НастроитьКомпоновщик();
	
	Компоновщик.Восстановить();
	СписокПолейКлюча = ирОбщий.СтруктураКлючаТаблицыБДЛкс(ПолноеИмяПервойТаблицыБД(),, Ложь);
	выхНастройкаКомпоновки = Компоновщик.ПолучитьНастройки();
	СкопироватьПоляБитыхСсылокВОтборКомпоновки(выхНастройкаКомпоновки);
	ЭлементыВыбора = выхНастройкаКомпоновки.Выбор.Элементы;
	ЭлементыПорядка = выхНастройкаКомпоновки.Порядок.Элементы;
	Если АвтозаполнениеПорядка Тогда
		ЭлементыПорядка.Очистить();
	КонецЕсли; 
	Если МноготабличнаяВыборка Тогда
		ЭлементВыбора = ирОбщий.НайтиДобавитьЭлементНастроекКомпоновкиПоПолюЛкс(ЭлементыВыбора, мИмяКолонкиПолногоИмениТаблицы);
		ЭлементыВыбора.Сдвинуть(ЭлементВыбора, -(ЭлементыВыбора.Количество() - 1));
		Если АвтозаполнениеПорядка Тогда
			ЭлементПорядка = ирОбщий.НайтиДобавитьЭлементНастроекКомпоновкиПоПолюЛкс(выхНастройкаКомпоновки.Порядок, мИмяКолонкиПолногоИмениТаблицы);
			ЭлементыПорядка.Сдвинуть(ЭлементПорядка, -(ЭлементыПорядка.Количество() - 1));
		КонецЕсли;
	КонецЕсли; 
	Смещение = ЭлементыВыбора.Количество();
	КоличествоПолей = СписокПолейКлюча.Количество();
	Для Индекс = 0 По КоличествоПолей - 1 Цикл
		ЭлементСписка = СписокПолейКлюча[КоличествоПолей - 1 - Индекс];
		ДоступноеПоле = выхНастройкаКомпоновки.ДоступныеПоляВыбора.НайтиПоле(Новый ПолеКомпоновкиДанных(ЭлементСписка.Представление));
		Если ДоступноеПоле = Неопределено Тогда
			ирОбщий.СообщитьЛкс("Ключевое поле """ + ЭлементСписка.Представление + """ таблицы не найдено в доступных полях компоновки. На него или таблицу нет прав просмотра или не включена функциональная опция");
			Возврат Неопределено;
		КонецЕсли; 
		ЭлементВыбора = ирОбщий.НайтиДобавитьЭлементНастроекКомпоновкиПоПолюЛкс(ЭлементыВыбора, ЭлементСписка.Представление);
		ЭлементВыбора.Использование = Истина;
		ЭлементыВыбора.Сдвинуть(ЭлементВыбора, -(ЭлементыВыбора.Количество() - 1 - Смещение));
		Если АвтозаполнениеПорядка Тогда
			ЭлементПорядка = ирОбщий.НайтиДобавитьЭлементНастроекКомпоновкиПоПолюЛкс(выхНастройкаКомпоновки.Порядок, ЭлементСписка.Представление);
			ЭлементыПорядка.Сдвинуть(ЭлементПорядка, -ЭлементыПорядка.Индекс(ЭлементПорядка));
		КонецЕсли; 
	КонецЦикла;
	выхНастройкаКомпоновки.ПараметрыДанных.УстановитьЗначениеПараметра("СтрокаПоиска", "%" + СтрокаПоиска + "%");
	Если выхНастройкаКомпоновки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Узел")) <> Неопределено Тогда
		выхНастройкаКомпоновки.ПараметрыДанных.УстановитьЗначениеПараметра("Узел", УзелОтбораОбъектов);
	КонецЕсли; 
	Если АвтовВыбранныеПоляИзОтбора Тогда
		ДобавитьПоляЭлементовОтбораВВырабнныеПоля(выхНастройкаКомпоновки, выхНастройкаКомпоновки.Отбор);
	КонецЕсли;
	Если ВыбратьВсеПоля И "" + Компоновщик.Настройки.Выбор = "" Тогда
		Для Каждого ДоступноеПолеВыбора Из Компоновщик.Настройки.ДоступныеПоляВыбора.Элементы Цикл
			Если ДоступноеПолеВыбора.Папка Тогда
				Продолжить;
			КонецЕсли; 
			ирОбщий.НайтиДобавитьЭлементНастроекКомпоновкиПоПолюЛкс(ЭлементыВыбора, ДоступноеПолеВыбора.Поле);
		КонецЦикла; 
	КонецЕсли; 
	Возврат выхНастройкаКомпоновки;

КонецФункции

Процедура ДобавитьПоляЭлементовОтбораВВырабнныеПоля(Знач НастройкаКомпоновки, Знач ГруппаОтбора)
	
	#Если Сервер И Не Сервер Тогда
		НастройкаКомпоновки = Новый НастройкиКомпоновкиДанных;
		ГруппаОтбора = НастройкаКомпоновки.Отбор.Элементы.Добавить();
	#КонецЕсли
	Для Каждого ЭлементОтбора Из ГруппаОтбора.Элементы Цикл
		Если Не ЭлементОтбора.Использование Тогда 
			Продолжить;
		КонецЕсли; 
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			ДобавитьПолеЭлементаОтбораВВыбранныеПоля(НастройкаКомпоновки, ЭлементОтбора.ЛевоеЗначение);
			ДобавитьПолеЭлементаОтбораВВыбранныеПоля(НастройкаКомпоновки, ЭлементОтбора.ПравоеЗначение);
		Иначе
			ДобавитьПоляЭлементовОтбораВВырабнныеПоля(НастройкаКомпоновки, ЭлементОтбора);
		КонецЕсли; 
	КонецЦикла;

КонецПроцедуры

Функция ПолноеИмяПервойТаблицыБД()
	
	Возврат ?(МноготабличнаяВыборка, ОбластьПоиска[0].Значение, ОбластьПоиска);

КонецФункции

Процедура ДобавитьПолеЭлементаОтбораВВыбранныеПоля(Знач выхНастройкаКомпоновки, Знач ПолеКомпоновки)
	
	#Если Сервер И Не Сервер Тогда
		выхНастройкаКомпоновки = Новый НастройкиКомпоновкиДанных;
	#КонецЕсли
	Если Истина
		И ТипЗнч(ПолеКомпоновки) = Тип("ПолеКомпоновкиДанных")
		И выхНастройкаКомпоновки.ДоступныеПоляВыбора.НайтиПоле(ПолеКомпоновки) <> Неопределено 
	Тогда
		ВыбранноеПоле = ирОбщий.НайтиДобавитьЭлементНастроекКомпоновкиПоПолюЛкс(выхНастройкаКомпоновки.Выбор.Элементы, ПолеКомпоновки);
		ВыбранноеПоле.Использование = Истина;
	КонецЕсли;

КонецПроцедуры

Процедура СкопироватьПоляБитыхСсылокВОтборКомпоновки(НастройкаКомпоновки = Неопределено)
	
	Если НастройкаКомпоновки = Неопределено Тогда
		НастройкаКомпоновки = Компоновщик.Настройки;
	КонецЕсли; 
	Для Каждого ПолеБитыхСсылок Из ПоляБитыхСсылок.НайтиСтроки(Новый Структура("Пометка", Истина)) Цикл
		ГруппаОтбора = НастройкаКомпоновки.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ГруппаОтбора.Использование = Истина;
		ГруппаОтбора.Представление = ПолеБитыхСсылок.Заголовок + " Не существует";
		ирОбщий.НайтиДобавитьЭлементОтбораКомпоновкиЛкс(ГруппаОтбора, ПолеБитыхСсылок.Поле, , ВидСравненияКомпоновкиДанных.Заполнено,, Ложь);
		ирОбщий.НайтиДобавитьЭлементОтбораКомпоновкиЛкс(ГруппаОтбора, ПолеБитыхСсылок.Поле + ".ПометкаУдаления", , ВидСравненияКомпоновкиДанных.НеЗаполнено,, Ложь);
	КонецЦикла;

КонецПроцедуры

Процедура ОбновитьДоступностьКнопкиСнятьПометкиУспешноОбработанных() Экспорт
	
	ЭлементыФормы.КПСтрокиДляОбработки.Кнопки.СнятьПометкиУспешноОбработанных.Доступность = СтрокиДляОбработки.Колонки.Найти(мИмяКолонкиРезультатаОбработки) <> Неопределено;
	
КонецПроцедуры

// Формирует текст запроса.
//
// Параметры: 
//  УсловиеПоискаПоСтроке - строка поиска.
//
Функция ПолучитьТекстЗапроса()

	Условие = "";
	ТекстЗапроса = "ВЫБРАТЬ ";
	Если ЗначениеЗаполнено(ПервыеNКаждойТаблицы) Тогда
		ТекстЗапроса = ТекстЗапроса + "ПЕРВЫЕ " + XMLСтрока(ПервыеNКаждойТаблицы) + " ";
	КонецЕсли; 
	ТекстРеквизитов = "";
	//ТекстОтключенныхРеквизитов = "";
	//ПолноеИмяМД = ИскомыйОбъект.МетаОбъект.ПолноеИмя();
	ЭтаФорма.КоллекцияОтключенныхПолей = Новый ТаблицаЗначений;
	ЭтаФорма.КоллекцияОтключенныхПолей = КоллекцияОтключенныхПолей.Колонки;
	ПолноеИмяМД = ОбластьПоиска;
	КомпоновщикТаблицы = ирОбщий.КомпоновщикТаблицыМетаданныхЛкс(ПолноеИмяМД);
	#Если Сервер И Не Сервер Тогда
		КомпоновщикТаблицы = Новый КомпоновщикНастроекКомпоновкиДанных;
	#КонецЕсли
	ПоляТаблицыБД = ирОбщий.ПолучитьПоляТаблицыМДЛкс(ПолноеИмяМД);
	#Если Сервер И Не Сервер Тогда
		ПоляТаблицыБД = НайтиПоСсылкам().Колонки;
	#КонецЕсли
	Для Каждого ПолеТаблицыБД Из ПоляТаблицыБД Цикл
		//Если ПолеТаблицыБД.ТипЗначения.СодержитТип(Тип("ТаблицаЗначений")) Тогда
		//	Продолжить;
		//КонецЕсли;
		//ТекстРеквизитов = ТекстРеквизитов + ", " + Символы.ПС + "Т." + ДоступноеПоле.Имя + " КАК " + ДоступноеПоле.Имя; // запрещенные имена например "Соединение" так вызывают ошибку
		
		//ЛиПолеВидимоПользователю = ЛиТаблицаВидимаПользователю;
		//Если ЛиПолеВидимоПользователю И ПолеТаблицыБД.Метаданные <> Неопределено Тогда
		//	ирОбщий.ФункциональныеОпцииОбъектаМДЛкс(ПолеТаблицыБД.Метаданные,,, ЛиПолеВидимоПользователю);
		//	ЛиПолеВидимоПользователю = ЛиПолеВидимоПользователю И ПравоДоступа("Просмотр", ПолеТаблицыБД.Метаданные);
		//КонецЕсли; 
		ЛиПолеВидимоПользователю = КомпоновщикТаблицы.Настройки.ДоступныеПоляВыбора.НайтиПоле(Новый ПолеКомпоновкиДанных(ПолеТаблицыБД.Имя)) <> Неопределено;

		Если ЛиПолеВидимоПользователю Тогда
			ТекстРеквизитов = ТекстРеквизитов + ", " + Символы.ПС + "Т." + ПолеТаблицыБД.Имя + " КАК " + ПолеТаблицыБД.Имя;
		Иначе
			//ТекстОтключенныхРеквизитов = ТекстОтключенныхРеквизитов + ", " + Символы.ПС + ирОбщий.ПустоеЗначениеПоТипуНаЯзыкеЗапросовЛкс(ПолеТаблицыБД.ТипЗначения) + " КАК _" + ПолеТаблицыБД.Имя + "_";
			ТекстРеквизитов = ТекстРеквизитов + ", " + Символы.ПС + "_ОтключенныеПоля_.__" + ПолеТаблицыБД.Имя + " КАК " + ПолеТаблицыБД.Имя;
			КоллекцияОтключенныхПолей.Добавить("__" + ПолеТаблицыБД.Имя, ПолеТаблицыБД.ТипЗначения);
		КонецЕсли; 
	КонецЦикла; 
	Если ТекстРеквизитов = "" Тогда
		Возврат "";
	КонецЕсли;
	//Если КоллекцияОтключенныхПолей.Количество() > 0 Тогда
	//	ТекстЗапроса = ирОбщий.ПолучитьЗапросИмитаторКоллекцииПолейЛкс(КоллекцияОтключенныхПолей) + "
	//	|ПОМЕСТИТЬ ОтключенныеПоля
	//	|;
	//	|" + ТекстЗапроса;
	//КонецЕсли; 
	ТекстЗапроса = ТекстЗапроса + Сред(ТекстРеквизитов, 2) + ", 0 КАК " + мИмяСлужебногоПоля;
	ПолноеИмяТаблицыБД = ирОбщий.ИмяТаблицыИзМетаданныхЛкс(ПолноеИмяМД);
	ТекстУсловияСоединенияПодчиненныхТаблиц = "";
	ТекстГде = "";
	мИменаКоличестваПодчиненных = Новый Структура;
	Если ПодключатьПоляКоличестваДвижений Тогда
		ТекстОбщееКоличествоДвижений = "";
		ТекстОбщееКоличествоСтрокТЧ = "";
		Если ирОбщий.ЛиКорневойТипДокументаЛкс(мИскомыйОбъект.ТипТаблицы) Тогда
			Для Каждого МетаРегистр Из мИскомыйОбъект.Метаобъект.Движения Цикл
				ДобавитьДоступныйОтборПоКоличествуСтрокПодчиненнойТаблицы(МетаРегистр.Имя, "Регистратор", МетаРегистр.ПолноеИмя(), ТекстОбщееКоличествоДвижений, ТекстУсловияСоединенияПодчиненныхТаблиц, "Регистр");
			КонецЦикла;
		КонецЕсли; 
		Если ирОбщий.ЛиКорневойТипСсылочногоОбъектаБДЛкс(мИскомыйОбъект.ТипТаблицы) Тогда
			СтруктураТЧ = ирОбщий.ТабличныеЧастиОбъектаЛкс(мИскомыйОбъект.Метаобъект);
			Для Каждого ОписаниеТЧ Из СтруктураТЧ Цикл
				ДобавитьДоступныйОтборПоКоличествуСтрокПодчиненнойТаблицы(ОписаниеТЧ.Ключ, "Ссылка", ПолноеИмяМД + "." + ОписаниеТЧ.Ключ, ТекстОбщееКоличествоСтрокТЧ, ТекстУсловияСоединенияПодчиненныхТаблиц, "ТЧ");
			КонецЦикла;
		КонецЕсли; 
		Если ЗначениеЗаполнено(ТекстОбщееКоличествоДвижений) Тогда
			ТекстУсловияСоединенияПодчиненныхТаблиц = ТекстУсловияСоединенияПодчиненныхТаблиц + "
			|{ГДЕ " + ТекстОбщееКоличествоДвижений + " КАК КоличествоСтрокВсеРегистры}";
			ТекстЗапроса = ТекстЗапроса + ",
			|" + ТекстОбщееКоличествоДвижений + " КАК КоличествоСтрокВсеРегистры";
			мИменаКоличестваПодчиненных.Вставить("КоличествоСтрокВсеРегистры", "Все регистры");
		КонецЕсли; 
		Если ЗначениеЗаполнено(ТекстОбщееКоличествоСтрокТЧ) Тогда
			ТекстУсловияСоединенияПодчиненныхТаблиц = ТекстУсловияСоединенияПодчиненныхТаблиц + "
			|{ГДЕ " + ТекстОбщееКоличествоСтрокТЧ + " КАК КоличествоСтрокВсеТабличныеЧасти}";
			ТекстЗапроса = ТекстЗапроса + ",
			|" + ТекстОбщееКоличествоСтрокТЧ + " КАК КоличествоСтрокВсеТабличныеЧасти";
			мИменаКоличестваПодчиненных.Вставить("КоличествоСтрокВсеТабличныеЧасти", "Все табличные части");
		КонецЕсли; 
	КонецЕсли; 
	ТекстЗапроса = ТекстЗапроса + Символы.ПС + "ИЗ" + Символы.ПС + ирОбщий.ПолучитьОпределениеТаблицыБДДляИЗЛкс(ПолноеИмяТаблицыБД) + " КАК Т" + Символы.ПС;
	Если КоллекцияОтключенныхПолей.Количество() > 0 Тогда
		//ТекстЗапроса = ТекстЗапроса + " {ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтключенныеПоля КАК _ОтключенныеПоля_ ПО ИСТИНА}" + Символы.ПС;
		ТекстЗапроса = ТекстЗапроса + " {ВНУТРЕННЕЕ СОЕДИНЕНИЕ (" + ирОбщий.ПолучитьЗапросИмитаторКоллекцииПолейЛкс(КоллекцияОтключенныхПолей) + ") КАК _ОтключенныеПоля_ ПО ИСТИНА}" + Символы.ПС;
	КонецЕсли; 
	Если Истина
		И ИспользоватьОтборПоУзлу 
		И ЗначениеЗаполнено(УзелОтбораОбъектов) 
	Тогда
		Если ирОбщий.ЕстьТаблицаИзмененийОбъектаМетаданных(мИскомыйОбъект.Метаобъект) Тогда
			ТекстУсловияСоединения = "_Изменения_.Узел = &Узел";
			СтруктураКлючаИзменений = ирОбщий.СтруктураКлючаТаблицыБДЛкс(ПолноеИмяТаблицыБД + ".Изменения");
			Для Каждого КлючИЗначение Из СтруктураКлючаИзменений Цикл
				Если ирОбщий.СтрокиРавныЛкс(КлючИЗначение.Ключ, "Узел") Тогда
					Продолжить;
				КонецЕсли; 
				Если ТекстУсловияСоединения <> "" Тогда
					ТекстУсловияСоединения = ТекстУсловияСоединения + Символы.ПС + "	И";
				КонецЕсли;
				ТекстУсловияСоединения = ТекстУсловияСоединения + " _Изменения_." + КлючИЗначение.Ключ + " = Т." + КлючИЗначение.Ключ;
			КонецЦикла;
			ТекстЗапроса = ТекстЗапроса + Символы.ПС + " ВНУТРЕННЕЕ СОЕДИНЕНИЕ " + ПолноеИмяТаблицыБД + ".Изменения КАК _Изменения_
				|	ПО " + ТекстУсловияСоединения;
		Иначе
			//ирОбщий.СообщитьЛкс("У таблицы нет таблицы изменений. Отбор по узлу игнорирован.");
		КонецЕсли; 
	КонецЕсли; 
	Если ЗначениеЗаполнено(ТекстУсловияСоединенияПодчиненныхТаблиц) Тогда
		ТекстЗапроса = ТекстЗапроса + ТекстУсловияСоединенияПодчиненныхТаблиц;
	КонецЕсли; 
	Если Условие <> "" Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|{ГДЕ " + Условие + "}";
	КонецЕсли;
	Возврат ТекстЗапроса;

КонецФункции

Процедура ДобавитьДоступныйОтборПоКоличествуСтрокПодчиненнойТаблицы(Знач КраткоеИмяПодчиненнойТаблицы, Знач ПолеСсылкиВПодчиненнойТаблице, Знач ПолноеИмяПодчиненнойТаблицы,
	ТекстОбщееКоличествоДвижений, ТекстУсловияСоединенияПодчиненныхТаблиц, Знач ПрефиксИмениПоля)
	
	ИмяПоля = "КоличествоСтрок_" + ПрефиксИмениПоля+ "_" + КраткоеИмяПодчиненнойТаблицы;
	ТекстУсловияСоединенияПодчиненныхТаблиц = ТекстУсловияСоединенияПодчиненныхТаблиц + Символы.ПС + " { ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ _Регистр_." + ПолеСсылкиВПодчиненнойТаблице + ", КОЛИЧЕСТВО(*) КАК КоличествоСтрок873484287
	|	ИЗ " + ПолноеИмяПодчиненнойТаблицы + " КАК _Регистр_ СГРУППИРОВАТЬ ПО _Регистр_." + ПолеСсылкиВПодчиненнойТаблице + ") КАК " + КраткоеИмяПодчиненнойТаблицы + "Т" + "
	|	ПО " + КраткоеИмяПодчиненнойТаблицы + "Т" + "." + ПолеСсылкиВПодчиненнойТаблице + " = Т.Ссылка}";
	Если ТекстОбщееКоличествоДвижений <> "" Тогда
		ТекстОбщееКоличествоДвижений = ТекстОбщееКоличествоДвижений + " + ";
	КонецЕсли; 
	ВыражениеКоличества = "ЕСТЬNULL(" + КраткоеИмяПодчиненнойТаблицы + "Т" + ".КоличествоСтрок873484287, 0)";
	ТекстОбщееКоличествоДвижений = ТекстОбщееКоличествоДвижений + ВыражениеКоличества;
	ТекстОбщееКоличествоДвижений = ВыражениеКоличества + " КАК " + ИмяПоля + ",
	|" + ТекстОбщееКоличествоДвижений;
	мИменаКоличестваПодчиненных.Вставить(ИмяПоля, ПрефиксИмениПоля + " " + КраткоеИмяПодчиненнойТаблицы);

КонецПроцедуры

Процедура НастроитьКомпоновщик(СохранятьТекущиеНастройки = Истина, ЗагружатьТекущиеНастройки = Ложь, НастройкиНабораТаблицБД = Неопределено)

	Если мИскомыйОбъект = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если СохранятьТекущиеНастройки Тогда
		СохранитьНастройкиТекущейТаблицы();
	КонецЕсли;
	Если МноготабличнаяВыборка Тогда
		ОбластьПоиска.СортироватьПоЗначению();
		ИменаОбъектовМД = ОбластьПоиска.ВыгрузитьЗначения();
		ВариантИсточников = 0;
		Если Истина
			И ИспользоватьОтборПоУзлу 
			И ЗначениеЗаполнено(УзелОтбораОбъектов) 
		Тогда
			ВариантИсточников = 2;
		КонецЕсли; 
		ТекстЗапроса = ирОбщий.ТекстЗапросаПоВыбраннымТаблицамЛкс(ИменаОбъектовМД, ВариантИсточников, ПервыеNКаждойТаблицы, ПодключатьПоляКоличестваДвижений, мИмяКолонкиПолногоИмениТаблицы);
		НовыйКлючНабораТаблицБД = ирОбщий.СтрСоединитьЛкс(ИменаОбъектовМД, ",");
	Иначе
		Если мИскомыйОбъект.МетаОбъект = Неопределено Тогда
			Возврат;
		КонецЕсли; 
		НовыйКлючНабораТаблицБД = мИскомыйОбъект.МетаОбъект.ПолноеИмя();
		МетаданныеОбъекта = ирОбщий.ПолучитьМетаданныеЛкс(ОбластьПоиска);
		ТекстЗапроса = ПолучитьТекстЗапроса();
		Если Не ЗначениеЗаполнено(ТекстЗапроса) Тогда
			мИскомыйОбъект.МетаОбъект = Неопределено;
			Возврат;
		КонецЕсли; 
	КонецЕсли; 
	СтароеИмяТекущегоПоля = Неопределено;
	Если ЭлементыФормы.КомпоновщикДоступныеПоляОтбора.ТекущаяСтрока <> Неопределено Тогда
		СтароеИмяТекущегоПоля = "" + ЭлементыФормы.КомпоновщикДоступныеПоляОтбора.ТекущаяСтрока.Поле;
	КонецЕсли; 
	лЗапрос = Новый Запрос;
	лЗапрос.Текст = ТекстЗапроса;
	лСхемаКомпоновки = ирОбщий.СоздатьСхемуКомпоновкиПоЗапросу(лЗапрос);
	#Если Сервер И Не Сервер Тогда
	    лСхемаКомпоновки = Новый СхемаКомпоновкиДанных;
	#КонецЕсли
	лКомпоновщик = Новый КомпоновщикНастроекКомпоновкиДанных;
	лКомпоновщик.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(лСхемаКомпоновки));
	УсловиеПоискаПоСтроке = "";
	//лСтрокаПоиска = СтрЗаменить(СтрокаПоиска, """", """""");
	Для Каждого ДоступноеПоле Из лКомпоновщик.Настройки.ДоступныеПоляОтбора.Элементы Цикл
		Если КоллекцияОтключенныхПолей.Найти("" + ДоступноеПоле.Поле) <> Неопределено Тогда
			Продолжить;
		КонецЕсли; 
		Если Истина
			И СтрокаПоиска <> ""
			И ДоступноеПоле.ТипЗначения.СодержитТип(Тип("Строка")) 
		Тогда
			// Антибаг платформы 8.2.15 http://partners.v8.1c.ru/forum/thread.jsp?id=1068452#1068452
			Если Истина
				И НРег(ДоступноеПоле.Поле) = НРег("ВерсияДанных")
				И ирОбщий.ЛиКорневойТипСсылкиЛкс(мИскомыйОбъект.ТипТаблицы)
			Тогда
				Продолжить;
			КонецЕсли; 
			Если Истина
				И МноготабличнаяВыборка
				И "" + ДоступноеПоле.Поле = мИмяКолонкиПолногоИмениТаблицы
			Тогда
				Продолжить;
			КонецЕсли; 
			Если УсловиеПоискаПоСтроке <> "" Тогда
				УсловиеПоискаПоСтроке = УсловиеПоискаПоСтроке + " ИЛИ ";
			КонецЕсли;
			УсловиеПоискаПоСтроке = УсловиеПоискаПоСтроке + " Т." + ДоступноеПоле.Поле + " ПОДОБНО &СтрокаПоиска";
			//УсловиеПоискаПоСтроке = УсловиеПоискаПоСтроке + " ВЫРАЗИТЬ(Т." + ДоступноеПоле.Поле + " КАК СТРОКА) ПОДОБНО &СтрокаПоиска";
		КонецЕсли;
		Если ДоступноеПоле.ТипЗначения.Типы().Количество() > 1 Тогда
			ПсевдонимПоля = "" + ДоступноеПоле.Поле + "_ТипЗначения_";
			Если КоллекцияОтключенныхПолей.Найти("__" + ДоступноеПоле.Поле) <> Неопределено Тогда
				ПутьКПолю = "_ОтключенныеПоля_.__";
				КоллекцияОтключенныхПолей.Добавить("__" + ПсевдонимПоля, Новый ОписаниеТипов("Тип"));
			Иначе
				ПутьКПолю = "Т.";
			КонецЕсли; 
			// Такая проверка на регистре бухгалтерии вызывает ложную ошибку http://www.hostedredmine.com/issues/858975
			//ТекстЗапроса = ирОбщий.СтрЗаменитьЛкс(ТекстЗапроса, ПутьКПолю + ДоступноеПоле.Поле + " КАК " + ДоступноеПоле.Поле + ",", ПутьКПолю + ДоступноеПоле.Поле + " КАК " + ДоступноеПоле.Поле + ",
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ПутьКПолю + ДоступноеПоле.Поле + " КАК " + ДоступноеПоле.Поле + ",", ПутьКПолю + ДоступноеПоле.Поле + " КАК " + ДоступноеПоле.Поле + ",
			|ТИПЗНАЧЕНИЯ(" + ПутьКПолю + ДоступноеПоле.Поле + ") КАК " + ПсевдонимПоля + ",");
			Если МноготабличнаяВыборка Тогда
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "НЕОПРЕДЕЛЕНО КАК " + ДоступноеПоле.Поле + ",", "НЕОПРЕДЕЛЕНО КАК " + ДоступноеПоле.Поле + ",
				|ТИПЗНАЧЕНИЯ(НЕОПРЕДЕЛЕНО) КАК " + ПсевдонимПоля + ",");
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла;
	мТекстЗапросаБезУсловий = ТекстЗапроса;
	Если УсловиеПоискаПоСтроке <> "" Тогда
		Если МноготабличнаяВыборка Тогда
			ТекстЗапроса = "ВЫБРАТЬ Т.* ИЗ (" + ТекстЗапроса + ") КАК Т ГДЕ " + УсловиеПоискаПоСтроке; 
		Иначе
			ТекстЗапроса = ТекстЗапроса + "
			|ГДЕ " + УсловиеПоискаПоСтроке;
		КонецЕсли;
	КонецЕсли; 
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.Параметры.Вставить("СтрокаПоиска", "");
	ПредставленияПолей = Неопределено;
	Если ИмяСиноним Тогда
		ВременнаяСхема = ирОбщий.СоздатьСхемуКомпоновкиПоЗапросу(Запрос);
		ВременныйКомпоновщикЗапроса = Новый КомпоновщикНастроекКомпоновкиДанных;
		ВременныйКомпоновщикЗапроса.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(ВременнаяСхема));
		ПредставленияПолей = Новый Структура;
		ДобавитьПредставленияПолей(ВременныйКомпоновщикЗапроса.Настройки.ДоступныеПоляВыбора.Элементы, ПредставленияПолей);
	КонецЕсли; 
	мСхемаКомпоновки = ирОбщий.СоздатьСхемуКомпоновкиПоЗапросу(Запрос,, ПредставленияПолей);
	#Если Сервер И Не Сервер Тогда
	    мСхемаКомпоновки = Новый СхемаКомпоновкиДанных;
	#КонецЕсли
	СлужебноеПолеНабора = мСхемаКомпоновки.НаборыДанных[0].Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	СлужебноеПолеНабора.ПутьКДанным = мИмяСлужебногоПоля;
	СлужебноеПолеНабора.Поле = СлужебноеПолеНабора.ПутьКДанным;
	ирОбщий.УстановитьОграниченияИспользованияПоляНабораДанныхСхемыКомпоновкиЛкс(СлужебноеПолеНабора, Истина);
	Если ПодключатьПоляКоличестваДвижений Тогда
		СлужебноеПолеНабора = мСхемаКомпоновки.НаборыДанных[0].Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		СлужебноеПолеНабора.ПутьКДанным = "КоличествоСтрок873484287";
		СлужебноеПолеНабора.Поле = СлужебноеПолеНабора.ПутьКДанным;
		ирОбщий.УстановитьОграниченияИспользованияПоляНабораДанныхСхемыКомпоновкиЛкс(СлужебноеПолеНабора, Истина);
		Для Каждого КлючИЗначение Из мИменаКоличестваПодчиненных Цикл
			СлужебноеПолеНабора = мСхемаКомпоновки.НаборыДанных[0].Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
			СлужебноеПолеНабора.ПутьКДанным = "КоличествоПодчиненныхСтрок." + КлючИЗначение.Ключ;
			СлужебноеПолеНабора.Заголовок = "Количество подчиненных строк." + КлючИЗначение.Значение;
			СлужебноеПолеНабора.Поле = КлючИЗначение.Ключ;
		КонецЦикла;
	КонецЕсли;
	Для Каждого ОтключенноеПоле Из КоллекцияОтключенныхПолей Цикл
		СлужебноеПолеНабора = мСхемаКомпоновки.НаборыДанных[0].Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		СлужебноеПолеНабора.ПутьКДанным = ОтключенноеПоле.Имя;
		СлужебноеПолеНабора.Поле = СлужебноеПолеНабора.ПутьКДанным;
		ирОбщий.УстановитьОграниченияИспользованияПоляНабораДанныхСхемыКомпоновкиЛкс(СлужебноеПолеНабора, Истина);
	КонецЦикла;
	Если ирОбщий.ЛиКорневойТипКонстантыЛкс(мИскомыйОбъект.ТипТаблицы) Тогда
		СтрокаПоляЗначение = мСхемаКомпоновки.НаборыДанных[0].Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		СтрокаПоляЗначение.Поле = "Значение";
		СтрокаПоляЗначение.ПутьКДанным = "Значение";
		СтрокаПоляЗначение.Заголовок = "Значение";
	КонецЕсли;
	Если МноготабличнаяВыборка Тогда
		СлужебноеПолеНабора = мСхемаКомпоновки.НаборыДанных[0].Поля.Найти(мИмяКолонкиПолногоИмениТаблицы);
		Если СлужебноеПолеНабора = Неопределено Тогда
			СлужебноеПолеНабора = мСхемаКомпоновки.НаборыДанных[0].Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
			СлужебноеПолеНабора.ПутьКДанным = мИмяКолонкиПолногоИмениТаблицы;
		КонецЕсли; 
		СлужебноеПолеНабора.Заголовок = ПредставлениеСлужебнойКолонки(мИмяКолонкиПолногоИмениТаблицы);
		СлужебноеПолеНабора.Поле = мИмяКолонкиПолногоИмениТаблицы;
	КонецЕсли; 
	#Если Сервер И Не Сервер Тогда
	    мСхемаКомпоновки = Новый СхемаКомпоновкиДанных
	#КонецЕсли
	мСхемаКомпоновки.Параметры.Найти("СтрокаПоиска").ВключатьВДоступныеПоля = Ложь;
	
	//Если ирОбщий.ЛиКорневойТипСсылочногоОбъектаБДЛкс(мИскомыйОбъект.ТипТаблицы) Тогда
	//	// Для зашиты от переименования полей Ссылка.<ИмяПоля> в <ИмяПоля>1 при генерации макета компоновки убираем доступность дочерних полей Ссылка.*
	//	ПолеНабораСсылка = мСхемаКомпоновки.НаборыДанных[0].Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	//	ПолеНабораСсылка.Поле = "Ссылка";
	//	ПолеНабораСсылка.ПутьКДанным = "Ссылка";
	//	ПолеНабораСсылка.ОграничениеИспользованияРеквизитов.Условие = Истина;
	//	ПолеНабораСсылка.ОграничениеИспользованияРеквизитов.Поле = Истина;
	//	ПолеНабораСсылка.ОграничениеИспользованияРеквизитов.Порядок = Истина;
	//КонецЕсли; 
	
	Компоновщик.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(мСхемаКомпоновки));
	ИменаПолейБитыхСсылок = Новый Массив;
	Если СохранятьТекущиеНастройки Тогда
		ИменаПолейБитыхСсылок = ПоляБитыхСсылок.Скопировать(Новый Структура("Пометка", Истина)).ВыгрузитьКолонку("Поле");
		ТекущееПолеБитыхСсылок = ЭлементыФормы.ПоляБитыхСсылок.ТекущаяСтрока;
		Если ТекущееПолеБитыхСсылок <> Неопределено Тогда
			ТекущееПолеБитыхСсылок = ТекущееПолеБитыхСсылок.Поле;
		КонецЕсли; 
	КонецЕсли; 
	ПоляБитыхСсылок.Очистить();
	Для Каждого ДоступноеПоле Из Компоновщик.Настройки.ДоступныеПоляОтбора.Элементы Цикл
		Для Каждого Тип Из ДоступноеПоле.ТипЗначения.Типы() Цикл
			Если ирОбщий.ЛиТипСсылкиБДЛкс(Тип) Тогда 
				ПолеБитыхСсылок = ПоляБитыхСсылок.Добавить();
				ПолеБитыхСсылок.Поле = ДоступноеПоле.Поле;
				ПолеБитыхСсылок.Заголовок = ДоступноеПоле.Заголовок;
				ПолеБитыхСсылок.ОписаниеТипов = ДоступноеПоле.ТипЗначения;
				Если ТекущееПолеБитыхСсылок = ПолеБитыхСсылок.Поле Тогда
					ЭлементыФормы.ПоляБитыхСсылок.ТекущаяСтрока = ПолеБитыхСсылок;
				КонецЕсли; 
				Прервать;
			КонецЕсли; 
		КонецЦикла;
	КонецЦикла;
	УстановитьПометкиПолейБитыхСсылок(ИменаПолейБитыхСсылок);
	//УстановитьПредставленияПолей();
	КлючНабораТаблицБД = НовыйКлючНабораТаблицБД;
	Если ЗагружатьТекущиеНастройки Тогда
		Если НастройкиНабораТаблицБД = Неопределено Тогда
			НастройкиНабораТаблицБД = НастройкиКомпоновки[КлючНабораТаблицБД];
		КонецЕсли; 
		Если ТипЗнч(НастройкиНабораТаблицБД) = Тип("НастройкиКомпоновкиДанных") Тогда
			// Устарело
			Компоновщик.ЗагрузитьНастройки(НастройкиНабораТаблицБД);
		ИначеЕсли ТипЗнч(НастройкиНабораТаблицБД) = Тип("Структура") Тогда
			ЗагрузитьСтруктуруНастроекТекущейТаблицы(НастройкиНабораТаблицБД);
		КонецЕсли;
	КонецЕсли; 
	Если Компоновщик.Настройки.Порядок.Элементы.Количество() = 0 Тогда
		Если ирОбщий.ЛиКорневойТипСсылкиЛкс(мИскомыйОбъект.ТипТаблицы) Тогда
			ирОбщий.НайтиДобавитьЭлементНастроекКомпоновкиПоПолюЛкс(Компоновщик.Настройки.Порядок, ирОбщий.ПеревестиСтроку("Ссылка"));
		КонецЕсли; 
	КонецЕсли; 
	Компоновщик.Настройки.Структура.Очистить();
	ирОбщий.НайтиДобавитьЭлементСтруктурыГруппировкаКомпоновкиЛкс(Компоновщик.Настройки.Структура);
	Если СтароеИмяТекущегоПоля <> Неопределено Тогда
		НовоеТекущееПоле = ЭлементыФормы.КомпоновщикДоступныеПоляОтбора.Значение.НайтиПоле(Новый ПолеКомпоновкиДанных(СтароеИмяТекущегоПоля));
		Если НовоеТекущееПоле <> Неопределено Тогда
			ЭлементыФормы.КомпоновщикДоступныеПоляОтбора.ТекущаяСтрока = НовоеТекущееПоле;
		КонецЕсли; 
	КонецЕсли; 

КонецПроцедуры

Процедура ДобавитьПредставленияПолей(Знач КоллекцияДоступныхПолей, Знач ПредставленияПолей)
	
	Для Каждого ДоступноеПоле Из КоллекцияДоступныхПолей Цикл
		Если Ложь
			Или ДоступноеПоле.Папка
			Или "" + ДоступноеПоле.Поле = мИмяСлужебногоПоля 
			Или "" + ДоступноеПоле.Поле = "КоличествоСтрок873484287"
			Или мИменаКоличестваПодчиненных.Свойство(ДоступноеПоле.Поле)
		Тогда
			Продолжить;
		КонецЕсли; 
		ПредставленияПолей.Вставить("" + ДоступноеПоле.Поле, "" + ДоступноеПоле.Поле);
	КонецЦикла;

КонецПроцедуры

Процедура ЗагрузитьСтруктуруНастроекТекущейТаблицы(Знач НастройкиНабораТаблицБД)
	
	Компоновщик.ЗагрузитьНастройки(НастройкиНабораТаблицБД.НастройкаКомпоновки);
	УстановитьПометкиПолейБитыхСсылок(НастройкиНабораТаблицБД.ИменаПолейБитыхСсылок);
	ЭтаФорма.СтрокаПоиска = НастройкиНабораТаблицБД.СтрокаПоиска;
	
КонецПроцедуры

Функция СохранитьНастройкиТекущейТаблицы()
	
	СохраняемыеНастройки = ПолучитьСтруктуруНастроекТекущейТаблицы();
	Если Найти(КлючНабораТаблицБД, ",") > 0 Тогда
		// Не сохраняем настройки многотабличной выборки, чтобы не замусоривать хранимую настройку формы
		Возврат СохраняемыеНастройки;
	КонецЕсли; 
	НастройкиКомпоновки[КлючНабораТаблицБД] = СохраняемыеНастройки;
	Возврат СохраняемыеНастройки;

КонецФункции

Функция ПолучитьСтруктуруНастроекТекущейТаблицы()
	
	СохраняемыеНастройки = Новый Структура("НастройкаКомпоновки, ИменаПолейБитыхСсылок, СтрокаПоиска");
	СохраняемыеНастройки.НастройкаКомпоновки = Компоновщик.ПолучитьНастройки();
	СохраняемыеНастройки.ИменаПолейБитыхСсылок = ПоляБитыхСсылок.Скопировать(Новый Структура("Пометка", Истина)).ВыгрузитьКолонку("Поле");
	СохраняемыеНастройки.СтрокаПоиска = СтрокаПоиска;
	Возврат СохраняемыеНастройки;
	
КонецФункции // НастроитьПостроитель()

Процедура УстановитьПометкиПолейБитыхСсылок(ИменаПолей)
	
	Для Каждого ИмяПоля Из ИменаПолей Цикл
		ПолеБитойСсылки = ПоляБитыхСсылок.Найти(ИмяПоля, "Поле");
		Если ПолеБитойСсылки <> Неопределено Тогда
			ПолеБитойСсылки.Пометка = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция вОбработкаДоступна(ПроверяемыйТипОбъекта = "", ИмяОбработки)

    Возврат Истина;
	
КонецФункции // ОбработкаДоступна()

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)

	//Если ЭтаФорма.КлючУникальности = Неопределено Тогда
	//	Отказ = Истина;
	//	ЭтотОбъект.ПолучитьФорму("ПодборИОбработка",, Новый УникальныйИдентификатор()).Открыть();
	//КонецЕсли;

КонецПроцедуры // ПередОткрытием()

Процедура ПриОткрытии()

	ирОбщий.Форма_ПриОткрытииЛкс(ЭтаФорма);
	НачальноеКоличествоДоступныхОбработок = ирОбщий.ВсеСтрокиДереваЗначенийЛкс(ДоступныеОбработки).Количество();
	Если КлючУникальности <> Неопределено И ТипЗнч(КлючУникальности) = Тип("Строка") Тогда
		ОбъектМД = ирКэш.ОбъектМДПоПолномуИмениЛкс(КлючУникальности);
		Если ОбъектМД <> Неопределено Тогда
			ЭтотОбъект.ОбластьПоиска = ирОбщий.ИмяТаблицыИзМетаданныхЛкс(КлючУникальности);
			//Попытка
			//	УстановитьОбластьПоиска();
			//Исключение
			//	ирОбщий.СообщитьЛкс(ОписаниеОшибки());
			//КонецПопытки; 
		КонецЕсли;
	КонецЕсли; 
	СоставНастройкиФормы = Новый СписокЗначений;
	СоставНастройкиФормы.Добавить("ВсеТаблицы", "Настройки всех таблиц БД", Ложь);
	СоставНастройкиФормы.Добавить("Обработки", "Доступные и выбранные обработки", Ложь);
	СоставНастройкиФормы.Добавить("Прочее", "Прочее", Истина);
	ирОбщий.СоздатьМенеджерСохраненияНастроекФормыЛкс(ЭтаФорма,,, Новый Структура("ПриОткрытии"), "por", СоставНастройкиФормы);
	
	Если НачальноеКоличествоДоступныхОбработок = ирОбщий.ВсеСтрокиДереваЗначенийЛкс(ДоступныеОбработки).Количество() Тогда
		// На переходный период оставил загрузку настроек старого формата
		ВосстановленныеДоступныеОбработки = ирОбщий.ВосстановитьЗначениеЛкс("ирПодборИОбработкаОбъектов.ДоступныеОбработки");
		Если ВосстановленныеДоступныеОбработки = Неопределено Тогда
			ВосстановленныеДоступныеОбработки = ВосстановитьЗначение("ДоступныеОбработки");
		КонецЕсли; 
		Если ВосстановленныеДоступныеОбработки <> Неопределено Тогда
			ирОбщий.ЗагрузитьВДеревоЗначенийЛкс(ВосстановленныеДоступныеОбработки, ДоступныеОбработки);
		КонецЕсли;
		ВосстановленныеВыбранныеОбработки = ирОбщий.ВосстановитьЗначениеЛкс("ирПодборИОбработкаОбъектов.ВыбранныеОбработки");
		Если ВосстановленныеВыбранныеОбработки <> Неопределено Тогда
			ЗагрузитьВыбранныеОбработки(ВосстановленныеВыбранныеОбработки);
		КонецЕсли;
		АвтозаполнениеПорядкаПриИзменении();
		вЗагрузитьОбработки(ДоступныеОбработки, ВыбранныеОбработки);
	КонецЕсли; 
	
	ирОбщий.УстановитьДоступностьВыполненияНаСервереЛкс(ЭтаФорма);
	НастроитьЭлементыФормы();
	ирОбщий.ПолеВводаСИсториейВыбора_ПриИзмененииЛкс(ЭлементыФормы.ОбластьПоиска, ЭтаФорма);
	Если ПараметрМассивСсылок <> Неопределено Тогда
		ЗагрузитьСтрокиДляОбработки(ирОбщий.ПолучитьУникальныеЗначенияМассиваЛкс(ПараметрМассивСсылок),, ПараметрВыбранныеПоля);
		ПараметрМассивСсылок = Неопределено;
	ИначеЕсли ПараметрВыбранныеПоля <> Неопределено Тогда 
		ДобавитьВыбранныеПоля(ПараметрВыбранныеПоля);
	КонецЕсли;
	Если ПараметрНастройкаКомпоновки <> Неопределено Тогда
		ЭтаФорма.СтрокаПоиска = "";
		ЭтаФорма.ПервыеNКаждойТаблицы = 0;
		КоманднаяПанельПоляБитыхСсылокСнятьФлажки();
		ирОбщий.СкопироватьОтборЛюбойЛкс(Компоновщик.Настройки.Отбор, ПараметрНастройкаКомпоновки.Отбор);
		ирОбщий.СкопироватьПорядокЛюбойЛкс(Компоновщик.Настройки.Порядок, ПараметрНастройкаКомпоновки.Порядок);
	КонецЕсли; 
	Если ЗначениеЗаполнено(ПараметрТекущееПоле) Тогда
		НовоеТекущееДоступноеПоле = ЭлементыФормы.КомпоновщикДоступныеПоляОтбора.Значение.НайтиПоле(Новый ПолеКомпоновкиДанных(ПараметрТекущееПоле));
		Если НовоеТекущееДоступноеПоле <> Неопределено Тогда
			ЭлементыФормы.КомпоновщикДоступныеПоляОтбора.ТекущаяСтрока = НовоеТекущееДоступноеПоле;
			ЭлементыФормы.КомпоновщикВыбор.ТекущаяСтрока = ирОбщий.НайтиДобавитьЭлементНастроекКомпоновкиПоПолюЛкс(Компоновщик.Настройки.Выбор, ПараметрТекущееПоле);
			АктивироватьКолонкуТекущегоВыбранногоПоля();
		КонецЕсли; 
	КонецЕсли; 
	ирОбщий.НастроитьПоляВводаПараметровПотоковЛкс(ЭтаФорма);
	
КонецПроцедуры

Процедура ПриЗакрытии()

	ирОбщий.Форма_ПриЗакрытииЛкс(ЭтаФорма);
	
КонецПроцедуры

Процедура ЗаполнитьСтрокиНажатие(Кнопка)
	
	ЗаполнитьСтроки();
	
КонецПроцедуры

Процедура КПСтрокиДляОбработкиУстановитьФлажки(Кнопка)

	ирОбщий.ИзменитьПометкиВыделенныхИлиОтобранныхСтрокЛкс(ЭлементыФормы.СтрокиДляОбработки, мИмяКолонкиПометки, Истина,,, Ложь);

КонецПроцедуры

Процедура КПСтрокиДляОбработкиСнятьФлажки(Кнопка)

	ирОбщий.ИзменитьПометкиВыделенныхИлиОтобранныхСтрокЛкс(ЭлементыФормы.СтрокиДляОбработки, мИмяКолонкиПометки, Ложь,,, Ложь);
	
КонецПроцедуры // КПСтрокиДляОбработкиСнятьФлажки()

Процедура СтрокиДляОбработкиВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	
	ирОбщий.ЯчейкаТабличногоПоляРасширенногоЗначения_ВыборЛкс(ЭтаФорма, Элемент, СтандартнаяОбработка);

КонецПроцедуры // СтрокиДляОбработкиВыбор()

Процедура СтрокиДляОбработкиПередНачаломДобавления(Элемент, Отказ, Копирование)
	
	Отказ = Истина;
	//Если МноготабличнаяВыборка Тогда
	//	Если ОбластьПоиска.Количество() = 0 Тогда
	//		ВыбранныйЭлемент = Неопределено;
	//	ИначеЕсли ОбластьПоиска.Количество() = 1 Тогда
	//		ВыбранныйЭлемент = ОбластьПоиска[0];
	//	Иначе
	//		ВыбранныйЭлемент = ОбластьПоиска.ВыбратьЭлемент("Выберите таблицу");
	//	КонецЕсли; 
	//	Если ВыбранныйЭлемент = Неопределено Тогда
	//		Возврат;
	//	КонецЕсли; 
	//	ИмяТаблицы = ВыбранныйЭлемент.Значение;
	//Иначе
	//	ИмяТаблицы = ОбластьПоиска;
	//КонецЕсли; 
	//КорневойТип = ирОбщий.ПервыйФрагментЛкс(ИмяТаблицы);
	//Если Не ирОбщий.ЛиКорневойТипСсылочногоОбъектаБДЛкс(КорневойТип) Тогда
	//	Возврат;
	//КонецЕсли; 
	//ФормаВыбора = ПолучитьФорму(ИмяТаблицы + ".ФормаВыбора",, ЭлементыФормы.СтрокиДляОбработки); 
	////ФормаВыбора.ЗакрыватьПриВыборе = Ложь;
	//ФормаВыбора.Открыть();
	КПСтрокиДляОбработкиПодбор();

КонецПроцедуры // СтрокиДляОбработкиПередНачаломДобавления()

Процедура ДоступныеОбработкиВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Если Не ОбработкаРазрешенаДляТаблицы(ВыбраннаяСтрока) Тогда
		Возврат;
	КонецЕсли; 

	Если ВыбраннаяСтрока.Родитель = Неопределено Тогда
		Если НЕ вОбработкаДоступна(мИскомыйОбъект.КорневойТип, ВыбраннаяСтрока.ИмяФормы) Тогда
            Предупреждение("Данная обработка недоступна для типа <" + мИскомыйОбъект.КорневойТип + ">");
			Возврат;
		КонецЕсли;
		Обработка = ПолучитьФорму(ВыбраннаяСтрока.ИмяФормы, ЭтаФорма);
	Иначе
		Если НЕ вОбработкаДоступна(мИскомыйОбъект.КорневойТип, ВыбраннаяСтрока.Родитель.ИмяФормы) Тогда
            Предупреждение("Данная обработка недоступна для типа <" + мИскомыйОбъект.КорневойТип + ">");
			Возврат;
		КонецЕсли;
		Обработка = ПолучитьФорму(ВыбраннаяСтрока.Родитель.ИмяФормы, ЭтаФорма);
	КонецЕсли;

	Обработка.ТекущаяНастройка = ВыбраннаяСтрока;
	Обработка.Открыть();
	
КонецПроцедуры

Процедура ДоступныеОбработкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель)

	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Отказ = Истина;
	КонецЕсли;

	Если Элемент.ТекущиеДанные.Родитель = Неопределено Тогда
		//Если Копирование Тогда
			Отказ = Истина;
		//Иначе
		//	Если НЕ вОбработкаДоступна(мИскомыйОбъект.КорневойТип, Элемент.ТекущиеДанные.ИмяФормы) Тогда
		//        Предупреждение("Данная обработка недоступна для типа <" + мИскомыйОбъект.КорневойТип + ">");
		//		Отказ = Истина;
		//		Возврат;
		//	КонецЕсли;
		//	Отказ = НЕ ПолучитьФорму(Элемент.ТекущиеДанные.ИмяФормы).мИспользоватьНастройки;
		//КонецЕсли;
	Иначе
		Если НЕ вОбработкаДоступна(мИскомыйОбъект.КорневойТип, Элемент.ТекущиеДанные.Родитель.ИмяФормы) Тогда
			Предупреждение("Данная обработка недоступна для типа <" + мИскомыйОбъект.КорневойТип + ">");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
        Отказ = Истина;
		Если НЕ Копирование Тогда
			Если ПолучитьФорму(Элемент.ТекущиеДанные.Родитель.ИмяФормы).мИспользоватьНастройки Тогда
				ЭлементыФормы.ДоступныеОбработки.ТекущаяСтрока = Элемент.ТекущиеДанные.Родитель.Строки.Добавить();
				ЭлементыФормы.ДоступныеОбработки.ИзменитьСтроку();
			КонецЕсли;
		Иначе
			ирОбщий.СообщитьЛкс("Для копирования настройки откройте ее, введите новое имя и сохраните");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДоступныеОбработкиПередУдалением(Элемент, Отказ)

	Если Элемент.ТекущаяСтрока.Родитель = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Если Вопрос("Удалить настройку?", РежимДиалогаВопрос.ОКОтмена,, КодВозвратаДиалога.ОК) = КодВозвратаДиалога.ОК Тогда
        ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("СтрокаДоступнойОбработки", Элемент.ТекущаяСтрока);
		МассивДляУдаления = ВыбранныеОбработки.НайтиСтроки(ПараметрыОтбора);
		Для Индекс = 0 по МассивДляУдаления.Количество() - 1 Цикл
			ВыбранныеОбработки.Удалить(МассивДляУдаления[Индекс]);
		КонецЦикла;
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры // ДоступныеОбработкиПередУдалением()

Процедура ДоступныеОбработкиПередНачаломИзменения(Элемент, Отказ)

	Если Элемент.ТекущиеДанные.Родитель = Неопределено Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьВВыбранныеНажатие(Элемент)

	ТекущаяСтрока = ЭлементыФормы.ДоступныеОбработки.ТекущаяСтрока;
	Если НЕ ТекущаяСтрока = Неопределено Тогда
		Если Не ОбработкаРазрешенаДляТаблицы(ТекущаяСтрока) Тогда
			Возврат;
		КонецЕсли; 
		Если ТекущаяСтрока.Родитель = Неопределено Тогда
			Если ТекущаяСтрока.Независимая Тогда
				Возврат;
			КонецЕсли; 
			ИмяФормы = ТекущаяСтрока.ИмяФормы;
			Если ПолучитьФорму(ИмяФормы).мИспользоватьНастройки Тогда
				Возврат;
			КонецЕсли;
			Если НЕ вОбработкаДоступна(мИскомыйОбъект.КорневойТип, ТекущаяСтрока.ИмяФормы) Тогда
	            Предупреждение("Данная обработка недоступна для типа <" + мИскомыйОбъект.КорневойТип + ">");
				Возврат;
			КонецЕсли;
			НоваяСтрока = ВыбранныеОбработки.Добавить();
			НоваяСтрока.СтрокаДоступнойОбработки = ТекущаяСтрока;
			НоваяСтрока.Пометка = Истина;
		Иначе
            ИмяФормы = ТекущаяСтрока.Родитель.ИмяФормы;
			Если НЕ вОбработкаДоступна(мИскомыйОбъект.КорневойТип, ТекущаяСтрока.Родитель.ИмяФормы) Тогда
	            Предупреждение("Данная обработка недоступна для типа <" + мИскомыйОбъект.КорневойТип + ">");
				Возврат;
			КонецЕсли;
			НоваяСтрока = ВыбранныеОбработки.Добавить();
			НоваяСтрока.СтрокаДоступнойОбработки = ТекущаяСтрока;
			НоваяСтрока.Пометка = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыбранныеОбработкиПередНачаломДобавления(Элемент, Отказ, Копирование)

	Если НЕ Копирование Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыбранныеОбработкиВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
    Если ВыбраннаяСтрока.СтрокаДоступнойОбработки.Родитель = Неопределено Тогда
		Обработка = ПолучитьФорму(ВыбраннаяСтрока.СтрокаДоступнойОбработки.ИмяФормы, ЭтаФорма);
	Иначе
		Обработка = ПолучитьФорму(ВыбраннаяСтрока.СтрокаДоступнойОбработки.Родитель.ИмяФормы, ЭтаФорма);
	КонецЕсли;

	Обработка.ТекущаяНастройка = ВыбраннаяСтрока.СтрокаДоступнойОбработки;
	Обработка.Открыть();

КонецПроцедуры // ВыбранныеОбработкиВыбор()

Процедура КоманднаяПанельВыбранныеОбработкиВыполнить(Кнопка)

	ПомеченныеОбработки = ВыбранныеОбработки.НайтиСтроки(Новый Структура("Пометка", Истина));
	Индикатор = ирОбщий.ПолучитьИндикаторПроцессаЛкс(ПомеченныеОбработки.Количество(), "Обработки");
	Для каждого Строка из ПомеченныеОбработки Цикл
		ирОбщий.ОбработатьИндикаторЛкс(Индикатор);
		Если Строка.СтрокаДоступнойОбработки.Родитель = Неопределено Тогда
			ИмяФормы = Строка.СтрокаДоступнойОбработки.ИмяФормы;
		Иначе
			ИмяФормы = Строка.СтрокаДоступнойОбработки.Родитель.ИмяФормы;
		КонецЕсли;
		Если НЕ вОбработкаДоступна(мИскомыйОбъект.КорневойТип, ИмяФормы) Тогда
            ирОбщий.СообщитьЛкс("Обработка " + ИмяФормы + " недоступна для типа <" + мИскомыйОбъект.КорневойТип + ">");
			Продолжить;
		КонецЕсли;
		Обработка = ПолучитьФорму(ИмяФормы, ЭтаФорма);
		Обработка.ТекущаяНастройка = Строка.СтрокаДоступнойОбработки;
		Обработка.вЗагрузитьНастройку();
		Обработка.вВыполнитьОбработку();
	КонецЦикла;
	ирОбщий.ОсвободитьИндикаторПроцессаЛкс();

КонецПроцедуры // КоманднаяПанельОбработкиВыполнить()

Функция ОбработкаРазрешенаДляТаблицы(Знач СтрокаПроверки)
	
	Если мИскомыйОбъект = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли; 
	Если СтрокаПроверки.Родитель <> Неопределено Тогда
		СтрокаПроверки = СтрокаПроверки.Родитель;
	КонецЕсли; 
	Если Истина
		И ЭтотОбъект.ДинамическаяВыборка
		И СтрокаПроверки.Групповая
	Тогда 
		Возврат Ложь;
	ИначеЕсли Истина
		И (Ложь
			Или МноготабличнаяВыборка
			Или ирОбщий.ЛиКорневойТипЖурналаДокументовЛкс(мИскомыйОбъект.ТипТаблицы))
		И Не СтрокаПроверки.Многотабличная
	Тогда 
		Возврат Ложь;
	ИначеЕсли Истина
		И мИскомыйОбъект.ТипТаблицы = "Внешняя"
		И РежимОбходаДанных <> "КлючиОбъектов"
		И Найти(СтрокаПроверки.ПоддерживаемыеТипыТаблиц + ",", "ВнешнийОбъект" + ",") > 0
	Тогда
		Возврат Истина;
	ИначеЕсли Истина
		И (Ложь
			Или ирОбщий.ЛиКорневойТипСсылочногоОбъектаБДЛкс(мИскомыйОбъект.ТипТаблицы)
			Или ирОбщий.ЛиКорневойТипЖурналаДокументовЛкс(мИскомыйОбъект.ТипТаблицы))
		И РежимОбходаДанных <> "КлючиОбъектов"
		И Найти(СтрокаПроверки.ПоддерживаемыеТипыТаблиц + ",", "СсылочныйОбъект" + ",") > 0
	Тогда
		Возврат Истина;
	ИначеЕсли Истина
		И ирОбщий.ЛиКорневойТипКонстантыЛкс(мИскомыйОбъект.ТипТаблицы)
		И Найти(СтрокаПроверки.ПоддерживаемыеТипыТаблиц + ",", "Константа" + ",") > 0
	Тогда
		Возврат Истина;
	ИначеЕсли Истина
		И (Истина
			И РежимОбходаДанных = "КлючиОбъектов"
			И (Ложь
				Или ирОбщий.ЛиКорневойТипСсылочногоОбъектаБДЛкс(мИскомыйОбъект.ТипТаблицы)
				Или ирОбщий.ЛиКорневойТипЖурналаДокументовЛкс(мИскомыйОбъект.ТипТаблицы)
				Или ирОбщий.ЛиТипВложеннойТаблицыБДЛкс(мИскомыйОбъект.ТипТаблицы)))
		И Найти(СтрокаПроверки.ПоддерживаемыеТипыТаблиц + ",", "Ссылка" + ",") > 0
	Тогда
		Возврат Истина;
	ИначеЕсли Истина
		И (Истина
			И РежимОбходаДанных = "КлючиОбъектов"
			И мИскомыйОбъект.ТипТаблицы = "Внешняя")
		И Найти(СтрокаПроверки.ПоддерживаемыеТипыТаблиц + ",", "ВнешняяСсылка" + ",") > 0
	Тогда
		Возврат Истина;
	ИначеЕсли Истина
		И (Ложь
			Или ирОбщий.ЛиКорневойТипДокументаЛкс(мИскомыйОбъект.ТипТаблицы)
			Или ирОбщий.ЛиКорневойТипЖурналаДокументовЛкс(мИскомыйОбъект.ТипТаблицы))
		И РежимОбходаДанных <> "КлючиОбъектов"
		И Найти(СтрокаПроверки.ПоддерживаемыеТипыТаблиц + ",", "ДокументОбъект" + ",") > 0
	Тогда
		Возврат Истина;
	ИначеЕсли Истина
		И РежимОбходаДанных = "Объекты"
		И ирОбщий.ЛиТипВложеннойТаблицыБДЛкс(мИскомыйОбъект.ТипТаблицы)
		И Найти(СтрокаПроверки.ПоддерживаемыеТипыТаблиц + ",", "СсылочныйОбъект" + ",") > 0
	Тогда
		Возврат Истина;
	ИначеЕсли Истина
		И РежимОбходаДанных = "Объекты"
		И мИскомыйОбъект.ТипТаблицы = "Внешняя"
		И Найти(СтрокаПроверки.ПоддерживаемыеТипыТаблиц + ",", "ВнешнийОбъект" + ",") > 0
	Тогда
		Возврат Истина;
	ИначеЕсли Истина
		И РежимОбходаДанных = "Объекты"
		И (Ложь
			Или ирОбщий.ЛиКорневойТипДокументаЛкс(мИскомыйОбъект.КорневойТип)
			Или ирОбщий.ЛиКорневойТипЖурналаДокументовЛкс(мИскомыйОбъект.КорневойТип))
		И Найти(СтрокаПроверки.ПоддерживаемыеТипыТаблиц + ",", "ДокументОбъект" + ",") > 0
	Тогда
		Возврат Истина;
	ИначеЕсли Истина
		И РежимОбходаДанных = "Объекты"
		И (Ложь
			Или ирОбщий.ЛиКорневойТипРегистраБДЛкс(мИскомыйОбъект.ТипТаблицы) 
			//Или ирОбщий.ЛиКорневойТипПоследовательностиЛкс(мИскомыйОбъект.ТипТаблицы)
			)
		И Найти(СтрокаПроверки.ПоддерживаемыеТипыТаблиц + ",", "НаборЗаписей" + ",") > 0
	Тогда
		Возврат Истина;
	ИначеЕсли Истина
		И РежимОбходаДанных = "КлючиОбъектов"
		И (Ложь
			Или ирОбщий.ЛиКорневойТипРегистраБДЛкс(мИскомыйОбъект.ТипТаблицы) 
			//Или ирОбщий.ЛиКорневойТипПоследовательностиЛкс(мИскомыйОбъект.ТипТаблицы)
			)
		И Найти(СтрокаПроверки.ПоддерживаемыеТипыТаблиц + ",", "НаборЗаписей" + ",") > 0
	Тогда
		Возврат Истина;
	ИначеЕсли Истина
		И РежимОбходаДанных = "Строки"
		И (Ложь
			Или ирОбщий.ЛиКорневойТипРегистраБДЛкс(мИскомыйОбъект.ТипТаблицы) 
			//Или ирОбщий.ЛиКорневойТипПоследовательностиЛкс(мИскомыйОбъект.ТипТаблицы)
			)
		И Найти(СтрокаПроверки.ПоддерживаемыеТипыТаблиц + ",", "РегистрЗапись" + ",") > 0
	Тогда
		Возврат Истина;
	ИначеЕсли Истина
		И РежимОбходаДанных = "Строки"
		И ирОбщий.ЛиТипВложеннойТаблицыБДЛкс(мИскомыйОбъект.ТипТаблицы)
		И Найти(СтрокаПроверки.ПоддерживаемыеТипыТаблиц + ",", "ТабличнаяЧастьСтрока" + ",") > 0
	Тогда
		Возврат Истина;
	КонецЕсли; 
	Возврат Ложь;
	
КонецФункции

Процедура ДоступныеОбработкиПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки) Экспорт

	ирОбщий.ТабличноеПолеПриВыводеСтрокиЛкс(ЭтаФорма, Элемент, ОформлениеСтроки, ДанныеСтроки);
	КартинкаОбработки = ПолучитьКартинкуОбработки(ДанныеСтроки);
	ОформлениеСтроки.Ячейки["Обработка"].УстановитьКартинку(КартинкаОбработки);
	Если Не ОбработкаРазрешенаДляТаблицы(ДанныеСтроки) Тогда
		ОформлениеСтроки.ЦветТекста = ирОбщий.ЦветТекстаНеактивностиЛкс();
	КонецЕсли; 
	
КонецПроцедуры // ДоступныеОбработкиПриВыводеСтроки()

Функция ПолучитьКартинкуОбработки(СтрокаОбработки)
	
	Если СтрокаОбработки.Родитель = Неопределено Тогда
		Если Истина
			И СтрокаОбработки.Картинка <> Неопределено
			И СтрокаОбработки.Картинка.Вид <> ВидКартинки.Пустая
		Тогда
			Результат = СтрокаОбработки.Картинка;
		Иначе
			Результат = БиблиотекаКартинок.Обработка;
		КонецЕсли; 
	Иначе
		Результат = БиблиотекаКартинок.НастройкиОтчета;
	КонецЕсли; 
	Возврат Результат;
	
КонецФункции

Процедура ВыбранныеОбработкиПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки) Экспорт

	ирОбщий.ТабличноеПолеПриВыводеСтрокиЛкс(ЭтаФорма, Элемент, ОформлениеСтроки, ДанныеСтроки);
	СтрокаДоступнойОбработки = ДанныеСтроки.СтрокаДоступнойОбработки;
	Если СтрокаДоступнойОбработки <> Неопределено Тогда
		Если СтрокаДоступнойОбработки.Родитель = Неопределено Тогда
			ОформлениеСтроки.Ячейки.ОбработкаНастройка.УстановитьТекст(Строка(СтрокаДоступнойОбработки.Обработка));
			КартинкаОбработки = ПолучитьКартинкуОбработки(СтрокаДоступнойОбработки);
		Иначе
			ОформлениеСтроки.Ячейки.ОбработкаНастройка.УстановитьТекст(Строка(СтрокаДоступнойОбработки.Родитель.Обработка) + " - " + Строка(СтрокаДоступнойОбработки.Обработка));
			КартинкаОбработки = ПолучитьКартинкуОбработки(СтрокаДоступнойОбработки.Родитель);
		КонецЕсли;
		ОформлениеСтроки.Ячейки.ОбработкаНастройка.УстановитьКартинку(КартинкаОбработки);
	КонецЕсли;
	
КонецПроцедуры

Функция ВыбранныеОбработкиДляСохранения()
	
	Перем ВыбраннаяОбработка, ВыбранныеОбработкиДляСохранения, НоваяСтрока;
	ВыбранныеОбработкиДляСохранения = Новый ТаблицаЗначений;
	ВыбранныеОбработкиДляСохранения.Колонки.Добавить("ИмяФормы");
	ВыбранныеОбработкиДляСохранения.Колонки.Добавить("НомерНастройки");
	ВыбранныеОбработкиДляСохранения.Колонки.Добавить("Пометка");
	Для каждого ВыбраннаяОбработка из ВыбранныеОбработки Цикл
		НоваяСтрока = ВыбранныеОбработкиДляСохранения.Добавить();
		Если ВыбраннаяОбработка.СтрокаДоступнойОбработки.Родитель = Неопределено Тогда
			НоваяСтрока.ИмяФормы = ВыбраннаяОбработка.СтрокаДоступнойОбработки.ИмяФормы;
			НоваяСтрока.НомерНастройки = ВыбраннаяОбработка.СтрокаДоступнойОбработки.Строки.Индекс(ВыбраннаяОбработка.СтрокаДоступнойОбработки);
			НоваяСтрока.Пометка = ВыбраннаяОбработка.Пометка;
		Иначе
			НоваяСтрока.ИмяФормы = ВыбраннаяОбработка.СтрокаДоступнойОбработки.Родитель.ИмяФормы;
			НоваяСтрока.НомерНастройки = ВыбраннаяОбработка.СтрокаДоступнойОбработки.Родитель.Строки.Индекс(ВыбраннаяОбработка.СтрокаДоступнойОбработки);
			НоваяСтрока.Пометка = ВыбраннаяОбработка.Пометка;
		КонецЕсли;
	КонецЦикла;
	Возврат ВыбранныеОбработкиДляСохранения;

КонецФункции

Процедура ЗагрузитьВыбранныеОбработки(Знач ВыбранныеОбработкиДляЗагрузки)
	
	ВыбранныеОбработки.Очистить();
	Для каждого ВыбраннаяОбработка из ВыбранныеОбработкиДляЗагрузки Цикл
		СтрокаОбработки = ДоступныеОбработки.Строки.Найти(ВыбраннаяОбработка.ИмяФормы, "ИмяФормы");
		Если СтрокаОбработки <> Неопределено Тогда
			Если Истина
				И ПолучитьФорму(ВыбраннаяОбработка.ИмяФормы).мИспользоватьНастройки 
				И СтрокаОбработки.Строки.Количество() > ВыбраннаяОбработка.НомерНастройки
				И ВыбраннаяОбработка.НомерНастройки >= 0 
			Тогда
				Настройка = СтрокаОбработки.Строки.Получить(ВыбраннаяОбработка.НомерНастройки);
			Иначе
				Настройка = СтрокаОбработки;
			КонецЕсли;
			Если НЕ Настройка = Неопределено Тогда
				НоваяСтрока = ВыбранныеОбработки.Добавить();
				НоваяСтрока.СтрокаДоступнойОбработки = Настройка;
				НоваяСтрока.Пометка = ВыбраннаяОбработка.Пометка;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура ГлавнаяКоманднаяПанельОчиститьНатройкиОбработок(Кнопка)

	Ответ = Вопрос("Очистить сохраненные и выбранные настройки обработок?", РежимДиалогаВопрос.ОКОтмена);
	Если Ответ <> КодВозвратаДиалога.ОК Тогда
		Возврат;
	КонецЕсли;
	ДоступныеОбработки.Строки.Очистить();
	ВыбранныеОбработки.Очистить();
	вЗагрузитьОбработки(ДоступныеОбработки, ВыбранныеОбработки);
	
КонецПроцедуры // ГлавнаяКоманднаяПанельОчиститьНатройкиОбработок()

Процедура ПредставлениеОбластиПоискаНачалоВыбора(Элемент, СтандартнаяОбработка)
	
	РезультатВыбора = ВыбратьОбъектМетаданных();
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

Функция ВыбратьОбъектМетаданных(Фильтр = "")
	
	Элемент = ЭлементыФормы.ОбластьПоиска;
	Форма = ирКэш.Получить().ПолучитьФорму("ВыборОбъектаМетаданных", Элемент, ЭтаФорма);
	лСтруктураПараметров = ирОбщий.ПараметрыВыбораОбъектаМетаданныхЛкс(Истина, Не МноготабличнаяВыборка, Истина, Истина, Истина, Истина,, Истина,,, Истина,,,, МноготабличнаяВыборка);
	Если МноготабличнаяВыборка Тогда
		лНачальноеЗначениеВыбора = ОбластьПоиска.ВыгрузитьЗначения();
	Иначе
		лНачальноеЗначениеВыбора = ОбластьПоиска;
	КонецЕсли; 
	лСтруктураПараметров.Вставить("НачальноеЗначениеВыбора", лНачальноеЗначениеВыбора);
	лСтруктураПараметров.Вставить("МножественныйВыборТолькоДляОднотипныхТаблиц", Истина);
	лСтруктураПараметров.Вставить("Фильтр", Фильтр);
	Форма.НачальноеЗначениеВыбора = лСтруктураПараметров;
	РезультатВыбора = Форма.ОткрытьМодально();
	Возврат РезультатВыбора;

КонецФункции

// Устанавливает новую область поиска.
//
// Параметры:
//  *пОбластьПоиска – Строка, "" – новая область поиска.
//
Функция УстановитьОбластьПоиска(пОбластьПоиска = Null, НастройкиНабораТаблицБД = Неопределено) Экспорт
	
	// Закомментировал 31.03.2012 для корректной работы последних выбранных значений
	//Если пОбластьПоиска = ОбластьПоиска Тогда
	//	Возврат;
	//КонецЕсли;
	
	//Если ТипЗнч(ОбластьПоиска) = Тип("СписокЗначений") Тогда
	//	МноготабличнаяВыборка = Истина;
	//КонецЕсли; 
	ИмяПоляСсылка = ирОбщий.ПеревестиСтроку("Ссылка");
	СохранятьТекущиеНастройки = Истина
		//И Не МножественныйВыбор
		И ЗначениеЗаполнено(пОбластьПоиска);
	ЗагружатьТекущиеНастройки = пОбластьПоиска <> Null;
	Если ЗагружатьТекущиеНастройки Тогда
		ОбластьПоиска = пОбластьПоиска;
		ЭтотОбъект.БезАвтоупорядочивания = Истина;
	КонецЕсли;
	МноготабличнаяВыборка = Ложь
		Или ТипЗнч(ОбластьПоиска) = Тип("Массив")
		Или ТипЗнч(ОбластьПоиска) = Тип("СписокЗначений");
	мВыборкаРезультата = Неопределено;
	мТекстЗапросаКоличестваСтрок = "";
	Если ТипЗнч(ОбластьПоиска) = Тип("СписокЗначений") Тогда
		мИскомыйОбъект = Новый Структура;
		МетаОбъекты = Новый Массив();
		мИскомыйОбъект.Вставить("МетаОбъект", МетаОбъекты);
		ТекстЗапросаКоличестваСтрок = "";
		Для Каждого ЭлементСписка Из ОбластьПоиска Цикл
			ПолноеИмяТаблицы = ЭлементСписка.Значение;
			МетаданныеОбъекта = ирОбщий.ОбъектМДПоПолномуИмениТаблицыБДЛкс(ПолноеИмяТаблицы, Истина);
			Если МетаданныеОбъекта <> Неопределено Тогда
				мИскомыйОбъект.Вставить("ТипТаблицы", ирОбщий.ТипТаблицыБДЛкс(ПолноеИмяТаблицы));
				мИскомыйОбъект.Вставить("КорневойТип", ирОбщий.ПервыйФрагментЛкс(ПолноеИмяТаблицы));
				МетаОбъекты.Добавить(МетаданныеОбъекта);
				Если ТекстЗапросаКоличестваСтрок <> "" Тогда
					ТекстЗапросаКоличестваСтрок = ТекстЗапросаКоличестваСтрок + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС;
				КонецЕсли; 
				ТекстЗапросаКоличестваСтрок = ТекстЗапросаКоличестваСтрок + "ВЫБРАТЬ Количество(*) КАК Количество ИЗ " + ПолноеИмяТаблицы + Символы.ПС;
			КонецЕсли;
		КонецЦикла;
		Если МетаОбъекты.Количество() = 0 Тогда
			мИскомыйОбъект = Неопределено;
		Иначе
			мТекстЗапросаКоличестваСтрок = "ВЫБРАТЬ СУММА(Количество) ИЗ (" + ТекстЗапросаКоличестваСтрок + ") КАК Т";
		КонецЕсли; 
		ЕстьТаблицаИзменений = Истина;
	Иначе
		мИскомыйОбъект = Неопределено;
		ЕстьТаблицаИзменений = Ложь;
		Если ирОбщий.ЛиТаблицаБДСуществуетЛкс(ОбластьПоиска, Истина) Тогда
			ПолноеИмяТаблицы = ОбластьПоиска;
			МетаданныеОбъекта = ирОбщий.ОбъектМДПоПолномуИмениТаблицыБДЛкс(ОбластьПоиска, Истина);
			Если МетаданныеОбъекта <> Неопределено Тогда
				мИскомыйОбъект = Новый Структура;
				мИскомыйОбъект.Вставить("КорневойТип", ирОбщий.ПервыйФрагментЛкс(ОбластьПоиска));
				мИскомыйОбъект.Вставить("ТипТаблицы", ирОбщий.ТипТаблицыБДЛкс(ОбластьПоиска));
				мИскомыйОбъект.Вставить("МетаОбъект", МетаданныеОбъекта);
				ЕстьТаблицаИзменений = Истина
					И мИскомыйОбъект.ТипТаблицы <> "Точки"
					И ирОбщий.ЕстьТаблицаИзмененийОбъектаМетаданных(мИскомыйОбъект.Метаобъект);
				мТекстЗапросаКоличестваСтрок = "ВЫБРАТЬ Количество(*) ИЗ " + ПолноеИмяТаблицы;
			КонецЕсли;
		Иначе
			ЭтотОбъект.ОбластьПоиска = "";
			Компоновщик = Новый КомпоновщикНастроекКомпоновкиДанных;
			Компоновщик.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(Новый СхемаКомпоновкиДанных));
		КонецЕсли;
	КонецЕсли; 
	ЭтаФорма.КоличествоСтрокВОбластиПоиска = "...";
	Если Не ирКэш.ЛиПортативныйРежимЛкс() И Не ирКэш.ЭтоФайловаяБазаЛкс() Тогда
		ирОбщий.ОтменитьФоновоеЗаданиеЛкс(мИДФоновогоЗадания);
		мАдресХранилищаКоличестваСтрок = ПоместитьВоВременноеХранилище(Null, Новый УникальныйИдентификатор);
		ПараметрыЗапуска = Новый Массив;
		ПараметрыЗапуска.Добавить(мТекстЗапросаКоличестваСтрок);
		ПараметрыЗапуска.Добавить(мАдресХранилищаКоличестваСтрок);
		#Если Сервер И Не Сервер Тогда
			ирОбщий.ПростойРезультатЗапросаЛкс();
		#КонецЕсли
		ФоновоеЗадание = ФоновыеЗадания.Выполнить("ирОбщий.ПростойРезультатЗапросаЛкс", ПараметрыЗапуска);
		мИДФоновогоЗадания = ФоновоеЗадание.УникальныйИдентификатор;
	КонецЕсли; 
	#Если Сервер И Не Сервер Тогда
		ОбновитьКоличествоСтрокВОбластиПоиска();
	#КонецЕсли
	ПодключитьОбработчикОжидания("ОбновитьКоличествоСтрокВОбластиПоиска", 0.1, Истина);
	мДоступнаЗапись = мИскомыйОбъект <> Неопределено И Не ирОбщий.ЛиТипТаблицыМетассылкиЛкс(мИскомыйОбъект.ТипТаблицы);
	ЭлементыФормы.РежимОбходаДанных1.Доступность = мДоступнаЗапись;
	ЭлементыФормы.РежимОбходаДанных2.Доступность = мДоступнаЗапись;
	ЭлементыФормы.РежимОбходаДанных3.Доступность = мДоступнаЗапись;
	ЭлементыФормы.УзелОтбораОбъектов.Доступность = ЕстьТаблицаИзменений;
	ЭлементыФормы.УдалятьРегистрациюНаУзлеПослеОбработкиОбъекта.Доступность = ЕстьТаблицаИзменений;
	ЭлементыФормы.ИспользоватьОтборПоУзлу.Доступность = ЕстьТаблицаИзменений;
	ЭлементыФормы.УдалятьРегистрациюНаУзлеПослеОбработкиОбъекта.Доступность = ЕстьТаблицаИзменений;
	ЭлементыФормы.КПСтрокиДляОбработки.Кнопки.ОбработкаСвязанногоРегистра.Доступность = мИскомыйОбъект <> Неопределено И ирОбщий.ЛиКорневойТипСсылкиЛкс(мИскомыйОбъект.ТипТаблицы);
	ЭтотОбъект.мСхемаКолонок = Новый Структура();
	Если МетаданныеОбъекта <> Неопределено Тогда
		МассивФрагментов = ирОбщий.СтрРазделитьЛкс(ПолноеИмяТаблицы);
		ОбъектМДЗаписи = ирКэш.ОбъектМДПоПолномуИмениЛкс(МассивФрагментов[0] + "." + МассивФрагментов[1]);
		ЭлементыФормы.ПроводитьПроведенныеДокументыПриЗаписи.Видимость = Истина
			И мИскомыйОбъект.КорневойТип = "Документ"
			И ОбъектМДЗаписи.Проведение = Метаданные.СвойстваОбъектов.Проведение.Разрешить;
		//ЭлементыФормы.РежимОбходаДанных1.Доступность = Ложь
		//	Или ирОбщий.ЛиКорневойТипРегистраБДЛкс(мИскомыйОбъект.КорневойТип)
		//	Или ирОбщий.ЛиКорневойТипПоследовательностиЛкс(мИскомыйОбъект.КорневойТип)
		//	Или ирОбщий.ЛиТипВложеннойТаблицыБДЛкс(мИскомыйОбъект.ТипТаблицы);
		//ДоступностьОбъектныхРежимовОбхода = Ложь
		//	Или ирОбщий.ЛиКорневойТипСсылочногоОбъектаБДЛкс(мИскомыйОбъект.ТипТаблицы)
		//	Или ирОбщий.ЛиКорневойТипРегистраБДЛкс(мИскомыйОбъект.КорневойТип)
		//	Или ирОбщий.ЛиКорневойТипПоследовательностиЛкс(мИскомыйОбъект.КорневойТип)
		//	Или ирОбщий.ЛиТипВложеннойТаблицыБДЛкс(мИскомыйОбъект.ТипТаблицы);
		//ЭлементыФормы.РежимОбходаДанных2.Доступность = ДоступностьОбъектныхРежимовОбхода;
		//ЭлементыФормы.РежимОбходаДанных3.Доступность = ДоступностьОбъектныхРежимовОбхода;
		НастроитьКомпоновщик(СохранятьТекущиеНастройки, ЗагружатьТекущиеНастройки, НастройкиНабораТаблицБД);
		СтрокиДляОбработки = Новый ТаблицаЗначений;
		Если МноготабличнаяВыборка Тогда
			СтрокиДляОбработки.Колонки.Добавить(мИмяКолонкиПолногоИмениТаблицы, Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(300)));
		КонецЕсли; 
		ПоляТаблицыБД = ирКэш.ПоляТаблицыБДЛкс(ПолноеИмяТаблицы);
		мСтруктураКлюча = ирОбщий.СтруктураКлючаТаблицыБДЛкс(ПолноеИмяТаблицы);
		Для Каждого ЭлементКлюча Из мСтруктураКлюча Цикл
			ОписаниеПоляТаблицы = ПоляТаблицыБД.Найти(ЭлементКлюча.Ключ, "Имя");
			Если Истина
				И МноготабличнаяВыборка
				И ирОбщий.ЛиКорневойТипСсылкиЛкс(мИскомыйОбъект.ТипТаблицы)
				И ЭлементКлюча.Ключ = ИмяПоляСсылка
			Тогда
				ОписаниеТипов = ПолучитьОписаниеТиповКлючейРезультатов();
			Иначе
				ОписаниеТипов = ОписаниеПоляТаблицы.ТипЗначения;
			КонецЕсли; 
			СтрокиДляОбработки.Колонки.Добавить(ЭлементКлюча.Ключ, ОписаниеТипов, ОписаниеПоляТаблицы.Заголовок);
			мСхемаКолонок.Вставить(ЭлементКлюча.Ключ, ЭлементКлюча.Ключ);
		КонецЦикла;
		ДобавитьСлужебныеКолонкиВТаблицуВыборки();
		ЗаполнитьКолонкиТабличногоПоляВыборки();
		ОбновитьРазмерДинамическойТаблицы();
	КонецЕсли; 
	НастроитьЭлементыФормы();
	Возврат ОбластьПоиска <> "";

КонецФункции

Процедура ДобавитьСлужебныеКолонкиВТаблицуВыборки()
	
	СтрокиДляОбработки.Колонки.Вставить(0, мИмяКолонкиПометки, Новый ОписаниеТипов("Булево"));
	СтрокиДляОбработки.Колонки.Добавить(мИмяКолонкиОтсутствияСтрокиВБД, Новый ОписаниеТипов("Булево, Строка"));
	СтрокиДляОбработки.Колонки.Добавить(мИмяКолонкиРезультатаОбработки, Новый ОписаниеТипов("Строка"));
	СтрокиДляОбработки.Колонки.Добавить(мИмяКолонкиСообщенияОбработки, Новый ОписаниеТипов("Строка"));

КонецПроцедуры

Процедура ОбновитьКоличествоСтрокВОбластиПоиска()
	
	Если Не ирКэш.ЛиПортативныйРежимЛкс() И Не ирКэш.ЭтоФайловаяБазаЛкс() Тогда
		ФоновоеЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(мИДФоновогоЗадания);
		Если ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
			ПодключитьОбработчикОжидания("ОбновитьКоличествоСтрокВОбластиПоиска", 2, Истина);
		Иначе
			Результат = ПолучитьИзВременногоХранилища(мАдресХранилищаКоличестваСтрок);
			УдалитьИзВременногоХранилища(мАдресХранилищаКоличестваСтрок);
		КонецЕсли; 
	Иначе
		Результат = ирОбщий.ПростойРезультатЗапросаЛкс(мТекстЗапросаКоличестваСтрок);
	КонецЕсли;
	Если Результат <> Неопределено Тогда
		ЭтаФорма.КоличествоСтрокВОбластиПоиска = Результат;
	КонецЕсли; 

КонецПроцедуры

Процедура ОбновлениеОтображения()

	ирОбщий.Форма_ОбновлениеОтображенияЛкс(ЭтаФорма);
	Если Истина
		И ЭлементыФормы.СтрокиДляОбработки.Колонки.Найти(мИмяКолонкиПометки) <> Неопределено
		И ЭлементыФормы.СтрокиДляОбработки.Колонки[мИмяКолонкиПометки].Видимость
	Тогда
		СтрокаКоличествоСтрок = СтрокиДляОбработки.Количество();
	КонецЕсли; 
	ПредставлениеОтбора = "" + Компоновщик.Настройки.Отбор;
	Если ЗначениеЗаполнено(СтрокаПоиска) Тогда
		Если Не ПустаяСтрока(ПредставлениеОтбора) Тогда
			ПредставлениеОтбора = ПредставлениеОтбора + " И ";
		КонецЕсли; 
		ПредставлениеОтбора = ПредставлениеОтбора + "Строковые поля содержат """ + СтрокаПоиска + """";
	КонецЕсли; 
	Для Каждого ПолеБитыхСсылок Из ПоляБитыхСсылок.НайтиСтроки(Новый Структура("Пометка", Истина)) Цикл
		Если Не ПустаяСтрока(ПредставлениеОтбора) Тогда
			ПредставлениеОтбора = ПредставлениеОтбора + " И ";
		КонецЕсли; 
		ПредставлениеОтбора = ПредставлениеОтбора + ПолеБитыхСсылок.Поле + " Не существует";
	КонецЦикла;
	Если Не ЗначениеЗаполнено(ПредставлениеОтбора) Тогда
		ПредставлениеОтбора = "Нет";
	КонецЕсли; 
	ПредставлениеОтбора = "Отбор: " + ПредставлениеОтбора;
	ЭлементыФормы.НадписьОтбор.Заголовок = ПредставлениеОтбора;
	ЭлементыФормы.Панель.Страницы.Обработки.Доступность = СтрокиДляОбработки.Количество() > 0;
	
КонецПроцедуры

Процедура ПостроительОтчетаОтборЗначениеОкончаниеВводаТекста(Элемент, Текст, Значение, СтандартнаяОбработка)
	
	ирОбщий.ПолеВвода_ОкончаниеВводаТекстаЛкс(Элемент, Текст, Значение, СтандартнаяОбработка);

КонецПроцедуры

Процедура КПСтрокиДляОбработкиПодбор(Кнопка = Неопределено)
	
	ОписаниеТипов = ПолучитьОписаниеТиповКлючейРезультатов();
	НачальноеЗначениеВыбора = ПолучитьКлючСтрокиДляОбработки();
	ирОбщий.ОткрытьПодборСВыборомТипаЛкс(ЭлементыФормы.СтрокиДляОбработки, ОписаниеТипов, НачальноеЗначениеВыбора);
	
КонецПроцедуры

Функция ПолучитьКлючСтрокиДляОбработки(Знач ТекущаяСтрока = Неопределено) Экспорт 
	
	Если ТекущаяСтрока = Неопределено Тогда
		ТекущаяСтрока = ЭлементыФормы.СтрокиДляОбработки.ТекущаяСтрока;
	КонецЕсли; 
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли; 
	Если ирОбщий.ЛиКорневойТипСсылочногоОбъектаБДЛкс(мИскомыйОбъект.ТипТаблицы) Тогда 
		ИмяПоляСсылка = ирОбщий.ПеревестиСтроку("Ссылка");
		НачальнаяСтрока = ТекущаяСтрока[ИмяПоляСсылка];
	Иначе
		Если МноготабличнаяВыборка Тогда
			ПолноеИмяТаблицы = ТекущаяСтрока[мИмяКолонкиПолногоИмениТаблицы]; 
		Иначе
			ПолноеИмяТаблицы = ирОбщий.ИмяТаблицыИзМетаданныхЛкс(мИскомыйОбъект.МетаОбъект);
		КонецЕсли;
		НачальнаяСтрока = ирОбщий.КлючСтрокиТаблицыБДИзСтрокиТаблицыЗначенийЛкс(ПолноеИмяТаблицы, ТекущаяСтрока);
	КонецЕсли;
	Возврат НачальнаяСтрока;

КонецФункции

Функция ПолучитьОписаниеТиповКлючейРезультатов()

	МассивТипов = Новый Массив();
	Если МноготабличнаяВыборка Тогда
		Для Каждого ЭлементСписка Из ОбластьПоиска Цикл
			ТипКлюча = ирОбщий.ТипКлючаЗаписиТаблицыЛкс(ЭлементСписка.Значение);
			МассивТипов.Добавить(ТипКлюча);
		КонецЦикла; 
	Иначе
		ТипКлюча = ирОбщий.ТипКлючаЗаписиТаблицыЛкс(ОбластьПоиска);
		МассивТипов.Добавить(ТипКлюча);
	КонецЕсли; 
	ОписаниеТипов = Новый ОписаниеТипов(МассивТипов);
	Возврат ОписаниеТипов;

КонецФункции

Процедура СтрокиДляОбработкиОбработкаВыбора(Элемент, Знач ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) <> Тип("Массив") Тогда
		Массив = Новый Массив();
		Массив.Добавить(ВыбранноеЗначение);
		ВыбранноеЗначение = Массив;
	КонецЕсли;
	ОписаниеТипов = ПолучитьОписаниеТиповКлючейРезультатов();
	ИмяПоляСсылка = ирОбщий.ПеревестиСтроку("Ссылка");
	Для Каждого ЭлементМассива Из ВыбранноеЗначение Цикл
		НайденнаяСтрока = Неопределено;
		ПолноеИмяМДЭлемента = ирОбщий.ПолучитьПолноеИмяМДТипаЛкс(ТипЗнч(ЭлементМассива));
		Если Истина
			И (Ложь
				Или ирОбщий.ЛиКорневойТипСсылочногоОбъектаБДЛкс(мИскомыйОбъект.ТипТаблицы)
				Или ирОбщий.ЛиТипТаблицыМетассылкиЛкс(мИскомыйОбъект.ТипТаблицы))
			И ОписаниеТипов.СодержитТип(ТипЗнч(ЭлементМассива))
		Тогда
			НайденнаяСтрока = СтрокиДляОбработки.Найти(ЭлементМассива, ИмяПоляСсылка);
			СтандартнаяОбработка = Ложь;
			Если НайденнаяСтрока = Неопределено Тогда
				СтрокаОбъекта = СтрокиДляОбработки.Добавить();
				СтрокаОбъекта[ИмяПоляСсылка] = ЭлементМассива;
				СтрокаОбъекта[мИмяКолонкиПометки] = Истина;
				Если МноготабличнаяВыборка Тогда
					СтрокаОбъекта[мИмяКолонкиПолногоИмениТаблицы] = ПолноеИмяМДЭлемента;
				КонецЕсли; 
				//ЗаполнитьЗначенияСвойств(СтрокаОбъекта, ВыбранноеЗначение); 
				Элемент.ОбновитьСтроки();
			Иначе
				ЭлементыФормы.СтрокиДляОбработки.ТекущаяСтрока = НайденнаяСтрока;
			КонецЕсли; 
		ИначеЕсли Истина
			И ирОбщий.ЛиКорневойТипРегистраБДЛкс(мИскомыйОбъект.ТипТаблицы) 
		Тогда
			СтруктураКлюча = ирОбщий.СтруктураИзКлючаЗаписиЛкс(ЭлементМассива,, Истина);
			НайденныеСтроки = СтрокиДляОбработки.НайтиСтроки(СтруктураКлюча);
			Если НайденныеСтроки.Количество() > 0 Тогда
				НайденнаяСтрока = НайденныеСтроки[0];
			Иначе
				НайденнаяСтрока = Неопределено;
			КонецЕсли; 
			СтандартнаяОбработка = Ложь;
			Если НайденнаяСтрока = Неопределено Тогда
				СтрокаОбъекта = СтрокиДляОбработки.Добавить();
				СтрокаРезультата = ирОбщий.СтрокаТаблицыБДПоКлючуЛкс(ирОбщий.ИмяТаблицыИзМетаданныхЛкс(ПолноеИмяМДЭлемента), СтруктураКлюча);
				ЗаполнитьЗначенияСвойств(СтрокаОбъекта, СтрокаРезультата); 
				СтрокаОбъекта[мИмяКолонкиПометки] = Истина;
				Если МноготабличнаяВыборка Тогда
					СтрокаОбъекта[мИмяКолонкиПолногоИмениТаблицы] = ПолноеИмяМДЭлемента;
				КонецЕсли; 
				Элемент.ОбновитьСтроки();
			Иначе
				ЭлементыФормы.СтрокиДляОбработки.ТекущаяСтрока = НайденнаяСтрока;
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗагрузитьСтрокиДляОбработки(Массив, ОчиститьТекущийСписок = Истина, ВыбранныеПоля = Неопределено) Экспорт
	
	//УстановитьОбластьПоиска(ирОбщий.ИмяТаблицыИзМетаданныхЛкс(ОбъектМД.ПолноеИмя()));
	СписокПолныхИменМД = Новый СписокЗначений;
	ЭтоРегистроваяВыборка = Неопределено;
	Для Каждого КлючЗаписи Из Массив Цикл
		Если КлючЗаписи = Неопределено Тогда
			Продолжить;
		КонецЕсли; 
		Если ТипЗнч(КлючЗаписи) = Тип("Структура") Тогда
			ПолноеИмяМД = КлючЗаписи.ПолноеИмяТаблицы;
			КлючЗаписи = КлючЗаписи.Структура;
		Иначе
			ТипКлючаЗаписи = ирОбщий.ТипОбъектаБДЛкс(КлючЗаписи);
			ПолноеИмяМД = ирОбщий.ПолучитьПолноеИмяМДТипаЛкс(ТипКлючаЗаписи);
		КонецЕсли; 
		ЭтоРегистр = ирОбщий.ЛиКорневойТипРегистраБДЛкс(ирОбщий.ПервыйФрагментЛкс(ПолноеИмяМД));
		Если ЭтоРегистроваяВыборка = Неопределено Тогда
			ЭтоРегистроваяВыборка = ЭтоРегистр;
		КонецЕсли; 
		Если Ложь
			Или (Истина
				И ЭтоРегистроваяВыборка
				И (Ложь
					Или СписокПолныхИменМД.Количество() = 0
					Или ПолноеИмяМД = СписокПолныхИменМД[0].Значение))
			Или (Не ЭтоРегистроваяВыборка И Не ЭтоРегистр)
		Тогда
			Если СписокПолныхИменМД.НайтиПоЗначению(ПолноеИмяМД) = Неопределено Тогда
				СписокПолныхИменМД.Добавить(ПолноеИмяМД);
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла; 
	Если СписокПолныхИменМД.Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 
	ЭтотОбъект.МноготабличнаяВыборка = СписокПолныхИменМД.Количество() > 1; 
	ЭтотОбъект.ДинамическаяВыборка = Ложь;
	Если МноготабличнаяВыборка Тогда
		УстановитьОбластьПоиска(СписокПолныхИменМД);
	Иначе
		НовоеПолноеИмяМД = СписокПолныхИменМД[0].Значение;
		УстановитьОбластьПоиска(НовоеПолноеИмяМД);
	КонецЕсли;
	Если ВыбранныеПоля <> Неопределено Тогда
		ДобавитьВыбранныеПоля(ВыбранныеПоля);
	КонецЕсли; 
	Если ОчиститьТекущийСписок Тогда
		СтрокиДляОбработки.Очистить();
	КонецЕсли; 
	БылиПропуски = Ложь;
	ИмяПоляСсылка = ирОбщий.ПеревестиСтроку("Ссылка");
	Для Каждого КлючЗаписи Из Массив Цикл
		Если ТипЗнч(КлючЗаписи) = Тип("Структура") Тогда
			ТипКлючаЗаписи = Тип("Строка");
			ПолноеИмяМД = КлючЗаписи.ПолноеИмяТаблицы;
			КлючЗаписи = КлючЗаписи.Структура;
		Иначе
			ТипКлючаЗаписи = ирОбщий.ТипОбъектаБДЛкс(КлючЗаписи);
			ПолноеИмяМД = ирОбщий.ПолучитьПолноеИмяМДТипаЛкс(ТипКлючаЗаписи);
		КонецЕсли; 
		Если СписокПолныхИменМД.НайтиПоЗначению(ПолноеИмяМД) = Неопределено Тогда
			БылиПропуски = Истина;
			Продолжить;
		КонецЕсли;
		СтрокаДанных = СтрокиДляОбработки.Добавить();
		Если Ложь
			Или ирОбщий.ЛиСсылкаНаПеречислениеЛкс(КлючЗаписи) 
			Или ирОбщий.ЛиТипСсылкиТочкиМаршрутаЛкс(ТипКлючаЗаписи) 
		Тогда
			СтрокаДанных[ИмяПоляСсылка] = КлючЗаписи;
		Иначе
			Если ирОбщий.ЛиКлючЗаписиРегистраЛкс(ТипКлючаЗаписи) Тогда 
				КлючЗаписи = ирОбщий.СтруктураИзКлючаЗаписиЛкс(КлючЗаписи,, Истина);
			КонецЕсли; 
			ЗаполнитьЗначенияСвойств(СтрокаДанных, КлючЗаписи);  // Здесь наверное может неоправдано наполняться объектный кэш
		КонецЕсли; 
		СтрокаДанных[мИмяКолонкиПометки] = Истина;
		Если МноготабличнаяВыборка Тогда
			СтрокаДанных[мИмяКолонкиПолногоИмениТаблицы] = ПолноеИмяМД;
		КонецЕсли; 
	КонецЦикла;
	Если ВыбранныеПоля <> Неопределено Тогда
		ОбновитьКоллекциюРезультата(Ложь);
	КонецЕсли; 
	Если БылиПропуски Тогда
		ирОбщий.СообщитьЛкс("Некоторые объекты не были загружены, т.к. не могут быть совместно обработаны");
	КонецЕсли; 
	ВосстановитьТекущуюСтрокуСтрокДляОбработки();
	мВопросНаОбновлениеСтрокДляОбработкиЗадавался = Истина;
	ЭлементыФормы.Панель.ТекущаяСтраница = ЭлементыФормы.Панель.Страницы.СтрокиДляОбработки;

КонецПроцедуры

Процедура ДобавитьВыбранныеПоля(Знач ВыбранныеПоля)
	
	Для Каждого ВыбранноеПоле Из ВыбранныеПоля Цикл
		ирОбщий.НайтиДобавитьЭлементНастроекКомпоновкиПоПолюЛкс(Компоновщик.Настройки.Выбор, ВыбранноеПоле);
	КонецЦикла;

КонецПроцедуры

Процедура ПриПолученииДанныхДоступныхПолей(Элемент, ОформленияСтрок)

	ирОбщий.ПриПолученииДанныхДоступныхПолейКомпоновкиЛкс(ЭтаФорма, Элемент, ОформленияСтрок);
	Для Каждого ОформлениеСтроки Из ОформленияСтрок Цикл
		Если КоллекцияОтключенныхПолей.Найти("__" + ОформлениеСтроки.ДанныеСтроки.Поле) <> Неопределено Тогда
			ОформлениеСтроки.Ячейки.Заголовок.ЦветТекста = WebЦвета.Красный;
		КонецЕсли;
	КонецЦикла;
	Если ТипЗнч(ОбластьПоиска) = Тип("Строка") И ЗначениеЗаполнено(ОбластьПоиска) Тогда
		ПоляСМетаданными = ирКэш.ПоляТаблицыБДЛкс(ОбластьПоиска,,, Ложь);
		Если ПоляСМетаданными <> Неопределено Тогда
			Для Каждого ОформлениеСтроки Из ОформленияСтрок Цикл
				СтрокаПоля = ПоляСМетаданными.Найти("" + ОформлениеСтроки.ДанныеСтроки.Поле, "Имя");
				ЭтоИзмерение = Истина
					И СтрокаПоля <> Неопределено 
					И СтрокаПоля.Метаданные <> Неопределено
					И Найти(СтрокаПоля.Метаданные.ПолноеИмя(), ".Измерение.") > 0;
				ТекстВСкобках = "";
				Если ЭтоИзмерение Тогда
					ТекстВСкобках = ТекстВСкобках + ",Измерение";
					ОформлениеСтроки.ЦветФона= Новый Цвет(255, 245, 240);
				КонецЕсли; 
				Если ЗначениеЗаполнено(ТекстВСкобках) Тогда
					ТекстВСкобках = " (" + Сред(ТекстВСкобках, 2) + ")";
					ОформлениеСтроки.Ячейки.Заголовок.УстановитьТекст(ОформлениеСтроки.Ячейки.Заголовок.Текст + ТекстВСкобках);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли; 
	КонецЕсли; 

КонецПроцедуры

Процедура ПредставлениеОбластиПоискаПриИзменении(Элемент)

	Если УстановитьОбластьПоиска(Элемент.Значение) Тогда 
		ирОбщий.ПолеВводаСИсториейВыбора_ПриИзмененииЛкс(Элемент, ЭтаФорма);
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПредставлениеОбластиПоискаНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	ирОбщий.ПолеВводаСИсториейВыбора_НачалоВыбораИзСпискаЛкс(Элемент, ЭтаФорма);

КонецПроцедуры

Процедура ПредставлениеОбластиПоискаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		лПолноеИмяОбъекта = Неопределено;
		Если ВыбранноеЗначение.Свойство("ПолноеИмяОбъекта", лПолноеИмяОбъекта) Тогда
			ОбластьПоиска = лПолноеИмяОбъекта;
			ПредставлениеОбластиПоискаПриИзменении(Элемент);
		КонецЕсли;
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("Строка") Тогда
		ОбластьПоиска = ВыбранноеЗначение;
		ПредставлениеОбластиПоискаПриИзменении(Элемент);
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		ЭтаФорма.ОбластьПоиска = Новый СписокЗначений;
		ОбластьПоиска.ЗагрузитьЗначения(ВыбранноеЗначение);
		ПредставлениеОбластиПоискаПриИзменении(Элемент);
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("СписокЗначений") Тогда
		ЭтаФорма.ОбластьПоиска = ВыбранноеЗначение;
		ПредставлениеОбластиПоискаПриИзменении(Элемент);
	КонецЕсли;
		
КонецПроцедуры

Процедура КПСтрокиДляОбработкиСнятьПометкиУспешноОбработанных(Кнопка)
	
	НайденныеСтроки = СтрокиДляОбработки.НайтиСтроки(Новый Структура(мИмяКолонкиРезультатаОбработки, "Успех"));
	Для Каждого СтрокаТаблицы Из НайденныеСтроки Цикл
		СтрокаТаблицы[мИмяКолонкиПометки] = Ложь;
	КонецЦикла;
	
КонецПроцедуры

Процедура КПСтрокиДляОбработкиОтборБезЗначенияВТекущейКолонке(Кнопка)
	
	ОтборИзменен = ирОбщий.ТабличноеПолеОтборБезЗначенияВТекущейКолонке_КнопкаЛкс(ЭлементыФормы.СтрокиДляОбработки, Компоновщик.Настройки.Отбор, Истина);
	Если ОтборИзменен Тогда
		ПослеИзмененияОтбораНаСтраницеСтрокиДляОбработки();
	КонецЕсли; 
	
КонецПроцедуры

Процедура КПСтрокиДляОбработкиОтборПоЗначению(Кнопка)
	
	ОтборИзменен = ирОбщий.ТабличноеПолеОтборПоЗначениюВТекущейКолонкеЛкс(ЭлементыФормы.СтрокиДляОбработки, Компоновщик.Настройки.Отбор, Истина);
	Если ОтборИзменен Тогда
		ПослеИзмененияОтбораНаСтраницеСтрокиДляОбработки();
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПослеИзмененияОтбораНаСтраницеСтрокиДляОбработки()
	
	ЭлементыФормы.КомпоновщикОтбор.Развернуть(ЭлементыФормы.КомпоновщикОтбор.Значение, Истина);
	Ответ = Вопрос("Перезаполнить строки для обработки?", РежимДиалогаВопрос.ДаНет);
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЗаполнитьСтроки();
	КонецЕсли;

КонецПроцедуры

Процедура КПСтрокиДляОбработкиРедакторОбъектаБД(Кнопка)
	
	Если МноготабличнаяВыборка Тогда
		Если ЭлементыФормы.СтрокиДляОбработки.ТекущаяСтрока = Неопределено Тогда
			Возврат;
		КонецЕсли; 
		ПолноеИмяМД = ЭлементыФормы.СтрокиДляОбработки.ТекущаяСтрока[мИмяКолонкиПолногоИмениТаблицы];
	Иначе
		ПолноеИмяМД = ОбластьПоиска;
	КонецЕсли; 
	ирОбщий.ОткрытьТекущуюСтрокуТабличногоПоляТаблицыБДВРедактореОбъектаБДЛкс(ЭлементыФормы.СтрокиДляОбработки, ПолноеИмяМД, Компоновщик.Настройки.ДоступныеПоляВыбора,,,,, Истина);

КонецПроцедуры

Процедура СтрокиДляОбработкиПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки) Экспорт
	
	ирОбщий.ТабличноеПолеПриВыводеСтрокиЛкс(ЭтаФорма, Элемент, ОформлениеСтроки, ДанныеСтроки, ЭлементыФормы.КПСтрокиДляОбработки.Кнопки.Идентификаторы);

КонецПроцедуры

Процедура КПСтрокиДляОбработкиПустые(Кнопка)
	
	Кнопка.Пометка = Не Кнопка.Пометка;
	ЭлементыФормы.СтрокиДляОбработки.ОбновитьСтроки();
	
КонецПроцедуры

Процедура РежимОбходаДанныхПриИзменении(Элемент)
	
	
	
КонецПроцедуры

Процедура ДоступныеОбработкиНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	Выполнение = ОбработкаРазрешенаДляТаблицы(Элемент.ТекущаяСтрока);
	
КонецПроцедуры

Процедура ВыбранныеОбработкиПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Колонка)
	
	Если ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("СтрокаДереваЗначений") Тогда
		Если Истина
			И ПараметрыПеретаскивания.Значение.Владелец() = ДоступныеОбработки 
			И Не ПараметрыПеретаскивания.Значение.Независимая
		Тогда
			ПараметрыПеретаскивания.ДопустимыеДействия = ДопустимыеДействияПеретаскивания.Копирование;
			СтандартнаяОбработка = Ложь;
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

Процедура ВыбранныеОбработкиПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Колонка)
	
	Если ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("СтрокаДереваЗначений") Тогда
		Если ПараметрыПеретаскивания.Значение.Владелец() = ДоступныеОбработки Тогда
			СтрокаВыбраннойОбработки = Элемент.Значение.Добавить();
			СтрокаВыбраннойОбработки.Пометка = Истина;
			СтрокаВыбраннойОбработки.СтрокаДоступнойОбработки = ПараметрыПеретаскивания.Значение;
			Элемент.ТекущаяСтрока = СтрокаВыбраннойОбработки;
			СтандартнаяОбработка = Ложь;
		КонецЕсли; 
	КонецЕсли; 

КонецПроцедуры

Процедура ОбновитьКоллекциюРезультата(ЗадаватьВопросПередПеречитыванием = Ложь) Экспорт 
	
	Если ЭлементыФормы.СтрокиДляОбработки.Колонки.Количество() > 0 Тогда 
		СохранитьСтарыеКолонкиТабличногоПоляРезультата();
	КонецЕсли; 
	НастройкаКомпоновки = Неопределено;
	Запрос = ПолучитьЗапросВыборки(НастройкаКомпоновки); // Внутри обновится мТекстЗапросаБезУсловий
	Для Каждого КлючИЗначение Из мСхемаКолонок Цикл
		Если СтрокиДляОбработки.Колонки.Найти(КлючИЗначение.Ключ) = Неопределено Тогда
			ДоступноеПолеКомпоновки = Компоновщик.Настройки.ДоступныеПоляВыбора.НайтиПоле(Новый ПолеКомпоновкиДанных(КлючИЗначение.Значение));
			СтрокиДляОбработки.Колонки.Добавить(КлючИЗначение.Ключ, ДоступноеПолеКомпоновки.Тип, ДоступноеПолеКомпоновки.Заголовок);
		КонецЕсли; 
	КонецЦикла;
	//СтруктураКлюча = ирОбщий.ПолучитьСтруктуруКлючаТаблицыБДЛкс(ПолноеИмяПервойТаблицыБД());
	СтруктураКлюча = ирОбщий.КопияОбъектаЛкс(мСтруктураКлюча);
	#Если Сервер И Не Сервер Тогда
	    СтруктураКлюча = Новый Структура;
	#КонецЕсли
	КолонкиДляОбновления = "";
	Для Каждого Колонка Из СтрокиДляОбработки.Колонки Цикл
		Если Ложь
			Или СтруктураКлюча.Свойство(Колонка.Имя)
			Или (Истина
				И МноготабличнаяВыборка
				И Колонка.Имя = мИмяКолонкиПолногоИмениТаблицы)
			Или мИмяКолонкиПометки = Колонка.Имя
			Или мИмяКолонкиРезультатаОбработки = Колонка.Имя
			Или мИмяКолонкиСообщенияОбработки = Колонка.Имя
			Или Не мСхемаКолонок.Свойство(Колонка.Имя)
		Тогда
			Продолжить;
		КонецЕсли; 
		Если КолонкиДляОбновления <> "" Тогда
			КолонкиДляОбновления = КолонкиДляОбновления + ",";
		КонецЕсли; 
		КолонкиДляОбновления = КолонкиДляОбновления + "Т." + мСхемаКолонок[Колонка.Имя];
	КонецЦикла;
	ЗаполнитьКолонкиТабличногоПоляВыборки(НастройкаКомпоновки);
	мВопросНаОбновлениеСтрокДляОбработкиЗадавался = Истина;
	//Если КолонкиДляОбновления <> "" Тогда
		Если ТипЗнч(КоличествоСтрокВОбластиПоиска) = Тип("Число") И КоличествоСтрокВОбластиПоиска > 1000000 И ирОбщий.ТипТаблицыБДЛкс(ОбластьПоиска) = "РегистрБухгалтерии" Тогда
			ирОбщий.СообщитьЛкс("Перечитывание данных для большой таблицы регистра бухгалтерии не будет выполнено.");
		Иначе
			ПомеченныеСтроки = СтрокиДляОбработки.НайтиСтроки(Новый Структура(мИмяКолонкиПометки, Истина));
			Ответ = "ПеречитатьВсе";
			ПомеченныхСильноМеньше = СтрокиДляОбработки.Количество() - ПомеченныеСтроки.Количество() > 1000;
			Если Ложь
				Или ЗадаватьВопросПередПеречитыванием 
				Или ПомеченныхСильноМеньше
			Тогда
				СписокОтветов = Новый СписокЗначений;
				СписокОтветов.Добавить("ПеречитатьВсе", "Перечитать все");
				Если ПомеченныхСильноМеньше Тогда
					СписокОтветов.Добавить("ПеречитатьПомеченные", "Перечитать помеченные");
					Ответ = "ПеречитатьПомеченные";
				КонецЕсли; 
				СписокОтветов.Добавить("НеПеречитывать", "Не перечитывать");
				Ответ = Вопрос("Хотите перечитать данные в дополнительных (неключевых) колонках строк для обработки (можеть быть долго)?", СписокОтветов,, Ответ,, "НеПеречитывать");
				Если Ответ = "НеПеречитывать" Тогда
					Возврат;
				КонецЕсли;
			КонецЕсли; 
			Если Ответ = "ПеречитатьПомеченные" Тогда
				СтрокиДляПеречитывания = ПомеченныеСтроки;
			Иначе
				СтрокиДляПеречитывания = СтрокиДляОбработки;
			КонецЕсли; 
			ПроверитьДобавитьИндексВСтрокиДляОбработки();
			КолонкиКлюча = "";
			Для Каждого КлючИзначение Из мСтруктураКлюча Цикл
				Если Истина
					И ирКэш.НомерВерсииПлатформыЛкс() < 803012
					И КлючИзначение.Значение.СодержитТип(Тип("УникальныйИдентификатор"))
				Тогда
					// https://partners.v8.1c.ru/forum/t/1570237/m/1570237
					ирОбщий.СообщитьЛкс("Перечитать данные по ключу, содержащему тип УникальныйИдентификатор (в измерении " + КлючИзначение.Ключ + "), нельзя из-за ограничений платформы");
					Возврат;
				КонецЕсли; 
				Если КолонкиКлюча <> "" Тогда
					КолонкиКлюча = КолонкиКлюча + ",";
				КонецЕсли; 
				КолонкиКлюча = КолонкиКлюча + КлючИзначение.Ключ;
				Если КолонкиДляОбновления <> "" Тогда
					КолонкиДляОбновления = КолонкиДляОбновления + ", ";
				КонецЕсли; 
				КолонкиДляОбновления = КолонкиДляОбновления + "Т." + КлючИзначение.Ключ;
			КонецЦикла;
			Если МноготабличнаяВыборка Тогда
				КолонкиКлюча = КолонкиКлюча + ", " + мИмяКолонкиПолногоИмениТаблицы;
			КонецЕсли;
			Для Каждого СтрокаДляПеречитывания Из СтрокиДляПеречитывания Цикл
				СтрокаДляПеречитывания[мИмяКолонкиОтсутствияСтрокиВБД] = Истина;
			КонецЦикла;
			Если СтрокиДляОбработки = СтрокиДляПеречитывания Тогда
				ТаблицаКлючей = СтрокиДляОбработки.Скопировать(, КолонкиКлюча);
			Иначе
				ТаблицаКлючей = СтрокиДляОбработки.Скопировать(СтрокиДляПеречитывания, КолонкиКлюча);
			КонецЕсли; 
			Если мИскомыйОбъект.ТипТаблицы <> "Внешняя" Тогда
				ИмяВременнойТаблицы = "ТаблицаКлючей";
			Иначе
				ИмяВременнойТаблицы = мИскомыйОбъект.МетаОбъект.Родитель().ПолноеИмя() + ".ВременнаяТаблица.ТаблицаКлючей";
			КонецЕсли; 
			//ТекстВложенногоЗапроса = СтрЗаменить(мТекстЗапросаБезУсловий, "}", "} (" + КолонкиКлюча + ") В (ВЫБРАТЬ * ИЗ ТаблицаКлючей) ");
			ТекстВложенногоЗапроса = мТекстЗапросаБезУсловий;
			Если ЗначениеЗаполнено(ПервыеNКаждойТаблицы) Тогда
				ТекстВложенногоЗапроса = ирОбщий.СтрЗаменитьЛкс(ТекстВложенногоЗапроса, "ПЕРВЫЕ " + XMLСтрока(ПервыеNКаждойТаблицы) + " ", "");
			КонецЕсли; 
			//ТекстГДЕ = "";
			//Если Найти(мТекстЗапросаБезУсловий, "}") = 0 Тогда
				ТекстГДЕ = "ГДЕ (" + КолонкиКлюча + ") В (ВЫБРАТЬ " + КолонкиКлюча + " ИЗ " + ИмяВременнойТаблицы + ")";
			//КонецЕсли; 
			
			//Здесь читаем все доступные поля, а нужны не все. Доделать
			ТекстЗапроса = "
			|Выбрать " + КолонкиКлюча + "
			|	ПОМЕСТИТЬ " + ИмяВременнойТаблицы + " ИЗ &ТаблицаКлючей КАК ТаблицаКлючей;
			|ВЫБРАТЬ " + КолонкиДляОбновления + " ИЗ (" + ТекстВложенногоЗапроса + ") КАК Т 
			|" + ТекстГДЕ;
			Запрос.Текст = ТекстЗапроса;
			ЗаменитьОбращенияКОтключеннымПолямВЗапросе(Запрос);
			Запрос.Параметры.Вставить("ТаблицаКлючей", ТаблицаКлючей);
			ирОбщий.СостояниеЛкс("Обновляем строки для обработки");
			ТаблицаРезультата = Запрос.Выполнить().Выгрузить(); // Иногда выполняется очень долго
			ирОбщий.СостояниеЛкс();
			Если ТаблицаРезультата.Количество() < ТаблицаКлючей.Количество() Тогда
				ТекстСообщения = "По некоторым ключам строки в таблице БД не были найдены.";
				ирОбщий.СообщитьЛкс(ТекстСообщения);
			КонецЕсли; 
			Для Каждого СтрокаРезультата Из ТаблицаРезультата Цикл
				ЗаполнитьЗначенияСвойств(СтруктураКлюча, СтрокаРезультата);
				СтрокаТаблицы = СтрокиДляОбработки.НайтиСтроки(СтруктураКлюча)[0];
				ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтрокаРезультата); 
				СтрокаТаблицы[мИмяКолонкиОтсутствияСтрокиВБД] = Ложь;
			КонецЦикла;
		КонецЕсли; 
	//КонецЕсли; 
	
КонецПроцедуры

Процедура КПСтрокиДляОбработкиПеречитатьДанные(Кнопка)
	
	ОбновитьКоллекциюРезультата(Ложь);
	
КонецПроцедуры

Процедура КПСтрокиДляОбработкиЗагрузитьПолностью(Кнопка)
	
	СохранитьСтарыеКолонкиТабличногоПоляРезультата();
	//ирОбщий.ЗагрузитьВыборкуВТабличноеПолеПолностьюЛкс(ЭтаФорма, мВыборкаРезультата, ЭлементыФормы.КПСтрокиДляОбработки,, СсылкаНаБуфернуюТаблицу);
	//СтрокиДляОбработки.ЗаполнитьЗначения(Истина, мИмяКолонкиПометки);
	ЭтотОбъект.ДинамическаяВыборка = Ложь;
	ЗагрузитьОтобранныеСтроки(Ложь);
	НастроитьСлужебныеКолонкиТабличногоПоляВыборки(); // Антибаг платформы. Нужно чтобы флажок у колонки Пометка начал снова отображаться
	ДинамическаяВыборкаПриИзменении();
	
КонецПроцедуры

Процедура ДинамическаяВыборкаПриИзменении(Элемент = Неопределено)
	
	//ЭлементыФормы.РежимОбходаДанных1.Доступность = Не ДинамическаяВыборка;
	//ЭлементыФормы.РежимОбходаДанных2.Доступность = Не ДинамическаяВыборка;
	//Если ДинамическаяВыборка Тогда
	//	ЭтотОбъект.РежимОбходаДанных = "Строки";
	//КонецЕсли;
	ОбновитьРазмерДинамическойТаблицы();
	
КонецПроцедуры

Процедура ПанельПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ЭлементыФормы.Панель.Страницы[ТекущаяСтраница] = ЭлементыФормы.Панель.Страницы.СтрокиДляОбработки Тогда
		Если Не мВопросНаОбновлениеСтрокДляОбработкиЗадавался Тогда
			ОбновитьКоллекциюРезультата(Истина);
		КонецЕсли; 
	КонецЕсли; 
	ДинамическаяВыборкаПриИзменении();
	
КонецПроцедуры

Процедура МноготабличнаяВыборкаПриИзменении(Элемент)

	Если Истина
		И МноготабличнаяВыборка 
		И ТипЗнч(ОбластьПоиска) <> Тип("СписокЗначений")
	Тогда
		лОбластьПоиска = Новый СписокЗначений;
		Если ЗначениеЗаполнено(ОбластьПоиска) Тогда
			лОбластьПоиска.Добавить(ОбластьПоиска);
		КонецЕсли; 
	ИначеЕсли Истина
		И Не МноготабличнаяВыборка 
		И ТипЗнч(ОбластьПоиска) = Тип("СписокЗначений")
	Тогда
		Если ОбластьПоиска.Количество() > 0 Тогда
			лОбластьПоиска = ОбластьПоиска[0].Значение;
		Иначе
			лОбластьПоиска = "";
		КонецЕсли; 
	КонецЕсли; 
	УстановитьОбластьПоиска(лОбластьПоиска);
	
КонецПроцедуры

Процедура КоманднаяПанельКомпоновкиИсполняемаяКомпоновка(Кнопка)
	
	НастройкаКомпоновки = ПолучитьИсполняемуюКомпоновку();
	Если НастройкаКомпоновки = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	ирОбщий.ОтладитьЛкс(мСхемаКомпоновки, , НастройкаКомпоновки);
	
КонецПроцедуры

Процедура СтрокаПоискаНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	ирОбщий.ПолеВводаСИсториейВыбора_НачалоВыбораИзСпискаЛкс(Элемент, ЭтаФорма);

КонецПроцедуры

Процедура СтрокаПоискаПриИзменении(Элемент)
	
	Если Не МноготабличнаяВыборка Тогда
		ирОбщий.ПолеВводаСИсториейВыбора_ПриИзмененииЛкс(Элемент, ЭтаФорма);
	КонецЕсли; 

КонецПроцедуры

Процедура АвтозаполнениеПорядкаПриИзменении(Элемент = Неопределено)
	
	Если Элемент = Неопределено Тогда
		Элемент = ЭлементыФормы.АвтозаполнениеПорядка;
	КонецЕсли;
	ЭлементыФормы.КомпоновщикПорядок.Доступность = Не АвтозаполнениеПорядка;
	
КонецПроцедуры

Процедура СтруктураКоманднойПанелиНажатие(Кнопка)
	
	ирОбщий.ОткрытьСтруктуруКоманднойПанелиЛкс(ЭтаФорма, Кнопка);
	
КонецПроцедуры

Процедура КПСтрокиДляОбработкиЗаполнитьЗапросом(Кнопка)

	Запрос = ПолучитьЗапросВыборки();
	Если Запрос = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	СтрокаИменКолонокКлюча = "";
	Если МноготабличнаяВыборка Тогда
		СтрокаИменКолонокКлюча = мИмяКолонкиПолногоИмениТаблицы;
	КонецЕсли; 
	Для Каждого ЭлементКлюча Из мСтруктураКлюча Цикл
		Если СтрокаИменКолонокКлюча <> "" Тогда
			СтрокаИменКолонокКлюча = СтрокаИменКолонокКлюча + ",";
		КонецЕсли; 
		СтрокаИменКолонокКлюча = СтрокаИменКолонокКлюча + ЭлементКлюча.Ключ;
	КонецЦикла;
	КонсольЗапросов = ирОбщий.ПолучитьОбъектПоПолномуИмениМетаданныхЛкс("Обработка.ирКонсольЗапросов");
	#Если Сервер И Не Сервер Тогда
		КонсольЗапросов = Обработки.ирКонсольЗапросов.Создать();
	#КонецЕсли
	РезультатЗапроса = КонсольЗапросов.ОткрытьДляЗаполненияКоллекции(СтрокиДляОбработки.СкопироватьКолонки(СтрокаИменКолонокКлюча), Запрос, , "Строки для обработки");
	Если РезультатЗапроса = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	//	Ответ = Вопрос("Очистить таблицу найденных объектов перед загрузкой результата запроса?", РежимДиалогаВопрос.ОКОтмена);
	//	Если Ответ = КодВозвратаДиалога.ОК Тогда
			СтрокиДляОбработки.Очистить();
	//	КонецЕсли;
	//КонецЕсли;
	РезультатЗапроса.Свернуть(СтрокаИменКолонокКлюча);
	ирОбщий.ЗагрузитьВТаблицуЗначенийЛкс(РезультатЗапроса, СтрокиДляОбработки, Новый Структура(мИмяКолонкиПометки, Истина));
	СтрокиДляОбработки.ЗаполнитьЗначения("?", мИмяКолонкиОтсутствияСтрокиВБД);
	
КонецПроцедуры

Процедура КПСтрокиДляОбработкиОчистить(Кнопка)
	
	СтрокиДляОбработки.Очистить();
	мВыборкаРезультата = Неопределено;
	ЭтотОбъект.ДинамическаяВыборка = Ложь;
	ДинамическаяВыборкаПриИзменении();
	
КонецПроцедуры

Процедура УзелОтбораОбъектовПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(УзелОтбораОбъектов) Тогда
		ЭтотОбъект.ИспользоватьОтборПоУзлу = Истина;
	КонецЕсли; 
	ирОбщий.ПолеВводаСИсториейВыбора_ПриИзмененииЛкс(Элемент, ЭтаФорма);

КонецПроцедуры

Процедура УзелОтбораОбъектовНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	ирОбщий.ПолеВводаСИсториейВыбора_НачалоВыбораИзСпискаЛкс(Элемент, ЭтаФорма);
	
КонецПроцедуры

Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник) Экспорт
	
	ирОбщий.ФормаОбработкаОповещенияЛкс(ЭтаФорма, ИмяСобытия, Параметр, Источник); 

КонецПроцедуры

Процедура _ЗагрузитьНастройкиИзСтруктуры(СтруктураНастроек)
	
	ЭтотОбъект.МноготабличнаяВыборка = СтруктураНастроек.МноготабличнаяВыборка;
	УстановитьОбластьПоиска(СтруктураНастроек.ОбластьПоиска);
	Если СтруктураНастроек.Свойство("ДинамическаяВыборка") Тогда
		ЭтотОбъект.ДинамическаяВыборка = СтруктураНастроек.ДинамическаяВыборка;
	КонецЕсли; 
	Если СтруктураНастроек.Свойство("БезАвтоупорядочивания") Тогда
		ЭтотОбъект.БезАвтоупорядочивания = СтруктураНастроек.БезАвтоупорядочивания;
	КонецЕсли; 
	Если СтруктураНастроек.Свойство("ИмяСиноним") Тогда
		ЭтаФорма.ИмяСиноним = СтруктураНастроек.ИмяСиноним;
	КонецЕсли; 
	ЗагрузитьСтруктуруНастроекТекущейТаблицы(СтруктураНастроек.НастройкиТекущейТаблицы);
	ирОбщий.ЗагрузитьВТаблицуЗначенийЛкс(СтруктураНастроек.СтрокиДляОбработки, СтрокиДляОбработки);
	
КонецПроцедуры

Процедура КомпоновщикОтборПравоеЗначениеДляПодробногоОтображенияЭлементаОкончаниеВводаТекста(Элемент, Текст, Значение, СтандартнаяОбработка)
	
	ирОбщий.ПолеВвода_ОкончаниеВводаТекстаЛкс(Элемент, Текст, Значение, СтандартнаяОбработка, , Истина);
	
КонецПроцедуры

Процедура КомпоновщикОтборПравоеЗначениеДляКраткогоОтображенияЭлементаОкончаниеВводаТекста(Элемент, Текст, Значение, СтандартнаяОбработка)
	
	ирОбщий.ПолеВвода_ОкончаниеВводаТекстаЛкс(Элемент, Текст, Значение, СтандартнаяОбработка, , Истина);

КонецПроцедуры

Процедура КоманднаяПанельКомпоновкиИсполняемыйЗапрос(Кнопка)
	
	Запрос = ПолучитьЗапросВыборки();
	Если Запрос = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	ирОбщий.ОтладитьЛкс(Запрос);
	
КонецПроцедуры

Процедура КоманднаяПанельПоляБитыхСсылокУстановитьФлажки(Кнопка)
	
	ПоляБитыхСсылок.ЗаполнитьЗначения(Истина, "Пометка");
	
КонецПроцедуры

Процедура КоманднаяПанельПоляБитыхСсылокСнятьФлажки(Кнопка = Неопределено)
	
	ПоляБитыхСсылок.ЗаполнитьЗначения(Ложь, "Пометка");
	
КонецПроцедуры

Процедура КоманднаяПанельПоляБитыхСсылокПеренестиВОтборКомпоновки(Кнопка)
	
	СкопироватьПоляБитыхСсылокВОтборКомпоновки();
	ПоляБитыхСсылок.ЗаполнитьЗначения(Ложь, "Пометка");
	
КонецПроцедуры

Процедура КПСтрокиДляОбработкиПометитьНужноеКоличество(Кнопка)
	
	Количество = 10;
	Если Не ВвестиЧисло(Количество, "Введите количество", 6, 0) Тогда
		Возврат;
	КонецЕсли; 
	ИндексНачальнойСтроки = 0;
	ТекущаяСтрока = ЭлементыФормы.СтрокиДляОбработки.ТекущаяСтрока;
	Если ТекущаяСтрока <> Неопределено Тогда
		ИндексНачальнойСтроки = ЭлементыФормы.СтрокиДляОбработки.Значение.Индекс(ТекущаяСтрока);
	КонецЕсли; 
	Для Счетчик = 0 По Количество - 1 Цикл
		ИндексТекущейСтроки = ИндексНачальнойСтроки + Счетчик;
		Если ИндексТекущейСтроки >= СтрокиДляОбработки.Количество() Тогда
			Прервать;
		КонецЕсли; 
		СтрокиДляОбработки[ИндексТекущейСтроки][мИмяКолонкиПометки] = Истина;
	КонецЦикла;
	
КонецПроцедуры

Процедура КлсКомандаНажатие(Кнопка) Экспорт 
	
	ирОбщий.УниверсальнаяКомандаФормыЛкс(ЭтаФорма, Кнопка);
	
КонецПроцедуры

Процедура ОбработчикОжиданияСПараметрамиЛкс() Экспорт 
	
	ирОбщий.ОбработчикОжиданияСПараметрамиЛкс();

КонецПроцедуры

Процедура ПодключатьПоляКоличестваДвиженийПриИзменении(Элемент)
	
	НастроитьКомпоновщик();
	
КонецПроцедуры

Процедура КПСтрокиДляОбработкиВСписок(Кнопка)
	
	Если Не ирОбщий.ЛиКорневойТипСсылочногоОбъектаБДЛкс(ОбластьПоиска) Тогда
		Возврат;
	КонецЕсли; 
	Список = Новый СписокЗначений;
	Список.ТипЗначения = ПолучитьОписаниеТиповКлючейРезультатов();
	ВыделенныеСтроки = ирОбщий.ВыделенныеИлиВсеСтрокиТабличногоПоляЛкс(ЭлементыФормы.СтрокиДляОбработки);
	ИмяПоляСсылка = ирОбщий.ПеревестиСтроку("Ссылка");
	Для Каждого ВыделеннаяСтрока Из ВыделенныеСтроки Цикл
		Список.Добавить(ВыделеннаяСтрока[ИмяПоляСсылка]);
	КонецЦикла;
	ирОбщий.ОткрытьЗначениеЛкс(Список,,,, Ложь);
	
КонецПроцедуры

Процедура ОтборКомпоновкиЗначениеНачалоВыбора(Элемент, СтандартнаяОбработка)
	
	ирОбщий.ПолеВводаКолонкиРасширенногоЗначения_НачалоВыбораЛкс(ЭтаФорма, ЭлементыФормы.КомпоновщикОтбор, СтандартнаяОбработка,, Истина,, "ПравоеЗначение");
	
КонецПроцедуры

Процедура НадписьОбщиеПараметрыЗаписиНажатие(Элемент)
	
	ирОбщий.ОткрытьОбщиеПараметрыЗаписиЛкс();
	
КонецПроцедуры

Процедура ОбластьПоискаОкончаниеВводаТекста(Элемент, Текст, Значение, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Текст) Тогда
		Значение = Новый СписокЗначений;
		СтандартнаяОбработка = Ложь;
		РезультатВыбора = ВыбратьОбъектМетаданных(Текст);
		Если РезультатВыбора <> Неопределено Тогда 
			Значение.Добавить(ирОбщий.ДанныеЭлементаФормыЛкс(Элемент));
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

Процедура ИмяСинонимПриИзменении(Элемент)
	
	НастроитьКомпоновщик();

КонецПроцедуры

Процедура КомпоновщикОтборПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Колонка)
	
	ирОбщий.ТабличноеПолеОтбораКомпоновкиПеретаскиваниеЛкс(ЭтаФорма, Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Колонка);

КонецПроцедуры

Процедура КПОтборУстановитьПолеВПравомЗначении(Кнопка)
	
	ирОбщий.УстановитьПолеВПравомЗначенииЭлементаОтбораЛкс(ЭлементыФормы.КомпоновщикОтбор, ЭлементыФормы.КомпоновщикДоступныеПоляОтбора);
	
КонецПроцедуры

Процедура СтрокиДляОбработкиПриИзмененииФлажка(Элемент, Колонка)
	
	ирОбщий.ТабличноеПолеПриИзмененииФлажкаЛкс(Элемент, Колонка);
	
КонецПроцедуры

Процедура СтрокиДляОбработкиПриАктивизацииСтроки(Элемент)
	
	ирОбщий.ТабличноеПолеПриАктивизацииСтрокиЛкс(ЭтаФорма, Элемент);

КонецПроцедуры

Процедура ДоступныеОбработкиПриАктивизацииСтроки(Элемент)
	
	ирОбщий.ТабличноеПолеПриАктивизацииСтрокиЛкс(ЭтаФорма, Элемент);

КонецПроцедуры

Процедура ПоляБитыхСсылокПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки) Экспорт
	
	ирОбщий.ТабличноеПолеПриВыводеСтрокиЛкс(ЭтаФорма, Элемент, ОформлениеСтроки, ДанныеСтроки);

КонецПроцедуры

Процедура ПоляБитыхСсылокВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	
	Если Колонка = ЭлементыФормы.ПоляБитыхСсылок.Колонки.ОписаниеТипов Тогда
		ирОбщий.ЯчейкаТабличногоПоляРасширенногоЗначения_ВыборЛкс(ЭтаФорма, Элемент, СтандартнаяОбработка,, Ложь);
	КонецЕсли; 
	
КонецПроцедуры

Процедура КПОтборНайтиВСписке(Кнопка)
	
	ирОбщий.ПоказатьДоступноеПолеЭлементаНастроекКомпоновкиЛкс(ЭтаФорма, ЭлементыФормы.КомпоновщикДоступныеПоляОтбора, ЭлементыФормы.КомпоновщикОтбор);
	
КонецПроцедуры

Процедура КПВыборНайтиВСписке(Кнопка)
	
	ирОбщий.ПоказатьДоступноеПолеЭлементаНастроекКомпоновкиЛкс(ЭтаФорма, ЭлементыФормы.КомпоновщикДоступныеПоляОтбора, ЭлементыФормы.КомпоновщикВыбор);
	
КонецПроцедуры

Процедура КП_ДоступныеПоляПерейтиКОпределению(Кнопка)
	
	Если ЭлементыФормы.Панель.ТекущаяСтраница <> ЭлементыФормы.Панель.Страницы.НастройкаВыборки  Тогда
		Возврат;
	КонецЕсли; 
	ДоступноеПоле = ЭлементыФормы.КомпоновщикДоступныеПоляОтбора.ТекущаяСтрока;
	Если ДоступноеПоле = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	ирОбщий.ОткрытьРедакторОбъектаБДЛкс(ПолноеИмяПервойТаблицыБД(), "" + ДоступноеПоле.Поле);
	
КонецПроцедуры

Процедура КПСтрокиДляОбработкиСортироватьПоВозрастанию(Кнопка)
	
	ирОбщий.ТабличноеПолеСортироватьЛкс(ЭтаФорма, ЭлементыФормы.СтрокиДляОбработки, Истина);

КонецПроцедуры

Процедура КПСтрокиДляОбработкиСортироватьПоУбыванию(Кнопка)
	
	ирОбщий.ТабличноеПолеСортироватьЛкс(ЭтаФорма, ЭлементыФормы.СтрокиДляОбработки, Ложь);
	
КонецПроцедуры

Процедура КомпоновщикПорядокВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	
	ирОбщий.ТабличноеПолеПорядкаКомпоновкиВыборЛкс(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка);

КонецПроцедуры

Процедура КомпоновщикВыборПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Колонка)
	ирОбщий.ТабличноеПолеЭлементовКомпоновкиПеретаскиваниеЛкс(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Колонка);
КонецПроцедуры

Процедура КомпоновщикПорядокПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Колонка)
	ирОбщий.ТабличноеПолеЭлементовКомпоновкиПеретаскиваниеЛкс(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Колонка);
КонецПроцедуры

Процедура КоличествоПотоковОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Элемент.Значение = 1;
	
КонецПроцедуры

Процедура КоличествоОбъектовНаПотокОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Элемент.Значение = 1;
	
КонецПроцедуры

Процедура ВыполнятьНаСервереПриИзменении(Элемент)
	
	НастроитьЭлементыФормы();
	
КонецПроцедуры

Процедура ВнешнееСобытие(Источник, Событие, Данные) Экспорт
	
	ирОбщий.Форма_ВнешнееСобытиеЛкс(ЭтаФорма, Источник, Событие, Данные);

КонецПроцедуры

Процедура ДоступныеОбработкиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ирОбщий.СохранитьНастройкуФормыЛкс(ЭтаФорма);
	
КонецПроцедуры

Процедура КПСтрокиДляОбработкиОбработкаСвязанногоРегистра(Кнопка)
	
	НовоеПолноеИмяМД = ОбластьПоиска;
	СписокВыбораМД = Новый СписокЗначений;
	ТипСсылки = Тип(ирОбщий.ИмяТипаИзПолногоИмениМДЛкс(НовоеПолноеИмяМД));
	Для Каждого МетаРегистр Из Метаданные.РегистрыСведений Цикл
		#Если Сервер И Не Сервер Тогда
			МетаРегистр = Метаданные.РегистрыСведений.АвансыРаботникам;
		#КонецЕсли
		Если Истина
			И МетаРегистр.ПериодичностьРегистраСведений = Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический
			И МетаРегистр.Измерения.Количество() = 1
			И МетаРегистр.Измерения[0].Тип.СодержитТип(ТипСсылки)
		Тогда
			СтрокаРегистра = СписокВыбораМД.Добавить();
			СтрокаРегистра.Значение = МетаРегистр.ПолноеИмя();
			СтрокаРегистра.Представление = МетаРегистр.Представление() + " (" + XMLСтрока(МетаРегистр.Измерения[0].Тип.Типы().Количество()) + " типов)";
		КонецЕсли; 
	КонецЦикла;
	Если СписокВыбораМД.Количество() > 0 Тогда
		СписокВыбораМД.СортироватьПоПредставлению();
		НовыйОбъектМД = ирКэш.ОбъектМДПоПолномуИмениЛкс(НовоеПолноеИмяМД);
		Если НовыйОбъектМД <> Неопределено Тогда
			ПредставлениеМД = НовыйОбъектМД.Представление();
		Иначе
			ПредставлениеМД = НовоеПолноеИмяМД;
		КонецЕсли; 
		КлючиСтрок = СтрокиДляОбработки.ВыгрузитьКолонку("Ссылка");
		РезультатВыбора = СписокВыбораМД.ВыбратьЭлемент("Выберите связанный регистр для обработки");
		Если РезультатВыбора <> Неопределено И НовоеПолноеИмяМД <> РезультатВыбора.Значение Тогда
			ЭтоРегистроваяВыборка = Истина;
			НовоеПолноеИмяМД = РезультатВыбора.Значение;
			НовыйОбъектМД = ирКэш.ОбъектМДПоПолномуИмениЛкс(НовоеПолноеИмяМД);
			#Если Сервер И Не Сервер Тогда
				НовыйОбъектМД = Метаданные.РегистрыСведений.КурсыВалют;
			#КонецЕсли
			МассивКлючей = Новый Массив;
			ИмяКлюча = НовыйОбъектМД.Измерения[0].Имя;
			Для Каждого Ссылка Из КлючиСтрок Цикл
				СтруктураКлюча = Новый Структура(ИмяКлюча, Ссылка);
				МассивКлючей.Добавить(РегистрыСведений[НовыйОбъектМД.Имя].СоздатьКлючЗаписи(СтруктураКлюча));
			КонецЦикла;
			УстановитьОбластьПоиска(НовоеПолноеИмяМД);
			ЗагрузитьСтрокиДляОбработки(МассивКлючей);
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

Процедура ВыбранныеОбработкиПриИзмененииФлажка(Элемент, Колонка)
	
	ирОбщий.ТабличноеПолеПриИзмененииФлажкаЛкс(Элемент, Колонка);
	
КонецПроцедуры

Процедура ВыбранныеОбработкиПриАктивизацииСтроки(Элемент)
	
	ирОбщий.ТабличноеПолеПриАктивизацииСтрокиЛкс(ЭтаФорма, Элемент);
	
КонецПроцедуры

Процедура ТабличноеПолеПриПолученииДанных(Элемент, ОформленияСтрок) Экспорт 
	
	ирОбщий.ТабличноеПолеПриПолученииДанныхЛкс(ЭтаФорма, Элемент, ОформленияСтрок);

КонецПроцедуры

Процедура СохранитьСтарыеКолонкиТабличногоПоляРезультата()
	
	Для Каждого СтараяКолонкаТП Из ЭлементыФормы.СтрокиДляОбработки.Колонки Цикл
		Если СтараяКолонкаТП.Ширина > мШиринаПустойКолонки И ЗначениеЗаполнено(СтараяКолонкаТП.Данные) Тогда
			мСтарыеКолонкиТабличногоПоляРезультата.Вставить(ирОбщий.КлючХраненияНастроекКолонкиРезультатаЗапросаЛкс(ЭлементыФормы.СтрокиДляОбработки, СтараяКолонкаТП), СтараяКолонкаТП);
		КонецЕсли; 
	КонецЦикла;

КонецПроцедуры

ирОбщий.ИнициализироватьФормуЛкс(ЭтаФорма, "Обработка.ирПодборИОбработкаОбъектов.Форма.ПодборИОбработка");

#Если Сервер И Не Сервер Тогда
	ПриПолученииДанныхДоступныхПолей();
#КонецЕсли
мПлатформа = ирКэш.Получить();
ирОбщий.ПодключитьОбработчикиСобытийДоступныхПолейКомпоновкиЛкс(ЭлементыФормы.КомпоновщикДоступныеПоляОтбора);
ЭлементыФормы.КомпоновщикОтбор.Колонки.ПравоеЗначениеДляКраткогоОтображенияЭлемента.ЭлементУправления.УстановитьДействие("НачалоВыбора", Новый Действие("ОтборКомпоновкиЗначениеНачалоВыбора"));
мИмяСлужебногоПоля = "СлужебноеПоле8195";
ДоступныеОбработки.Колонки.Добавить("Картинка");
КоллекцияОтключенныхПолей = Новый Массив;
мИменаКоличестваПодчиненных = Новый Структура;
ЭлементыФормы.ПервыеNКаждойТаблицы.СписокВыбора.Добавить(1);
ЭлементыФормы.ПервыеNКаждойТаблицы.СписокВыбора.Добавить(10);
ЭлементыФормы.ПервыеNКаждойТаблицы.СписокВыбора.Добавить(100);
ЭлементыФормы.ПервыеNКаждойТаблицы.СписокВыбора.Добавить(1000);
ЭлементыФормы.ПервыеNКаждойТаблицы.СписокВыбора.Добавить(10000);
ЭлементыФормы.ПервыеNКаждойТаблицы.СписокВыбора.Добавить(100000);
ЭлементыФормы.ПервыеNКаждойТаблицы.СписокВыбора.Добавить(500000);
ЭлементыФормы.ПервыеNКаждойТаблицы.СписокВыбора.Добавить(1000000);
мСтарыеКолонкиТабличногоПоляРезультата = Новый Соответствие;
мШиринаПустойКолонки = 5;

