
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Процедура УстановитьСнятьПометка(Признак)
	
	Для каждого СтрокаСписка Из СписокИнтерфейсов Цикл
		
		ИмяИнтерфейса = СтрокаСписка.Значение;
		
		Если НЕ ГлавныйИнтерфейс[ИмяИнтерфейса].Переключаемый Тогда
			СтрокаСписка.Пометка = ГлавныйИнтерфейс[ИмяИнтерфейса].Видимость;
		Иначе
			//Модифицированность = Истина;
			СтрокаСписка.Пометка = Признак;
		КонецЕсли;
		
	КонецЦикла;
	ВыполнитьПереключениеИнтерфейсов();
	
КонецПроцедуры

Процедура ИзменитьФлажок(Элемент)
	
	ИмяИнтерфейса = Элемент.Значение;
	Если НЕ ГлавныйИнтерфейс[ИмяИнтерфейса].Переключаемый Тогда
		Элемент.Пометка = ГлавныйИнтерфейс[ИмяИнтерфейса].Видимость;
	Иначе
		//Модифицированность = Истина;
	КонецЕсли;
	
	ВыполнитьПереключениеИнтерфейсов();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ

Процедура ОсновныеДействияФормыПрименить(Кнопка)
	
	ВыполнитьПереключениеИнтерфейсов();
	//Модифицированность = Ложь;
	
КонецПроцедуры

Процедура СписокИнтерфейсовПриИзмененииФлажка(Элемент)
	
	ИзменитьФлажок(Элемент.ТекущаяСтрока);
	
КонецПроцедуры

Процедура КоманднаяПанельФормаУстановитьФлажки(Кнопка)
	
	УстановитьСнятьПометка(Истина);

КонецПроцедуры

Процедура КоманднаяПанельФормаСнятьФлажки(Кнопка)
	
	УстановитьСнятьПометка(Ложь);
	
КонецПроцедуры

Процедура СписокИнтерфейсовВыбор(Элемент, ЭлементСписка)
	
	Пометка = ЭлементСписка.Пометка;
	ЭлементСписка.Пометка = НЕ ЭлементСписка.Пометка;
	ИзменитьФлажок(ЭлементСписка);
	Если Пометка <> ЭлементСписка.Пометка Тогда
		//Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура КоманднаяПанельФормаОбновить(Кнопка)
	
	ОбновитьСписокИнтерфейсов();
	
КонецПроцедуры

Процедура ОсновныеДействияФормыОК(Кнопка)
	
	ВыполнитьПереключениеИнтерфейсов();
	СохранитьСписокИнтерфейсов();
	//Модифицированность = Ложь;
	Закрыть();
	
КонецПроцедуры

Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	// Вставить содержимое обработчика.
	//Если Модифицированность Тогда
	//	КодВозврата = Вопрос("Сохранить список интерфейсов для восстановления при старте программы?", РежимДиалогаВопрос.ДаНетОтмена);
	//	Если КодВозврата = КодВозвратаДиалога.Да Тогда
	//		СохранитьСписокИнтерфейсов();
	//	ИначеЕсли КодВозврата = КодВозвратаДиалога.Отмена Тогда
	//		Отказ = Истина;
	//	КонецЕсли;
	//КонецЕсли;
	
КонецПроцедуры

Процедура КоманднаяПанельФормаОПодсистеме(Кнопка)
	ирОбщий.ОткрытьСправкуПоПодсистемеЛкс(ЭтотОбъект);
КонецПроцедуры

ирОбщий.ИнициализироватьФормуЛкс(ЭтаФорма, "Обработка.ирМенеджерИнтерфейсов.Форма.Форма");
