
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ИзменитьВариантМасштабаИнтерфейса(Ложь);
	ПредложитьПерезапускСеанса();
КонецПроцедуры 

Процедура ИзменитьВариантМасштабаИнтерфейса(Знач Включить = Истина) Экспорт
	ИмяПользователя = ИмяПользователя();
	НастройкиКлиентскогоПриложения = ХранилищеСистемныхНастроек.Загрузить("Общее/НастройкиКлиентскогоПриложения",,, ИмяПользователя);
	Если НастройкиКлиентскогоПриложения = Неопределено Тогда
		НастройкиКлиентскогоПриложения = Новый НастройкиКлиентскогоПриложения;
	КонецЕсли;
	Если Включить Тогда
		НастройкиКлиентскогоПриложения.ВариантМасштабаФормКлиентскогоПриложения = ВариантМасштабаФормКлиентскогоПриложения.Компактный;
	Иначе
		НастройкиКлиентскогоПриложения.ВариантМасштабаФормКлиентскогоПриложения = ВариантМасштабаФормКлиентскогоПриложения.Авто;
	КонецЕсли;
	ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиКлиентскогоПриложения", "", НастройкиКлиентскогоПриложения, , ИмяПользователя);
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПредложитьПерезапускСеанса() Экспорт
	Ответ = Ждать ВопросАсинх("Для вступления изменений в силу нужно перезапустить сеанс. Продолжить?", РежимДиалогаВопрос.ОКОтмена);
	Если Ответ = КодВозвратаДиалога.ОК Тогда
		ЗавершитьРаботуСистемы(, Истина);
	КонецЕсли;
КонецПроцедуры
