// https://github.com/alexkmbk/RegEx1CAddin
Перем ВызыватьИсключения Экспорт; // Булево - Если установлена в Истина, то при возникновении ошибки, будет вызываться исключение, при обработке исключения, текст ошибки можно получить из свойства ErrorDescription\ОписаниеОшибки.
Перем ОписаниеОшибки Экспорт; // Строка - статус последней операции, при отсутствии ошибок - пустое    
Перем Pattern Экспорт; // Строка - шаблон по умолчанию, рекомендуется по возможности использовать его, т.к. он оптимизирует многократное использование   
Перем Global Экспорт; // Булево
Перем IgnoreCase Экспорт; // Булево    
Перем Multiline Экспорт; // Булево    

// Результатом выполнения метода будет массив результатов поиска. 
// Для того, чтобы получить результаты выполнения метода (массив результатов), необходимо выполнить метод Следующий/Next(), и после этого, в свойстве ТекущееЗначение/CurrentValue будет доступно значение 
// текущей подгруппы результата выполнения (текущий элемент массива результатов). Идея похожа на обход результата запроса.
// Параметры:
//  ТекстГдеИскать	 - Строка - 
//  ИскомыйШаблон	 - Строка	 - если не указан, то берется из свойства Pattern
//  ИерархическийОбходРезультатов	 - Булево - Здесь, ИерархическийОбходРезультатов> - определяет то, как будет осуществлен обход результатов. По умолчанию = Ложь.
//            Если ИерархическийОбходРезультатов=Ложь, тогда каждый элемент массива результатов поиска - найденная подгруппа поиска. Если подгрупп нет, то массив будет содержать один элемент - найденную строку. 
//            Если ИерархическийОбходРезультатов=Истина, тогда, каждый элемент массива результатов поиска будет содержать только найденную строку, а значение подгруппы при их наличии, можно будет получить методом ПолучитьПодгруппу.
Процедура НайтиСовпадения(ТекстГдеИскать, ИскомыйШаблон = "", ИерархическийОбходРезультатов = Ложь) Экспорт
КонецПроцедуры   

// Результатом выполнения метода будет сериализованный массив результатов поиска.
//
// Параметры:
//  ТекстГдеИскать	 - Строка	 - 
//  ИскомыйШаблон	 - Строка	 - если не указан, то берется из свойства Pattern
// 
// Возвращаемое значение:
//  Строка - :
//   * Значение - Массив из Структура:
//     **FirstIndex - Число
//     **Length - Число
//     **SubMatches - Массив
//     **Value - Строка
//
Функция НайтиСовпаденияJSON(ТекстГдеИскать, ИскомыйШаблон = "") Экспорт
КонецФункции   

// Результатом выполнения метода будет строка с выполненым заменами.
// Параметры:
//  ТекстГдеИскать	 - Строка	 - 
//  ИскомыйШаблон	 - Строка	 - если не указан, то берется из свойства Pattern
//  ШаблонЗамены	 - Строка	 - 
// Возвращаемое значение:
//  Строка 
Функция Заменить(ТекстГдеИскать, ИскомыйШаблон = "", ШаблонЗамены) Экспорт
КонецФункции   

// Проверяет соответствие строки шаблону из свойства Pattern
//
// Параметры:
//  ТекстГдеИскать	 - Строка	 - 
// 
// Возвращаемое значение:
//  Булево - 
//
Функция Test(ТекстГдеИскать) Экспорт
КонецФункции   

