
Процедура ДействияФормыМенеджерТабличногоПоля(Кнопка)
	
	Обработки.ирМенеджерТабличногоПоля.ПолучитьФорму(, ЭтаФорма, ).УстановитьСвязь(ЭтаФорма.ЭлементыФормы.СправочникСписок
	);
	
КонецПроцедуры

Процедура ДействияФормыОПодсистеме(Кнопка)
	ЛксОткрытьСправкуПоПодсистеме(Обработки.ирДинамическийСписок.Создать());
КонецПроцедуры

Процедура СправочникСписокПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущаяСтрока <> Неопределено Тогда
		Текст = Элемент.ТекущаяСтрока.ТекстАлгоритма;
	Иначе
		Текст = "";
	КонецЕсли; 
	ЭлементыФормы.ПолеТекстовогоДокумента.УстановитьТекст(Текст);
	
КонецПроцедуры

Процедура ДействияФормыКонсольКода(Кнопка)
	
	Ссылка = ЭлементыФормы.СправочникСписок.ТекущаяСтрока;
	Если Ссылка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Справочники[Метаданные.НайтиПоТипу(ТипЗнч(ЭлементыФормы.СправочникСписок.Значение)).Имя].ОткрытьКонсольКодаДляАлгоритма(Ссылка);
	
КонецПроцедуры

Порядок.Установить("ДатаИзменения Убыв");