#Если Клиент Тогда

// Открывает объект в исследователе объектов.
//
// Параметры:
//  Объект       – Произвольный.
//
// Возвращаемое значение:
//  Не используется.
//
Функция ИсследоватьОбъект(Объект, Модально = Истина) Экспорт 
	
	ФормаИсследователя = ирНеглобальный.ПолучитьФормуЛкс(Метаданные().ПолноеИмя() + ".Форма.ИсследовательОбъектов", , , Объект);
	ФормаИсследователя.УстановитьИсследуемоеЗначение(Объект);
	Если Модально Тогда 
		Результат = ФормаИсследователя.ОткрытьМодально();
	Иначе
		Результат = Неопределено;
		ФормаИсследователя.Открыть();
	КонецЕсли;
	Возврат Результат;

КонецФункции // ИсследоватьОбъект()

// Открывает объект в исследователе объектов.
//
// Параметры:
//  Объект       – Произвольный.
//
// Возвращаемое значение:
//  Не используется.
//
Функция ИсследоватьКоллекцию(Коллекция, Модально = Истина, БезСлужебныхКолонок = Истина) Экспорт 
	
	ФормаИсследователя = ирНеглобальный.ПолучитьФормуЛкс(Метаданные().ПолноеИмя() + ".Форма.ИсследовательКоллекций", , , Коллекция);
	ФормаИсследователя.УстановитьИсследуемоеЗначение(Коллекция, , , БезСлужебныхКолонок);
	Если Модально Тогда 
		Результат = ФормаИсследователя.ОткрытьМодально();
	Иначе
		Результат = Неопределено;
		ФормаИсследователя.Открыть();
	КонецЕсли;
	Возврат Результат;

КонецФункции // ИсследоватьКоллекцию()

ирКэш.Получить().ИнициализацияОписанияМетодовИСвойств();

#КонецЕсли
