//ирМобильный Перем ирМобильный Экспорт;
//ирМобильный Перем ирОбщий Экспорт;
//ирМобильный Перем ирСервер Экспорт;
//ирМобильный Перем ирКэш Экспорт;
//ирМобильный Перем ирПривилегированный Экспорт;

#Если Клиент Тогда

// Открывает объект в исследователе объектов.
//
// Параметры:
//  Объект       – Произвольный.
//
// Возвращаемое значение:
//  Не используется.
//
Функция ИсследоватьОбъект(Объект, Модально = Истина) Экспорт 
	
	ФормаИсследователя = ирОбщий.ПолучитьФормуЛкс(Метаданные().ПолноеИмя() + ".Форма.ИсследовательОбъектов", , , Объект);
	ФормаИсследователя.УстановитьИсследуемоеЗначение(Объект);
	Если Модально Тогда 
		Результат = ФормаИсследователя.ОткрытьМодально();
	Иначе
		Результат = Неопределено;
		ФормаИсследователя.Открыть();
	КонецЕсли;
	Возврат Результат;

КонецФункции // ИсследоватьОбъект()

// Открывает объект в исследователе объектов.
//
// Параметры:
//  Объект       – Произвольный.
//
// Возвращаемое значение:
//  Не используется.
//
Функция ИсследоватьКоллекцию(Коллекция, Модально = Истина, БезСлужебныхКолонок = Истина) Экспорт 
	
	ФормаИсследователя = ирОбщий.ПолучитьФормуЛкс(Метаданные().ПолноеИмя() + ".Форма.ИсследовательКоллекций", , , Коллекция);
	ФормаИсследователя.УстановитьИсследуемоеЗначение(Коллекция, , , БезСлужебныхКолонок);
	Если Модально Тогда 
		Результат = ФормаИсследователя.ОткрытьМодально();
	Иначе
		Результат = Неопределено;
		ФормаИсследователя.Открыть();
	КонецЕсли;
	Возврат Результат;

КонецФункции // ИсследоватьКоллекцию()

//ирМобильный #Если Клиент Тогда
//ирМобильный Контейнер = Новый Структура();
//ирМобильный Оповестить("ирПолучитьБазовуюФорму", Контейнер);
//ирМобильный Если Не Контейнер.Свойство("ирМобильный", ирМобильный) Тогда
//ирМобильный 	ПолноеИмяФайлаБазовогоМодуля = ВосстановитьЗначение("ирПолноеИмяФайлаОсновногоМодуля");
//ирМобильный 	ирМобильный = ВнешниеОбработки.ПолучитьФорму(ПолноеИмяФайлаБазовогоМодуля);
//ирМобильный КонецЕсли; 
//ирМобильный ирОбщий = ирМобильный.ПолучитьОбщийМодульЛкс("ирОбщий");
//ирМобильный ирКэш = ирМобильный.ПолучитьОбщийМодульЛкс("ирКэш");
//ирМобильный ирСервер = ирМобильный.ПолучитьОбщийМодульЛкс("ирСервер");
//ирМобильный ирПривилегированный = ирМобильный.ПолучитьОбщийМодульЛкс("ирПривилегированный");
//ирМобильный #КонецЕсли

ирКэш.Получить().ИнициализацияОписанияМетодовИСвойств();

#КонецЕсли
