
// Обработчик нажатия кнопки ОК
//
Процедура КнопкаОКНажатие(Элемент)

	ЭтотОбъект.ВключатьДеревоЗапросаПриОтладке = фВключатьДеревоЗапросаПриОтладке;
	ЭтотОбъект.МаксСтрокДляСложнойВедомойСтруктуры = фМаксСтрокДляСложнойВедомойСтруктуры;
	ПараметрыОчистки = Новый Структура;
	ПараметрыОчистки.Вставить("Период", ПредлагатьОчиститьМенеджерВременныхТаблицЧерезМинут);
	ПараметрыОчистки.Вставить("ПоУмолчаниюОчищать", ПоУмолчаниюОчищать);
	ирОбщий.СохранитьЗначениеЛкс("ПредлагатьОчиститьМенеджерВременныхТаблицЧерезМинут", ПараметрыОчистки);
	Закрыть(Истина);

КонецПроцедуры

// Обработчик события перед открытием формы
//
Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)

	ЭтаФорма.фВключатьДеревоЗапросаПриОтладке = ЭтотОбъект.ВключатьДеревоЗапросаПриОтладке;
	ЭтаФорма.фМаксСтрокДляСложнойВедомойСтруктуры = ЭтотОбъект.МаксСтрокДляСложнойВедомойСтруктуры;
	ЭтаФорма.ПредлагатьОчиститьМенеджерВременныхТаблицЧерезМинут = ирКлиент.ПериодОчисткиМенеджераВременныхТаблицЛкс(ПоУмолчаниюОчищать);

КонецПроцедуры

Процедура ПриОткрытии()
	ирКлиент.Форма_ПриОткрытииЛкс(ЭтаФорма);
КонецПроцедуры

Процедура ПриЗакрытии()
	ирКлиент.Форма_ПриЗакрытииЛкс(ЭтаФорма);
КонецПроцедуры

Процедура ВнешнееСобытие(Источник, Событие, Данные) Экспорт
	
	ирКлиент.Форма_ВнешнееСобытиеЛкс(ЭтаФорма, Источник, Событие, Данные);

КонецПроцедуры

Процедура ТабличноеПолеПриПолученииДанных(Элемент, ОформленияСтрок) Экспорт 
	
	ирКлиент.ТабличноеПолеПриПолученииДанныхЛкс(ЭтаФорма, Элемент, ОформленияСтрок);

КонецПроцедуры

ирКлиент.ИнициироватьФормуЛкс(ЭтаФорма, "Обработка.ирКонсольЗапросов.Форма.ФормаНастройки");

СписокВыбора = ЭлементыФормы.ПредлагатьОчиститьМенеджерВременныхТаблицЧерезМинут.СписокВыбора;
СписокВыбора.Добавить(30);
СписокВыбора.Добавить(60);
СписокВыбора.Добавить(120);
СписокВыбора.Добавить(240); 

СписокВыбора = ЭлементыФормы.МаксСтрокДляСложнойВедомойСтруктуры.СписокВыбора;
СписокВыбора.Добавить(200);
СписокВыбора.Добавить(500);
СписокВыбора.Добавить(1000);
СписокВыбора.Добавить(2000);
