
Процедура ПриОткрытии()
	
	Если НачальноеЗначениеВыбора <> Неопределено Тогда
		ЭлементыФормы.ТаблицаЖурнала.ТекущаяСтрока = НачальноеЗначениеВыбора;
		Если Истина
			И СтрокаТаблицыЗначений <> Неопределено 
			И СтрокаТаблицыЗначений.Владелец().Колонки.Найти("РазделениеДанныхСеанса") <> Неопределено
		Тогда
			ЭлементыФормы.ПредставлениеРазделенияДанныхСеанса.Значение = ирОбщий.РасширенноеПредставлениеЗначенияЛкс(СтрокаТаблицыЗначений.РазделениеДанныхСеанса);
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

Процедура РасширенноеЗначениеОткрытие(Элемент, СтандартнаяОбработка)
	
	ЗначениеПоля = СтрокаТаблицыЗначений[ирОбщий.ПоследнийФрагментЛкс(Элемент.Данные)];
	Если Метаданные.НайтиПоПолномуИмени(ЗначениеПоля) <> Неопределено Тогда
		СтандартнаяОбработка = Ложь;
		ирОбщий.ОткрытьОбъектМетаданныхЛкс(ЗначениеПоля);
	Иначе
		ирОбщий.ОткрытьЗначениеЛкс(ЗначениеПоля, Ложь, СтандартнаяОбработка);
	КонецЕсли; 

КонецПроцедуры

Процедура ПредставлениеСобытияОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ЭлементыФормы.ТаблицаЖурнала.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	Форма = ирОбщий.ПолучитьФормуЛкс("Обработка.ирНастройкаЖурналаРегистрации.Форма");
	Форма.Открыть();
	лМетаданные = Неопределено;
	Если СтрокаТаблицыЗначений <> Неопределено Тогда
		лМетаданные = СтрокаТаблицыЗначений.Метаданные;
	КонецЕсли; 
	Форма.АктивизироватьСтрокуСобытия(ЭлементыФормы.Событие.Значение, лМетаданные);
	
КонецПроцедуры

Процедура КлсУниверсальнаяКомандаНажатие(Кнопка) Экспорт 
	
	ирОбщий.УниверсальнаяКомандаФормыЛкс(ЭтаФорма, Кнопка);
	
КонецПроцедуры

Процедура ОбработчикОжиданияСПараметрамиЛкс() Экспорт 
	
	ирОбщий.ОбработчикОжиданияСПараметрамиЛкс();

КонецПроцедуры

Процедура ИмяПользователяОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ирОбщий.ОткрытьПользователяИБЛкс(ЭлементыФормы.ТаблицаЖурнала.ТекущиеДанные.ИмяПользователя);
	
КонецПроцедуры

ирОбщий.ИнициализироватьФормуЛкс(ЭтаФорма, "Обработка.ирАнализЖурналаРегистрации.Форма.ФормаСобытия");
