
&НаКлиенте
Процедура ФиксированныеНастройкиОтборВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Элементы.ФиксированныеНастройкиОтборПравоеЗначение Тогда
		ПоказатьЗначение(, КомпоновщикНастроек.ФиксированныеНастройки.Отбор.ПолучитьОбъектПоИдентификатору(ВыбраннаяСтрока).ПравоеЗначение);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиОтборВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Элементы.НастройкиОтборПравоеЗначение Тогда
		ПоказатьЗначение(, КомпоновщикНастроек.Настройки.Отбор.ПолучитьОбъектПоИдентификатору(ВыбраннаяСтрока).ПравоеЗначение);
	КонецЕсли; 

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.ИсполняемыеНастройки <> Неопределено Тогда
		КомпоновщикРезультата.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(Параметры.ИсполняемаяСхема));
		КомпоновщикРезультата.ЗагрузитьНастройки(Параметры.ИсполняемыеНастройки);
		Представление = ПолучитьПредставлениеНастроек(Параметры.ИсполняемыеНастройки);
		Элементы.ИсполняемыеНастройки.Заголовок = Элементы.ИсполняемыеНастройки.Заголовок + Представление;
	КонецЕсли; 
	Представление = ПолучитьПредставлениеНастроек(Параметры.ФиксированныеНастройки);
	Элементы.ФиксированныеНастройки.Заголовок = Элементы.ФиксированныеНастройки.Заголовок + Представление;
	Представление = ПолучитьПредставлениеНастроек(Параметры.Настройки);
	Элементы.ОбычныеНастройки.Заголовок = Элементы.ОбычныеНастройки.Заголовок + Представление;
	Если Параметры.АктивироватьФиксированныйОтбор Тогда
		Элементы.ГруппаПанель.ТекущаяСтраница = Элементы.ГруппаПанель.ПодчиненныеЭлементы.ФиксированныеНастройки;
	КонецЕсли; 
	Элементы.ГруппаПанель.ПодчиненныеЭлементы.ИсполняемыеНастройки.Доступность = Параметры.ИсполняемыеНастройки <> Неопределено;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПредставлениеНастроек(Знач Настройки)
	
	Представление = "";
	Если ЗначениеЗаполнено("" + Настройки.Отбор) Тогда 
		Представление = Представление + ",Отбор";
	КонецЕсли;
	Если ЗначениеЗаполнено("" + Настройки.Порядок) Тогда 
		Представление = Представление + ",Порядок";
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Представление) Тогда
		Представление = ",0";
	КонецЕсли; 
	Представление = "(" + Сред(Представление, 2) + ")";
	Возврат Представление;

КонецФункции

&НаКлиенте
Процедура Применить(Команда = Неопределено)
	
	Если ВладелецФормы <> Неопределено Тогда
		ирОбщий.ДанныеЭлементаФормыЛкс(ВладелецФормы).КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(КомпоновщикНастроек.ПользовательскиеНастройки);
		Если ирКэш.НомерВерсииПлатформыЛкс() >= 803017 Тогда
			ЭтаФорма.НастройкиМодифицированы = Ложь;
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПрименитьИЗакрыть(Команда)
	
	Применить();
	Закрыть(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикРезультатаНастройкиОтборВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Элементы.КомпоновщикРезультатаНастройкиОтборПравоеЗначение Тогда
		ПоказатьЗначение(, КомпоновщикРезультата.Настройки.Отбор.ПолучитьОбъектПоИдентификатору(ВыбраннаяСтрока).ПравоеЗначение);
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ФормаПрименить.Доступность = ВладелецФормы <> Неопределено;
	Элементы.ФормаПрименитьИЗакрыть.Доступность = ВладелецФормы <> Неопределено;
	
КонецПроцедуры

