Процедура ОсновныеДействияФормыОК(Кнопка)
	
	НовоеЗначение = Новый МоментВремени(Дата, Ссылка);
	ирНеглобальный.ПрименитьИзмененияИЗакрытьФормуЛкс(ЭтаФорма, НовоеЗначение);
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	Если ТипЗнч(НачальноеЗначениеВыбора) <> Тип("МоментВремени") Тогда
		НачальноеЗначениеВыбора = Новый МоментВремени(ТекущаяДата());
	КонецЕсли; 
	Дата = НачальноеЗначениеВыбора.Дата;
	Ссылка = НачальноеЗначениеВыбора.Ссылка;

КонецПроцедуры

Процедура ОсновныеДействияФормыИсследовать(Кнопка)
	
	Исследовать(Новый МоментВремени(Дата, Ссылка));
	
КонецПроцедуры
