
Процедура СтруктураКоманднойПанелиНажатие(Кнопка)
	
	ирОбщий.ОткрытьСтруктуруКоманднойПанелиЛкс(ЭтаФорма, Кнопка);
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	ЭтаФорма.ФайлСпискаБаз = ирОбщий.ИмяФайлаСпискаИнфобазПользователяОСЛкс();
	ОбновитьСписок();
	Если НачальноеЗначениеВыбора <> Неопределено Тогда
		СтрокаСписка = ЭлементыФормы.СписокБазПользователя.Значение.Найти(НРег(НачальноеЗначениеВыбора), "КлючСтроки");
		Если СтрокаСписка <> Неопределено Тогда
			ЭлементыФормы.СписокБазПользователя.ТекущаяСтрока = СтрокаСписка;
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

Процедура ОбновитьСписок()
		
	ТаблицаБазКлиента = ирОбщий.ПолучитьСписокИнфобазПользователяОСЛкс(, Истина, Истина);
	#Если Сервер И Не Сервер Тогда
		ТаблицаБазКлиента = Обработки.ирПлатформа.Создать().СписокИнфобазПользователя;
	#КонецЕсли
	Для Каждого СтрокаТаблицы Из ТаблицаБазКлиента Цикл
		СтрокаТЧ = ЭлементыФормы.СписокБазПользователя.Значение.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрокаТаблицы);
	КонецЦикла;
	ЭлементыФормы.СписокБазПользователя.Значение.Сортировать("Connect");

КонецПроцедуры

Процедура СписокБазПользователяПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	
	Если ДанныеСтроки.КлючСтроки = НРег(СтрокаСоединенияИнформационнойБазы()) Тогда
		ОформлениеСтроки.ЦветТекста = ирОбщий.ЦветТекстаТекущегоЭлементаЛкс(); 
	КонецЕсли; 

КонецПроцедуры

Процедура ДействияФормыОбновить(Кнопка)
	
	ОбновитьСписок();
	
КонецПроцедуры

Процедура СписокБазПользователяВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	
	Если РежимВыбора И ЗначениеЗаполнено(ЭлементыФормы.СписокБазПользователя.ТекущаяСтрока.Connect) Тогда
		Закрыть(ЭлементыФормы.СписокБазПользователя.ТекущаяСтрока);
	КонецЕсли; 
	
КонецПроцедуры

Процедура ДействияФормыОтборБезЗначенияВТекущейКолонке(Кнопка)
	
	ирОбщий.ТабличноеПоле_ОтборБезЗначенияВТекущейКолонке_КнопкаЛкс(ЭлементыФормы.СписокБазПользователя);
	
КонецПроцедуры

Процедура ДействияФормыОткрытьМенеджерТабличногоПоля(Кнопка)
	
	ирОбщий.ОткрытьМенеджерТабличногоПоляЛкс(ЭлементыФормы.СписокБазПользователя, ЭтаФорма);
	
КонецПроцедуры

Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	ирОбщий.ФормаОбработкаОповещенияЛкс(ЭтаФорма, ИмяСобытия, Параметр, Источник); 

КонецПроцедуры

Процедура ДействияФормыОткрытьКаталогКэша(Кнопка)
	
	Если ЭлементыФормы.СписокБазПользователя.ТекущаяСтрока <> Неопределено Тогда
		ЗапуститьПриложение(ЭлементыФормы.СписокБазПользователя.ТекущаяСтрока.КаталогКэша);
	КонецЕсли; 
	
КонецПроцедуры

Процедура ДействияФормыСравнить(Кнопка)
	
	ирОбщий.СравнитьСодержимоеЭлементаУправленияЛкс(ЭлементыФормы.СписокБазПользователя);
	
КонецПроцедуры

ирОбщий.ИнициализироватьФормуЛкс(ЭтаФорма, "Обработка.ирПлатформа.Форма.СписокБазПользователяОС");
