
Процедура ОсновныеДействияФормыОК(Кнопка)
	
	НовоеЗначение = Новый Граница(РасширенноеЗначение, РеквизитВидГраницы);
	ирОбщий.ПрименитьИзмененияИЗакрытьФормуЛкс(ЭтаФорма, НовоеЗначение);
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	Если ТипЗнч(НачальноеЗначениеВыбора) <> Тип("Граница") Тогда
		НачальноеЗначениеВыбора = Новый Граница(ТекущаяДата(), ВидГраницы.Исключая);
	КонецЕсли; 
	ЭтаФорма.РеквизитЗначение = НачальноеЗначениеВыбора.Значение;
	ЭтаФорма.РасширенноеЗначение = НачальноеЗначениеВыбора.Значение;
	ЭтаФорма.РеквизитВидГраницы = НачальноеЗначениеВыбора.ВидГраницы;

КонецПроцедуры

Процедура ОсновныеДействияФормыИсследовать(Кнопка)
	
	ирОбщий.ИсследоватьЛкс(Новый Граница(РеквизитЗначение, РеквизитВидГраницы));
	
КонецПроцедуры

Процедура РеквизитЗначениеОкончаниеВводаТекста(Элемент, Текст, Значение, СтандартнаяОбработка)
	
	ирОбщий.ПолеВвода_ОкончаниеВводаТекстаЛкс(Элемент, Текст, Значение, СтандартнаяОбработка);

КонецПроцедуры

Процедура КлсУниверсальнаяКомандаНажатие(Кнопка) Экспорт 
	
	ирОбщий.УниверсальнаяКомандаФормыЛкс(ЭтаФорма, Кнопка);
	
КонецПроцедуры

Процедура ОбработчикОжиданияСПараметрамиЛкс() Экспорт 
	
	ирОбщий.ОбработчикОжиданияСПараметрамиЛкс();

КонецПроцедуры

Процедура РеквизитЗначениеНачалоВыбора(Элемент, СтандартнаяОбработка)
	
	ирОбщий.ПолеВводаРасширенногоЗначения_НачалоВыбораЛкс(Элемент, СтандартнаяОбработка, РасширенноеЗначение);
	
КонецПроцедуры

Процедура РеквизитЗначениеПриИзменении(Элемент)
	
	ЭтаФорма.РасширенноеЗначение = РеквизитЗначение;
	
КонецПроцедуры

Процедура РеквизитЗначениеОчистка(Элемент, СтандартнаяОбработка)
	
	ЭтаФорма.РеквизитЗначение = Неопределено;
	ЭтаФорма.РасширенноеЗначение = РеквизитЗначение;
	
КонецПроцедуры

Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	ирОбщий.Форма_ВнешнееСобытиеЛкс(ЭтаФорма, Источник, Событие, Данные);

КонецПроцедуры

ирОбщий.ИнициализироватьФормуЛкс(ЭтаФорма, "Обработка.ирПлатформа.Форма.Граница");
СписокВыбора = ЭлементыФормы.ВидГраницы.СписокВыбора;
СписокВыбора.Добавить(ВидГраницы.Включая, "Включая");
СписокВыбора.Добавить(ВидГраницы.Исключая, "Исключая");

ОписаниеТипов = ирОбщий.ОписаниеТиповВсеСсылкиЛкс();
ОписаниеТипов = Новый ОписаниеТипов(ОписаниеТипов, "МоментВремени, Дата, Строка, Число, Булево, УникальныйИдентификатор");
ЭлементыФормы.РеквизитЗначение.ОграничениеТипа = ОписаниеТипов;